Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.Kusto.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# ConnectionServiceConnectErrorNullParams
source: Connection parameters cannot be null
sr: Parâmetros de Conexão não podem ser nulos

# ConnectionServiceListDbErrorNullOwnerUri
source: OwnerUri cannot be null or empty
sr: OwnerUri não pode ser nulo ou vazio

# ConnectionServiceListDbErrorNotConnected
source: SpecifiedUri '{0}' does not have existing connection
sr: SpecifiedUri '{0}' não há uma conexão existente

# ConnectionServiceConnStringInvalidAuthType
source: Invalid value '{0}' for AuthenticationType. Valid values are 'Integrated' and 'SqlLogin'.
sr: Valor inválido '{0}' para AuthenticationType. Os valores válidos são 'Integrada' e 'SqlLogin'.

# ConnectionServiceConnStringInvalidIntent
source: Invalid value '{0}' for ApplicationIntent. Valid values are 'ReadWrite' and 'ReadOnly'.
sr: Valor inválido '{0}' para ApplicationIntent. Os valores válidos são 'ReadWrite' e 'Somente leitura'.

# ConnectionServiceConnectionCanceled
source: Connection canceled
sr: Conexão cancelada

# ConnectionParamsValidateNullOwnerUri
source: OwnerUri cannot be null or empty
sr: OwnerUri não pode ser nulo ou vazio

# ConnectionParamsValidateNullConnection
source: Connection details object cannot be null
sr: Objeto de detalhes de Conexão não pode ser nulo

# ConnectionParamsValidateNullServerName
source: ServerName cannot be null or empty
sr: ServerName não pode ser nulo ou vazio

# ConnectionParamsValidateNullSqlAuth
source: {0} cannot be null or empty when using SqlLogin authentication
sr: {0} não pode ser nulo ou vazio quando estiver usando autenticação SqlLogin

# QueryServiceCancelAlreadyCompleted
source: The query has already completed, it cannot be cancelled
sr: A consulta já foi concluída, ela não pode ser cancelada

# QueryServiceCancelDisposeFailed
source: Query successfully cancelled, failed to dispose query. Owner URI not found.
sr: Consulta cancelada com êxito, Falha ao descartar a consulta. Proprietário do URI não encontrado.

# QueryServiceQueryCancelled
source: Query was canceled by user
sr: Consulta foi cancelada pelo usuário

# QueryServiceSubsetBatchNotCompleted
source: The batch has not completed, yet
sr: O lote ainda não foi concluído.

# QueryServiceSubsetBatchOutOfRange
source: Batch index cannot be less than 0 or greater than the number of batches
sr: Índice de lote não pode ser menor que 0 ou maior que o número de lotes

# QueryServiceSubsetResultSetOutOfRange
source: Result set index cannot be less than 0 or greater than the number of result sets
sr: Índice do conjunto de resultados não pode ser menor que 0 ou maior que o número do conjuntos de resultados

# QueryServiceDataReaderByteCountInvalid
source: Maximum number of bytes to return must be greater than zero
sr: Número máximo de bytes a serem retornados deve ser maior que zero

# QueryServiceDataReaderCharCountInvalid
source: Maximum number of chars to return must be greater than zero
sr: Número máximo de caracteres a serem retornados deve ser maior que zero

# QueryServiceDataReaderXmlCountInvalid
source: Maximum number of XML bytes to return must be greater than zero
sr: Número máximo de bytes XML a serem retornados deve ser maior que zero

# QueryServiceFileWrapperWriteOnly
source: Access method cannot be write-only
sr: Método de acesso não pode ser somente gravação

# QueryServiceFileWrapperNotInitialized
source: FileStreamWrapper must be initialized before performing operations
sr: FileStreamWrapper deve ser inicializado antes de executar operações

# QueryServiceFileWrapperReadOnly
source: This FileStreamWrapper cannot be used for writing
sr: Este FileStreamWrapper não pode ser usado para gravação

# QueryServiceAffectedOneRow
source: (1 row affected)
sr: (1 linha afetada)

# QueryServiceAffectedRows
source: ({0} rows affected)
sr: ({0} linhas afetadas)

# QueryServiceCompletedSuccessfully
source: Commands completed successfully.
sr: Comandos concluídos com sucesso.

# QueryServiceErrorFormat
source: Msg {0}, Level {1}, State {2}, Line {3}{4}{5}
sr: Msg {0}, Nível {1}, Estado {2}, Linha {3} {4} {5}

# QueryServiceQueryFailed
source: Query failed: {0}
sr: Falha na consulta: {0}

# QueryServiceColumnNull
source: (No column name)
sr: (Nenhum nome de coluna)

# QueryServiceRequestsNoQuery
source: The requested query does not exist
sr: A consulta solicitada não existe.

# QueryServiceQueryInvalidOwnerUri
source: This editor is not connected to a database
sr: Este editor não está conectado a um banco de dados

# QueryServiceQueryInProgress
source: A query is already in progress for this editor session. Please cancel this query or wait for its completion.
sr: Uma consulta já está em andamento para esta sessão do editor. Favor cancelar esta consulta ou aguardar a sua conclusão

# QueryServiceMessageSenderNotSql
source: Sender for OnInfoMessage event must be a SqlConnection
sr: Remetente do evento OnInfoMessage deve ser um SqlConnection

# QueryServiceSaveAsResultSetNotComplete
source: Result cannot be saved until query execution has completed
sr: Resultado não pode ser salvo até que seja concluída a execução da consulta

# QueryServiceSaveAsMiscStartingError
source: Internal error occurred while starting save task
sr: Ocorreu um erro interno ao iniciar tarefa de salvamento

# QueryServiceSaveAsInProgress
source: A save request to the same path is in progress
sr: Uma solicitação de salvamento para o mesmo caminho está em andamento

# QueryServiceSaveAsFail
source: Failed to save {0}: {1}
sr: Falha ao salvar {0}: {1}

# QueryServiceResultSetNotRead
source: Cannot read subset unless the results have been read from the server
sr: Não é possível ler o subconjunto, a menos que os resultados tenham sido lidos do servidor

# QueryServiceResultSetStartRowOutOfRange
source: Start row cannot be less than 0 or greater than the number of rows in the result set
sr: Linha de início não pode ser menor que 0 ou maior que o número de linhas no conjunto de resultados

# QueryServiceResultSetRowCountOutOfRange
source: Row count must be a positive integer
sr: Contagem de linhas deve ser um inteiro positivo

# QueryServiceResultSetNoColumnSchema
source: Could not retrieve column schema for result set
sr: Não foi possível recuperar o esquema de colunas para o conjunto de resultados

# QueryServiceExecutionPlanNotFound
source: Could not retrieve an execution plan from the result set
sr: Não foi possível recuperar um plano de execução do conjunto de resultados

# PeekDefinitionAzureError
source: This feature is currently not supported on Azure SQL DB and Data Warehouse: {0}
sr: Esse recurso não é atualmente suportado no banco de dados de SQL Azure e Data Warehouse: {0}

# PeekDefinitionError
source: An unexpected error occurred during Peek Definition execution: {0}
sr: Ocorreu um erro inesperado durante a execução da inspeção da definição:

# PeekDefinitionNoResultsError
source: No results were found.
sr: Nenhum resultado foi encontrado.

# PeekDefinitionDatabaseError
source: No database object was retrieved.
sr: Nenhum objeto de banco de dados foi recuperado.

# PeekDefinitionNotConnectedError
source: Please connect to a server.
sr: Favor conectar-se a um servidor.

# PeekDefinitionTimedoutError
source: Operation timed out.
sr: Tempo limite da operação esgotado.

# PeekDefinitionTypeNotSupportedError
source: This object type is currently not supported by this feature.
sr: Este tipo de objeto não é suportado atualmente por esse recurso.

# WorkspaceServicePositionLineOutOfRange
source: Position is outside of file line range
sr: Posição está fora do intervalo de linhas do arquivo

# WorkspaceServicePositionColumnOutOfRange
source: Position is outside of column range for line {0}
sr: A posição está fora do intervalo de colunas para linha {0}

# WorkspaceServiceBufferPositionOutOfOrder
source: Start position ({0}, {1}) must come before or be equal to the end position ({2}, {3})
sr: Posição inicial ({0}, {1}) deve vir antes ou ser igual a posição final ({2}, {3})

# EE_BatchSqlMessageNoProcedureInfo
source: Msg {0}, Level {1}, State {2}, Line {3}
sr: Msg {0}, Nível {1}, Estado {2}, Linha {3}

# EE_BatchSqlMessageWithProcedureInfo
source: Msg {0}, Level {1}, State {2}, Procedure {3}, Line {4}
sr: Msg {0}, Nível {1}, Estado {2}, Procedimento {3}, Linha {4}

# EE_BatchSqlMessageNoLineInfo
source: Msg {0}, Level {1}, State {2}
sr: Msg {0}, Nível {1}, Estado {2}

# EE_BatchError_Exception
source: An error occurred while the batch was being processed. The error message is: {0}
sr: Ocorreu um erro durante o processamento do lote. A mensagem de erro é: {0}

# EE_BatchExecutionInfo_RowsAffected
source: ({0} row(s) affected)
sr: ({0} linhas afetadas)

# EE_ExecutionNotYetCompleteError
source: The previous execution is not yet complete.
sr: Execução anterior ainda não foi concluída.

# EE_ScriptError_Error
source: A scripting error occurred.
sr: Ocorreu um erro de script.

# EE_ScriptError_ParsingSyntax
source: Incorrect syntax was encountered while {0} was being parsed.
sr: Sintaxe incorreta foi encontrada enquanto {0} estava sendo analisado.

# EE_ScriptError_FatalError
source: A fatal error occurred.
sr: Ocorreu um erro fatal.

# EE_ExecutionInfo_FinalizingLoop
source: Batch execution completed {0} times...
sr: Execução concluída {0} vezes...

# EE_ExecutionInfo_QueryCancelledbyUser
source: You cancelled the query.
sr: Você cancelou a consulta.

# EE_BatchExecutionError_Halting
source: An error occurred while the batch was being executed.
sr: Ocorreu um erro enquanto o lote estava sendo executado.

# EE_BatchExecutionError_Ignoring
source: An error occurred while the batch was being executed, but the error has been ignored.
sr: Ocorreu um erro enquanto o lote estava sendo executado, mas o erro foi ignorado.

# EE_ExecutionError_CommandNotSupported
source: Command {0} is not supported.
sr: Comando {0} não é suportado.

# EE_ExecutionError_VariableNotFound
source: The variable {0} could not be found.
sr: A variável {0} não pôde ser encontrada.

# BatchParserWrapperExecutionEngineError
source: SQL Execution error: {0}
sr: Erro de execução de SQL: {0}

# BatchParserWrapperExecutionError
source: Batch parser wrapper execution: {0} found... at line {1}: {2} Description: {3}
sr: Execução do pacote do analisador de lotes: {0} encontrado... na linha {1}: {2} Descrição: {3}

# BatchParserWrapperExecutionEngineBatchMessage
source: Batch parser wrapper execution engine batch message received: Message: {0} Detailed message: {1}
sr: Mensagem recebida do motor de execução do pacote do analisador de lotes: Mensagem: {0} Mensagem detalhada: {1}

# BatchParserWrapperExecutionEngineBatchResultSetProcessing
source: Batch parser wrapper execution engine batch ResultSet processing: DataReader.FieldCount: {0} DataReader.RecordsAffected: {1}
sr: Processando o conjunto de resultados no motor de execução do pacote do analisador de lotes: DataReader.FieldCount: {0} DataReader.RecordsAffected: {1}

source: Batch parser wrapper execution engine batch ResultSet finished.
sr: Execução do conjunto de resultados do motor de execução de pacotes do analisador de lotes terminada.

# BatchParserWrapperExecutionEngineBatchCancelling
source: Canceling batch parser wrapper batch execution.
sr: Cancelando execução do conjunto de resultados do motor de execução de pacotes do analisador de lotes.

# EE_ScriptError_Warning
source: Scripting warning.
sr: Aviso de script.

# TroubleshootingAssistanceMessage
source: For more information about this error, see the troubleshooting topics in the product documentation.
sr: Para obter mais informações sobre esse erro, consulte os tópicos de solução de problemas na documentação do produto.

# BatchParser_CircularReference
source: File '{0}' recursively included.
sr: Arquivo '{0}' incluído recursivamente.

# BatchParser_CommentNotTerminated
source: Missing end comment mark '*/'.
sr: Sem marca de comentário final ' * /'.

# BatchParser_StringNotTerminated
source: Unclosed quotation mark after the character string.
sr: Aspas não fechadas depois da sequência de caracteres.

# BatchParser_IncorrectSyntax
source: Incorrect syntax was encountered while parsing '{0}'.
sr: Sintaxe incorreta foi encontrada enquanto {0} estava sendo analisado.

# BatchParser_VariableNotDefined
source: Variable {0} is not defined.
sr: A variável {0} não está definida.

# TestLocalizationConstant
source: test
sr: teste

# ErrorEmptyStringReplacement
source: Replacement of an empty string by an empty string.
sr: Substituição de uma sequência vazia por uma cadeia de caracteres vazia.

# EditDataSessionNotFound
source: Edit session does not exist.
sr: Sessão de edição não existe.

# EditDataQueryNotCompleted
source: Query has not completed execution
sr: A consulta não completou a execução

# EditDataQueryImproperResultSets
source: Query did not generate exactly one result set
sr: A consulta não gerou exatamente um conjunto de resultados

# EditDataFailedAddRow
source: Failed to add new row to update cache
sr: Falha ao adicionar uma nova linha ao cache de atualização

# EditDataRowOutOfRange
source: Given row ID is outside the range of rows in the edit cache
sr: ID de linha de entrada fora da faixa de linhas no cache de edição

# EditDataUpdatePending
source: An update is already pending for this row and must be reverted first
sr: Uma atualização está ainda pendente para esta linha e deve ser revertida antes

# EditDataUpdateNotPending
source: Given row ID does not have pending update
sr: Não existem atualizações pendentes para o ID informado.

# EditDataObjectMetadataNotFound
source: Table or view metadata could not be found
sr: Tabela ou view de metadados não pode ser encontrada

# EditDataInvalidFormatBinary
source: Invalid format for binary column
sr: Formato inválido para coluna binária

# EditDataInvalidFormatBoolean
source: Allowed values for boolean columns are 0, 1, "true", or "false"
sr: Colunas Booleanas devem possuir o número 1 ou 0 ou a string true ou false

# EditDataCreateScriptMissingValue
source: The column '{0}' is defined as NOT NULL but was not given a value
sr: Um valor requerido para a célula está faltando

# EditDataDeleteSetCell
source: A delete is pending for this row, a cell update cannot be applied.
sr: Uma exclusão está pendente para esta linha. Uma atualização desta célula não pode ser aplicada.

# EditDataColumnIdOutOfRange
source: Column ID must be in the range of columns for the query
sr: Um ID de coluna deve estar no intervalo de colunas para a consulta

# EditDataColumnCannotBeEdited
source: Column cannot be edited
sr: Coluna não pode ser editada

# EditDataColumnNoKeyColumns
source: No key columns were found
sr: Não foram encontradas colunas chave

# EditDataScriptFilePathNull
source: An output filename must be provided
sr: Um nome de arquivo de saída deve ser fornecido

# EditDataUnsupportedObjectType
source: Database object {0} cannot be used for editing.
sr: O objecto de banco de dados {0} não pode ser usado para edição.

# ConnectionServiceDbErrorDefaultNotConnected
source: Specified URI '{0}' does not have a default connection
sr: A URI especificada '{0}' não tem uma conexão padrão

# EditDataCommitInProgress
source: A commit task is in progress. Please wait for completion.
sr: Uma tarefa de gravação está em progresso. Favor aguardar o térnino.

# SqlScriptFormatterDecimalMissingPrecision
source: Decimal column is missing numeric precision or numeric scale
sr: Coluna decimal não tem precisão numérica ou escala numérica

# QueryServiceResultSetAddNoRows
source: Cannot add row to result buffer, data reader does not contain rows
sr: Não é possível adicionar linha ao buffer de resultados, o datareader não contém linhas

# EditDataTimeOver24Hrs
source: TIME column values must be between 00:00:00.0000000 and 23:59:59.9999999
sr: Os valores da coluna do tipo de dados TIME devem estar entre 00:00:00.0000000 e 23:59:59.9999999

# EditDataNullNotAllowed
source: NULL is not allowed for this column
sr: Nulo não é permitido para esta coluna.

# EditDataSessionAlreadyExists
source: Edit session already exists.
sr: Sessão de edição já existe.

# EditDataSessionNotInitialized
source: Edit session has not been initialized
sr: Sessão de edição não foi inicializada

# EditDataSessionAlreadyInitialized
source: Edit session has already been initialized
sr: Sessão de edição já foi inicializada

# EditDataSessionAlreadyInitializing
source: Edit session has already been initialized or is in the process of initializing
sr: Sessão de edição já foi inicializada ou está em processo de inicialização

# EditDataQueryFailed
source: Query execution failed, see messages for details
sr: A execução da consulta falhou, veja as mensagens para detalhes

# EditDataFilteringNegativeLimit
source: Result limit cannot be negative
sr: Limite de resultados não pode ser negativo

# EditDataMetadataObjectNameRequired
source: A object name must be provided
sr: O nome do objeto deve ser fornecido.

# EditDataMetadataTooManyIdentifiers
source: Explicitly specifying server or database is not supported
sr: O servidor ou banco de dados especificado não é suportado.

# EditDataMetadataNotExtended
source: Table metadata does not have extended properties
sr: Metadados da tabela não possuem propriedades extendidas

# EditDataObjectNotFound
source: Table or view requested for edit could not be found
sr: Tabela ou view requisitada para edição não foi encontrada

# TreeNodeError
source: Error expanding: {0}
sr: Erro expandindo: {0}

# ServerNodeConnectionError
source: Error connecting to {0}
sr: Erro conectando a {0}

# SchemaHierarchy_Aggregates
source: Aggregates
sr: Agregados

# SchemaHierarchy_ServerRoles
source: Server Roles
sr: Funcões de Servidor

# SchemaHierarchy_ApplicationRoles
source: Application Roles
sr: Funções de Aplicação

# SchemaHierarchy_AssemblyFiles
source: Assembly Files
sr: Arquivos de Assemblies

# SchemaHierarchy_AsymmetricKeys
source: Asymmetric Keys
sr: Chaves Assimétricas

# SchemaHierarchy_DatabaseAsymmetricKeys
source: Asymmetric Keys
sr: Chaves Assimétricas

# SchemaHierarchy_DataCompressionOptions
source: Data Compression Options
sr: Opções de Compressão de Dados

# SchemaHierarchy_Certificates
source: Certificates
sr: Certificados

# SchemaHierarchy_FileTables
source: FileTables
sr: Tabelas de Arquivos

# SchemaHierarchy_DatabaseCertificates
source: Certificates
sr: Certificados

# SchemaHierarchy_CheckConstraints
source: Check Constraints
sr: Verificação de Restrições

# SchemaHierarchy_Columns
source: Columns
sr: Colunas

# SchemaHierarchy_Constraints
source: Constraints
sr: Restrições

# SchemaHierarchy_Contracts
source: Contracts
sr: Contratos

# SchemaHierarchy_Credentials
source: Credentials
sr: Credenciais

# SchemaHierarchy_ErrorMessages
source: Error Messages
sr: Mensagens de Erro

# SchemaHierarchy_ServerRoleMembership
source: Server Role Membership
sr: Adesão às Funções de Servidor

# SchemaHierarchy_DatabaseOptions
source: Database Options
sr: Opções de Banco de Dados

# SchemaHierarchy_DatabaseRoles
source: Database Roles
sr: Funções de Bancos de Dados

# SchemaHierarchy_RoleMemberships
source: Role Memberships
sr: Adesão às Funções

# SchemaHierarchy_DatabaseTriggers
source: Database Triggers
sr: Gatilhos de Bancos de Dados

# SchemaHierarchy_DefaultConstraints
source: Default Constraints
sr: Restrições Padrão

# SchemaHierarchy_Defaults
source: Defaults
sr: Padrões

# SchemaHierarchy_Sequences
source: Sequences
sr: Sequências

# SchemaHierarchy_Endpoints
source: Endpoints
sr: Pontos finais

# SchemaHierarchy_EventNotifications
source: Event Notifications
sr: Notificações de Eventos

# SchemaHierarchy_ServerEventNotifications
source: Server Event Notifications
sr: Notificações de Eventos de Servidor

# SchemaHierarchy_ExtendedProperties
source: Extended Properties
sr: Propriedades Extendidas

# SchemaHierarchy_FileGroups
source: Filegroups
sr: Grupos de Arquivos

# SchemaHierarchy_ForeignKeys
source: Foreign Keys
sr: Chaves Estrangeiras

# SchemaHierarchy_FullTextCatalogs
source: Full-Text Catalogs
sr: Catálogos Full-Text

# SchemaHierarchy_FullTextIndexes
source: Full-Text Indexes
sr: Índices Full-Text

# SchemaHierarchy_Functions
source: Functions
sr: Funções

# SchemaHierarchy_Indexes
source: Indexes
sr: Índices

# SchemaHierarchy_InlineFunctions
source: Inline Functions
sr: Funções em Linha

# SchemaHierarchy_Keys
source: Keys
sr: Chaves

# SchemaHierarchy_LinkedServers
source: Linked Servers
sr: Servidores vinculados

# SchemaHierarchy_LinkedServerLogins
source: Linked Server Logins
sr: Logins de servidores vinculados

# SchemaHierarchy_MessageTypes
source: Message Types
sr: Tipos de Mensagens

# SchemaHierarchy_MultiSelectFunctions
source: Table-Valued Functions
sr: Funções de Valor de Tabelas

# SchemaHierarchy_Parameters
source: Parameters
sr: Parâmetros

# SchemaHierarchy_PartitionFunctions
source: Partition Functions
sr: Funções de Partição

# SchemaHierarchy_PartitionSchemes
source: Partition Schemes
sr: Esquemas de Partição

# SchemaHierarchy_Permissions
source: Permissions
sr: Permissões

# SchemaHierarchy_PrimaryKeys
source: Primary Keys
sr: Chaves Primárias

# SchemaHierarchy_Programmability
source: Programmability
sr: Programabilidade

# SchemaHierarchy_Queues
source: Queues
sr: Filas

# SchemaHierarchy_RemoteServiceBindings
source: Remote Service Bindings
sr: Ligações de Serviço Remoto

# SchemaHierarchy_ReturnedColumns
source: Returned Columns
sr: Colunas Retornadas

# SchemaHierarchy_Roles
source: Roles
sr: Funções

# SchemaHierarchy_Routes
source: Routes
sr: Rotas

# SchemaHierarchy_Rules
source: Rules
sr: Regras

# SchemaHierarchy_Schemas
source: Schemas
sr: Esquemas

# SchemaHierarchy_Security
source: Security
sr: Segurança

# SchemaHierarchy_ServerObjects
source: Server Objects
sr: Objetos de Servidor

# SchemaHierarchy_Management
source: Management
sr: Gerenciamento

# SchemaHierarchy_ServerTriggers
source: Triggers
sr: Gatilhos

# SchemaHierarchy_Services
source: Services
sr: Serviços

# SchemaHierarchy_Signatures
source: Signatures
sr: Assinaturas

# SchemaHierarchy_LogFiles
source: Log Files
sr: Arquivos de Log

# SchemaHierarchy_Statistics
source: Statistics
sr: Estatísticas

# SchemaHierarchy_Storage
source: Storage
sr: Armazenamento

# SchemaHierarchy_SymmetricKeys
source: Symmetric Keys
sr: Chaves Simétricas

# SchemaHierarchy_Synonyms
source: Synonyms
sr: Sinônimos

# SchemaHierarchy_Tables
source: Tables
sr: Tabelas

# SchemaHierarchy_Triggers
source: Triggers
sr: Gatilhos

# SchemaHierarchy_Types
source: Types
sr: Tipos

# SchemaHierarchy_UniqueKeys
source: Unique Keys
sr: Chaves Únicas

# SchemaHierarchy_UserDefinedDataTypes
source: User-Defined Data Types
sr: Tipos de Dados Definidos pelo Usuário

# SchemaHierarchy_UserDefinedTypes
source: User-Defined Types (CLR)
sr: Tipos Definidos pelo Usuário (CLR)

# SchemaHierarchy_Users
source: Users
sr: Usuários

# SchemaHierarchy_Views
source: Views
sr: Visualizações

# SchemaHierarchy_XmlIndexes
source: XML Indexes
sr: Índices XML

# SchemaHierarchy_XMLSchemaCollections
source: XML Schema Collections
sr: Coleções de Esquemas XML

# SchemaHierarchy_UserDefinedTableTypes
source: User-Defined Table Types
sr: Tipos de Tabelas Definidas pelo Usuário

# SchemaHierarchy_FilegroupFiles
source: Files
sr: Arquivos

source: Missing Caption
sr: Título Faltando

# SchemaHierarchy_BrokerPriorities
source: Broker Priorities
sr: Prioridades do Agente

# SchemaHierarchy_CryptographicProviders
source: Cryptographic Providers
sr: Provedores de Criptografia

# SchemaHierarchy_DatabaseAuditSpecifications
source: Database Audit Specifications
sr: Especificações de Auditoria de Banco de Dados

# SchemaHierarchy_DatabaseEncryptionKeys
source: Database Encryption Keys
sr: Chaves de Criptografia de Banco de Dados

# SchemaHierarchy_EventSessions
source: Event Sessions
sr: Sessões de Evento
