Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.Kusto.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# SchemaHierarchy_FullTextStopLists
source: Full Text Stoplists
sr: Listas de Parada Full Text

# SchemaHierarchy_ResourcePools
source: Resource Pools
sr: Pool de Recursos

# SchemaHierarchy_ServerAudits
source: Audits
sr: Auditorias

# SchemaHierarchy_ServerAuditSpecifications
source: Server Audit Specifications
sr: Especificações de Auditoria de Servidor

# SchemaHierarchy_SpatialIndexes
source: Spatial Indexes
sr: Índices Espaciais

# SchemaHierarchy_WorkloadGroups
source: Workload Groups
sr: Grupos de Trabalho

# SchemaHierarchy_SqlFiles
source: SQL Files
sr: Arquivos SQL

# SchemaHierarchy_ServerFunctions
source: Server Functions
sr: Funções de Servidor

# SchemaHierarchy_SqlType
source: SQL Type
sr: Tipo SQL

# SchemaHierarchy_ServerOptions
source: Server Options
sr: Opções de Servidor

# SchemaHierarchy_DatabaseDiagrams
source: Database Diagrams
sr: Diagramas de Banco de Dados

# SchemaHierarchy_SystemTables
source: System Tables
sr: Tabelas do Sistema

# SchemaHierarchy_Databases
source: Databases
sr: Bancos de Dados

# SchemaHierarchy_SystemContracts
source: System Contracts
sr: Contratos do Sistema

# SchemaHierarchy_SystemDatabases
source: System Databases
sr: Bancos de Dados do Sistema

# SchemaHierarchy_SystemMessageTypes
source: System Message Types
sr: Tipos de Mensagens do Sistema

# SchemaHierarchy_SystemQueues
source: System Queues
sr: Filas do Sistema

# SchemaHierarchy_SystemServices
source: System Services
sr: Serviços do Sistema

# SchemaHierarchy_SystemStoredProcedures
source: System Stored Procedures
sr: Stored Procedures do Sistema

# SchemaHierarchy_SystemViews
source: System Views
sr: Visualizações do Sistema

# SchemaHierarchy_DataTierApplications
source: Data-tier Applications
sr: Aplicações da Camada de Dados

# SchemaHierarchy_ExtendedStoredProcedures
source: Extended Stored Procedures
sr: Stored Procedures Estendidas

# SchemaHierarchy_SystemAggregateFunctions
source: Aggregate Functions
sr: Funções Agregadas

# SchemaHierarchy_SystemApproximateNumerics
source: Approximate Numerics
sr: Numéricos Aproximados

# SchemaHierarchy_SystemBinaryStrings
source: Binary Strings
sr: Cadeias de Caracteres Binárias

# SchemaHierarchy_SystemCharacterStrings
source: Character Strings
sr: Cadeias de Caracteres

# SchemaHierarchy_SystemCLRDataTypes
source: CLR Data Types
sr: Tipos de Dados CLR

# SchemaHierarchy_SystemConfigurationFunctions
source: Configuration Functions
sr: Funções de Configuração

# SchemaHierarchy_SystemCursorFunctions
source: Cursor Functions
sr: Funções de Cursor

# SchemaHierarchy_SystemDataTypes
source: System Data Types
sr: Tipos de Dados do Sistema

# SchemaHierarchy_SystemDateAndTime
source: Date and Time
sr: Data e Hora

# SchemaHierarchy_SystemDateAndTimeFunctions
source: Date and Time Functions
sr: Funções de Data e Hora

# SchemaHierarchy_SystemExactNumerics
source: Exact Numerics
sr: Numéricos Exatos

# SchemaHierarchy_SystemFunctions
source: System Functions
sr: Funções do Sistema

# SchemaHierarchy_SystemHierarchyIdFunctions
source: Hierarchy Id Functions
sr: Funções de ID de Hierarquia

# SchemaHierarchy_SystemMathematicalFunctions
source: Mathematical Functions
sr: Funções Matemáticas

# SchemaHierarchy_SystemMetadataFunctions
source: Metadata Functions
sr: Funções de Metadados

# SchemaHierarchy_SystemOtherDataTypes
source: Other Data Types
sr: Outros tipos de Dados

# SchemaHierarchy_SystemOtherFunctions
source: Other Functions
sr: Outras Funções

# SchemaHierarchy_SystemRowsetFunctions
source: Rowset Functions
sr: Funções de Conjuntos de Linhas

# SchemaHierarchy_SystemSecurityFunctions
source: Security Functions
sr: Funções de Segurança

# SchemaHierarchy_SystemSpatialDataTypes
source: Spatial Data Types
sr: Tipos de Dados Espaciais

# SchemaHierarchy_SystemStringFunctions
source: String Functions
sr: Funções de Cadeias de Caracteres

# SchemaHierarchy_SystemSystemStatisticalFunctions
source: System Statistical Functions
sr: Funções Estatísticas do Sistema

# SchemaHierarchy_SystemTextAndImageFunctions
source: Text and Image Functions
sr: Funções de Texto e Imagem

# SchemaHierarchy_SystemUnicodeCharacterStrings
source: Unicode Character Strings
sr: Cadeias de Caracteres Unicode

# SchemaHierarchy_AggregateFunctions
source: Aggregate Functions
sr: Funções Agregadas

# SchemaHierarchy_ScalarValuedFunctions
source: Scalar-valued Functions
sr: Funções de Valores Escalares

# SchemaHierarchy_TableValuedFunctions
source: Table-valued Functions
sr: Funções de Valores Baseadas em Tabelas

# SchemaHierarchy_SystemExtendedStoredProcedures
source: System Extended Stored Procedures
sr: Stored Procedures do Sistema Estendidas

# SchemaHierarchy_BuiltInType
source: Built-in Types
sr: Tipos Intrínsecos

# SchemaHierarchy_BuiltInServerRole
source: Built-in Server Roles
sr: Funções de Servidor Intrínsecas

# SchemaHierarchy_UserWithPassword
source: User with Password
sr: Usuário com Senha

# SchemaHierarchy_SearchPropertyList
source: Search Property List
sr: Pesquisar Lista de Propriedades

# SchemaHierarchy_SecurityPolicies
source: Security Policies
sr: Políticas de Segurança

# SchemaHierarchy_SecurityPredicates
source: Security Predicates
sr: Predicados de Segurança

# SchemaHierarchy_ServerRole
source: Server Role
sr: Função de Servidor

# SchemaHierarchy_SearchPropertyLists
source: Search Property Lists
sr: Pesquisar Listas de Propriedades

# SchemaHierarchy_ColumnStoreIndexes
source: Column Store Indexes
sr: Índices de Colunas

# SchemaHierarchy_TableTypeIndexes
source: Table Type Indexes
sr: Índices de Tipos de Tabelas

# SchemaHierarchy_SelectiveXmlIndexes
source: Selective XML Indexes
sr: Índices XML Seletivos

# SchemaHierarchy_XmlNamespaces
source: XML Namespaces
sr: Namespaces XML

# SchemaHierarchy_XmlTypedPromotedPaths
source: XML Typed Promoted Paths
sr: Caminhos Promovidos de Tipos XML

# SchemaHierarchy_SqlTypedPromotedPaths
source: T-SQL Typed Promoted Paths
sr: Caminhos Promovidos de Tipos T-SQL

# SchemaHierarchy_DatabaseScopedCredentials
source: Database Scoped Credentials
sr: Credenciais de Escopo de Banco de Dados

# SchemaHierarchy_ExternalDataSources
source: External Data Sources
sr: Fontes de Dados Externas

# SchemaHierarchy_ExternalFileFormats
source: External File Formats
sr: Formatos de Arquivos Externos

# SchemaHierarchy_ExternalResources
source: External Resources
sr: Recursos Externos

# SchemaHierarchy_ExternalTables
source: External Tables
sr: Tabelas Externas

# SchemaHierarchy_AlwaysEncryptedKeys
source: Always Encrypted Keys
sr: Chaves Sempre Criptografadas

# SchemaHierarchy_ColumnMasterKeys
source: Column Master Keys
sr: Chaves Mestras de Colunas

# SchemaHierarchy_ColumnEncryptionKeys
source: Column Encryption Keys
sr: Chaves de Criptografia de Colunas

# SchemaHierarchy_Server
source: Server
sr: Servidor

# ScriptingParams_ConnectionString_Property_Invalid
source: Error parsing ScriptingParams.ConnectionString property.
sr: Erro ao analisar a propriedade ScriptingParams.ConnectionString.

# ScriptingParams_FilePath_Property_Invalid
source: Invalid directory specified by the ScriptingParams.FilePath property.
sr: Diretório inválido especificado pela propriedade ScriptingParams.FilePath.

# ScriptingListObjectsCompleteParams_ConnectionString_Property_Invalid
source: Error parsing ScriptingListObjectsCompleteParams.ConnectionString property.
sr: Erro ao analisar a propriedade ScriptingListObjectsCompleteParams.ConnectionString.

# SchemaHierarchy_SubroutineParameterNoDefaultLabel
source: No default
sr: Nenhum padrão

# SchemaHierarchy_SubroutineParameterInputLabel
source: Input
sr: Entrada

# SchemaHierarchy_SubroutineParameterInputOutputLabel
source: Input/Output
sr: Entrada/Saída

# SchemaHierarchy_SubroutineParameterInputReadOnlyLabel
source: Input/ReadOnly
sr: Entrada/SomenteLeitura

# SchemaHierarchy_SubroutineParameterInputOutputReadOnlyLabel
source: Input/Output/ReadOnly
sr: Entrada/Saída/SomenteLeitura

# SchemaHierarchy_SubroutineParameterDefaultLabel
source: Default
sr: Padrão

# SchemaHierarchy_NullColumn_Label
source: null
sr: nulo

# SchemaHierarchy_NotNullColumn_Label
source: not null
sr: não nulo

# SchemaHierarchy_ComputedColumnLabelWithType
source: {0} ({1}Computed, {2}, {3})
sr: {0} ({1} Computado, {2}, {3})

# SchemaHierarchy_ComputedColumnLabelWithoutType
source: {0} ({1}Computed)
sr: {0} ({1}Computado)

# SchemaHierarchy_ColumnSetLabelWithoutType
source: {0} (Column Set, {1})
sr: {0} (Conjunto de Colunas, {1})

# SchemaHierarchy_ColumnSetLabelWithType
source: {0} (Column Set, {1}{2}, {3})
sr: {0} (Conjunto de Colunas, {1}{2}, {3})

# SchemaHierarchy_ColumnSetLabelWithTypeAndKeyString
source: {0} (Column Set, {1}, {2}, {3})
sr: {0} (Conjunto de Colunas, {1}, {2}, {3})

# UniqueIndex_LabelPart
source: Unique
sr: Exclusivo

# NonUniqueIndex_LabelPart
source: Non-Unique
sr: Não Exclusivo

# ClusteredIndex_LabelPart
source: Clustered
sr: Clusterizado

# NonClusteredIndex_LabelPart
source: Non-Clustered
sr: Não Clusterizado

# History_LabelPart
source: History
sr: Histórico

# SystemVersioned_LabelPart
source: System-Versioned
sr: Versionado pelo sistema

source: Unavailable
sr: Indisponível

# filegroup_dialog_defaultFilegroup
source: Current default filegroup: {0}
sr: Grupo de arquivos padrão atual: {0}

# filegroup_dialog_title
source: New Filegroup for {0}
sr: Novo Grupo de Arquivos para {0}

# filegroups_default
source: Default
sr: Padrão

# filegroups_files
source: Files
sr: Arquivos

# filegroups_name
source: Name
sr: Nome

# filegroups_readonly
source: Read-Only
sr: Somente Leitura

# general_autogrowth
source: Autogrowth / Maxsize
sr: Auto crescimento / Tamanho máximo

# general_default
source: <default>
sr: <padrão>

# general_fileGroup
source: Filegroup
sr: Grupo de Arquivos

# general_fileName
source: Logical Name
sr: Nome Lógico

# general_fileType
source: File Type
sr: Tipo de Arquivo

# general_initialSize
source: Initial Size (MB)
sr: Tamanho Inicial (MB)

# general_newFilegroup
source: <new filegroup>
sr: <novo grupo de arquivos>

# general_path
source: Path
sr: Caminho

# general_physicalFileName
source: File Name
sr: Nome do Arquivo

# general_rawDevice
source: <raw device>
sr: <dispositivo bruto>

# general_recoveryModel_bulkLogged
source: Bulk-logged
sr: Logado em massa

# general_recoveryModel_full
source: Full
sr: Completo

# general_recoveryModel_simple
source: Simple
sr: Simples

# general_titleSearchOwner
source: Select Database Owner
sr: Selecionar o proprietário do banco de dados

# prototype_autogrowth_disabled
source: None
sr: Nenhum

# prototype_autogrowth_restrictedGrowthByMB
source: By {0} MB, Limited to {1} MB
sr: Por {0} MB, limitado a {1} MB

# prototype_autogrowth_restrictedGrowthByPercent
source: By {0} percent, Limited to {1} MB
sr: Por {0}%, Limitado a {1} mb

# prototype_autogrowth_unrestrictedGrowthByMB
source: By {0} MB, Unlimited
sr: Por {0} MB, Ilimitado

# prototype_autogrowth_unrestrictedGrowthByPercent
source: By {0} percent, Unlimited
sr: Por {0}%, Ilimitado

# prototype_autogrowth_unlimitedfilestream
source: Unlimited
sr: Ilimitado

# prototype_autogrowth_limitedfilestream
source: Limited to {0} MB
sr: Limitado a {0} MB

# prototype_db_category_automatic
source: Automatic
sr: Automático

# prototype_db_category_collation
source: Collation
sr: Agrupamento

# prototype_db_category_misc
source: Miscellaneous
sr: Diversos

# prototype_db_category_recovery
source: Recovery
sr: Recuperação

# prototype_db_category_state
source: State
sr: Estado

# prototype_db_prop_ansiNullDefault
source: ANSI NULL Default
sr: Padrão ANSI NULL

# prototype_db_prop_ansiNulls
source: ANSI NULLS Enabled
sr: ANSI NULLS Habilitado

# prototype_db_prop_ansiPadding
source: ANSI Padding Enabled
sr: Preenchimento ANSI habilitado

# prototype_db_prop_ansiWarnings
source: ANSI Warnings Enabled
sr: ANSI Warnings Habilitados

# prototype_db_prop_arithabort
source: Arithmetic Abort Enabled
sr: Arithmetic Abortar habilitado

# prototype_db_prop_autoClose
source: Auto Close
sr: Fechamento automático

# prototype_db_prop_autoCreateStatistics
source: Auto Create Statistics
sr: Criar Estatísticas Automaticamente

# prototype_db_prop_autoShrink
source: Auto Shrink
sr: Reduzir Automaticamente

# prototype_db_prop_autoUpdateStatistics
source: Auto Update Statistics
sr: Estatísticas Atualizadas Automaticamente

# prototype_db_prop_autoUpdateStatisticsAsync
source: Auto Update Statistics Asynchronously
sr: Atualizar estatísticas automaticamente de forma assíncrona

# prototype_db_prop_caseSensitive
source: Case Sensitive
sr: Sensível à Caixa

# prototype_db_prop_closeCursorOnCommit
source: Close Cursor on Commit Enabled
sr: Fechar Cursor na Confirmação Habilitado

# prototype_db_prop_collation
source: Collation
sr: Agrupamento

# prototype_db_prop_concatNullYieldsNull
source: Concatenate Null Yields Null
sr: Concatenar Nulo Produz Nulo

# prototype_db_prop_databaseCompatibilityLevel
source: Database Compatibility Level
sr: Nível de Compatibilidade do Banco de Dados

# prototype_db_prop_databaseState
source: Database State
sr: Estado do Banco de Dados

# prototype_db_prop_defaultCursor
source: Default Cursor
sr: Cursor Padrão

# prototype_db_prop_fullTextIndexing
source: Full-Text Indexing Enabled
sr: Indexação Full-Text Habilitada

# prototype_db_prop_numericRoundAbort
source: Numeric Round-Abort
sr: Anular arredondamento numérico.

# prototype_db_prop_pageVerify
source: Page Verify
sr: Verificação de Página

# prototype_db_prop_quotedIdentifier
source: Quoted Identifiers Enabled
sr: Identificadores Entre Aspas Habilitados

# prototype_db_prop_readOnly
source: Database Read-Only
sr: Banco de Dados Somente Leitura

# prototype_db_prop_recursiveTriggers
source: Recursive Triggers Enabled
sr: Gatilhos Recursivos Habilitados

# prototype_db_prop_restrictAccess
source: Restrict Access
sr: Acesso Restrito

# prototype_db_prop_selectIntoBulkCopy
source: Select Into/Bulk Copy
sr: Selecionar Cópia Into/Em Massa

# prototype_db_prop_honorBrokerPriority
source: Honor Broker Priority
sr: Respeitar a Prioridade do Broker

# prototype_db_prop_serviceBrokerGuid
source: Service Broker Identifier
sr: Identificador de agente de serviço

# prototype_db_prop_brokerEnabled
source: Broker Enabled
sr: Agente habilitado

# prototype_db_prop_truncateLogOnCheckpoint
source: Truncate Log on Checkpoint
sr: Truncar o Log no Ponto de Verificação

# prototype_db_prop_dbChaining
source: Cross-database Ownership Chaining Enabled
sr: Encadeamento de Propriedades de Bancos de Dados Habilitado

# prototype_db_prop_trustworthy
source: Trustworthy
sr: Confiável

# prototype_db_prop_dateCorrelationOptimization
source: Date Correlation Optimization Enabled
sr: Otimizaçao da Correlação de Data Enabledprototype_db_prop_parameterization = Parametrização

# prototype_db_prop_parameterization_value_forced
source: Forced
sr: Forçado

# prototype_db_prop_parameterization_value_simple
source: Simple
sr: Simples

# prototype_file_dataFile
source: ROWS Data
sr: Dados ROWS

# prototype_file_filestreamFile
source: FILESTREAM Data
sr: Dados FILESTREAM

# prototype_file_noFileGroup
source: Not Applicable
sr: Não aplicável

# prototype_file_defaultpathstring
source: <default path>
sr: <caminho padrão>

# title_openConnectionsMustBeClosed
source: Open Connections
sr: Conexões Abertas

# warning_openConnectionsMustBeClosed
source: To change the database properties, SQL Server must close all other connections to the database_ Are you sure you want to change the properties and close all other connections?
sr: Para modificar as propriedades do banco de dados, o SQL Server deve fechar todas as outras conexões ao banco de dados_ Tem certeza que você quer modificar as propriedades e fechar todas as outras conexões?

# prototype_db_prop_databaseState_value_emergency
source: EMERGENCY
sr: EMERGÊNCIA

# prototype_db_prop_databaseState_value_inaccessible
source: INACCESSIBLE
sr: INACESSÍVEL

# prototype_db_prop_databaseState_value_recovering
source: RECOVERING
sr: RECUPERANDO

# prototype_db_prop_databaseState_value_recoveryPending
source: RECOVERY PENDING
sr: RECUPERAÇÃO PENDENTE

# prototype_db_prop_databaseState_value_restoring
source: RESTORING
sr: RESTAURANDO

# prototype_db_prop_databaseState_value_shutdown
source: SHUTDOWN
sr: DESLIGAMENTO

# prototype_db_prop_databaseState_value_standby
source: STANDBY
sr: MODO DE ESPERA

# prototype_db_prop_databaseState_value_suspect
source: SUSPECT
sr: SUSPEITO

# prototype_db_prop_restrictAccess_value_multiple
source: MULTI_USER
sr: MULTI_USUÁRIO

# prototype_db_prop_restrictAccess_value_restricted
source: RESTRICTED_USER
sr: USUÁRIO_RESTRITO

# prototype_db_prop_restrictAccess_value_single
source: SINGLE_USER
sr: MONO_USUÁRIO

# prototype_db_prop_pageVerify_value_checksum
source: CHECKSUM
sr: SOMA DE VERIFICAÇÃO

# prototype_db_prop_pageVerify_value_none
source: NONE
sr: NENHUM

# prototype_db_prop_varDecimalEnabled
source: VarDecimal Storage Format Enabled
sr: Formato de Armazenamento VarDecimal Habilitado

# prototype_db_prop_encryptionEnabled
source: Encryption Enabled
sr: Criptografia Habilitada

# prototype_db_prop_databasescopedconfig_value_off
source: OFF
sr: DESLIGADO

# prototype_db_prop_databasescopedconfig_value_on
source: ON
sr: LIGADO

# prototype_db_prop_databasescopedconfig_value_primary
source: PRIMARY
sr: PRIMÁRIO

# error_db_prop_invalidleadingColumns
source: For the distribution policy HASH, the number of leading hash columns is optional but should be from 1 to 16 columns
sr: Para a política de distribuição de HASH, o número de colunas hash principais é opcional, mas deve ser de 1 a 16 colunas

# general_containmentType_None
source: None
sr: Nenhum

# general_containmentType_Partial
source: Partial
sr: Parcial

# filegroups_filestreamFiles
source: FILESTREAM Files
sr: Arquivos FILESTREAM

# prototype_file_noApplicableFileGroup
source: No Applicable Filegroup
sr: Nenhum grupo de arquivos aplicável

# DatabaseNotAccessible
source: The database {0} is not accessible.
sr: O banco de dados {0} não está acessível.

# QueryServiceResultSetHasNoResults
source: Query has no results to return
sr: A consulta não tem resultado para retornar

# QueryServiceResultSetTooLarge
source: Result set has too many rows to be safely loaded
sr: Conjunto de resultados tem muitas linhas para ser carregado com segurança

# prototype_db_prop_parameterization
source: Parameterization
sr: Parametrização

# ConflictWithNoRecovery
source: Specifying this option when restoring a backup with the NORECOVERY option is not permitted.
sr: Não é permitido especificar essa opção ao restaurar um backup com a opção NORECOVERY.

# InvalidPathForDatabaseFile
source: Invalid path for database file: '{0}'
sr: Caminho inválido para o arquivo de banco de dados: '{0}'

# RestorePlanFailed
source: Failed to create restore plan
sr: Falha ao criar o plano de restauração

# RestoreNotSupported
source: Restore database is not supported
sr: Restauração de banco de dados não é suportado

# RestoreTaskName
source: Restore Database
sr: Restaurar o banco de dados

# RestoreCopyOnly
source: (Copy Only)
sr: (Apenas cópia)

# RestoreBackupSetComponent
source: Component
sr: Componente

# RestoreBackupSetType
source: Type
sr: Tipo

# RestoreBackupSetServer
source: Server
sr: Servidor

# RestoreBackupSetDatabase
source: Database
sr: Banco de dados

# RestoreBackupSetPosition
source: Position
sr: Posição

# RestoreBackupSetFirstLsn
source: First LSN
sr: Primeiro LSN

# RestoreBackupSetLastLsn
source: Last LSN
sr: Último LSN

# RestoreBackupSetFullLsn
source: Full LSN
sr: LSN completo

# RestoreBackupSetStartDate
source: Start Date
sr: Data de Início

# RestoreBackupSetFinishDate
source: Finish Date
sr: Data de Término

# RestoreBackupSetSize
source: Size
sr: Tamanho

# RestoreBackupSetUserName
source: User Name
sr: Nome do usuário

# RestoreBackupSetExpiration
source: Expiration
sr: Expiração

# RestoreBackupSetName
source: Name
sr: Nome

# TheLastBackupTaken
source: The last backup taken ({0})
sr: O último backup feito ({0})

# BackupTaskName
source: Backup Database
sr: Backup do Banco de Dados

# TaskInProgress
source: In progress
sr: Em andamento

# TaskCompleted
source: Completed
sr: Concluído

# ScriptTaskName
source: scripting
sr: Gerando script

# ProfilerConnectionNotFound
source: Connection not found
sr: Conexão não encontrada

# BackupPathIsFolderError
source: Please provide a file path instead of directory path
sr: O nome do arquivo especificado também é um nome de diretório: {0}

# InvalidBackupPathError
source: The provided path is invalid
sr: Não foi possível verificar a existência do local do arquivo de backup: {0}

# InvalidPathError
source: Cannot access the specified path on the server: {0}
sr: Não foi possível acessar o diretório especificado no servidor: {0}

# NoBackupsetsToRestore
source: No backupset selected to be restored
sr: Nenhum conjunto de backup selecionado para ser restaurado

# NeverBackedUp
source: Never
sr: Nunca

# Error_InvalidDirectoryName
source: Path {0} is not a valid directory
sr: Caminho {0} não é um diretório válido

# Error_ExistingDirectoryName
source: For directory {0} a file with name {1} already exists
sr: Já existe um arquivo com nome {1} para o diretório {0}

# EditDataValueTooLarge
source: Value {0} is too large to fit in column of type {1}
sr: Valor {0} é muito grande para caber em uma coluna do tipo {1}
