Repository: Microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ResourceProvider.DefaultImpl/Localization/transXliff/*.*.xlf
Languages: sr

# FailedToGetAzureDatabasesErrorMessage
source: An error occurred while getting Azure databases
sr: 獲取Azure數據庫時發生錯誤

# FailedToGetAzureResourceGroupsErrorMessage
source: An error occurred while getting Azure resource groups: {0}
sr: 在獲取Azure資源組時發生了一個錯誤：{0}

# FailedToGetAzureSqlServersErrorMessage
source: An error occurred while getting Azure Sql Servers
sr: 在獲取Azure Sql Servers時發生錯誤

# FirewallRuleCreationFailed
source: An error occurred while creating a new firewall rule.
sr: 在創建一個新的防火牆規則時發生了錯誤。

# UnsupportedAuthType
source: Unsupported account type '{0}' for this provider
sr: 此供應商不支持的賬戶類型'{0}'。

# FailedToGetAzureSqlServersWithError
source: An error occurred while getting Azure Sql Servers: '{0}'
sr: 在獲取Azure Sql Servers時發生了一個錯誤：'{0}'

# FirewallRuleCreationFailedWithError
source: An error occurred while creating a new firewall rule: '{0}'
sr: 在創建新的防火牆規則時發生了一個錯誤：'{0}'

# FailedToGetAzureSubscriptionsErrorMessage
source: An error occurred while getting Azure subscriptions: {0}
sr: 在獲取Azure訂閱時，發生了一個錯誤: {0}

# UserNeedsAuthenticationError
source: The current user must be reauthenticated before executing this operation
sr: 當前用戶必須在執行此操作前重新認證。

# UserNotFoundError
source: No user was found, cannot execute the operation
sr: 沒有找到用戶，不能執行操作
