Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ResourceProvider.DefaultImpl/Localization/transXliff/*.*.xlf
Languages: sr

# FailedToGetAzureDatabasesErrorMessage
source: An error occurred while getting Azure databases
sr: Azure 데이터베이스를 가져오는 동안 오류가 발생했습니다.

# FailedToGetAzureResourceGroupsErrorMessage
source: An error occurred while getting Azure resource groups: {0}
sr: Azure 리소스 그룹을 가져오는 중 오류 발생: {0}

# FailedToGetAzureSqlServersErrorMessage
source: An error occurred while getting Azure Sql Servers
sr: Azure Sql Servers를 가져오는 동안 오류가 발생했습니다.

# FirewallRuleCreationFailed
source: An error occurred while creating a new firewall rule.
sr: 새 방화벽 규칙을 만드는 동안 오류가 발생했습니다.

# UnsupportedAuthType
source: Unsupported account type '{0}' for this provider
sr: 이 공급자에 대해 지원되지 않는 계정 유형 '{0}'

# FailedToGetAzureSqlServersWithError
source: An error occurred while getting Azure Sql Servers: '{0}'
sr: Azure SQL Servers를 가져오는 중 오류 발생: ‘{0}’

# FirewallRuleCreationFailedWithError
source: An error occurred while creating a new firewall rule: '{0}'
sr: 새 방화벽 규칙을 만드는 중 오류 발생: ‘{0}’

# FailedToGetAzureSubscriptionsErrorMessage
source: An error occurred while getting Azure subscriptions: {0}
sr: Azure 구독을 가져오는 중 오류 발생: {0}

# UserNeedsAuthenticationError
source: The current user must be reauthenticated before executing this operation
sr: 이 작업을 실행하기 전에 현재 사용자를 다시 인증해야 합니다.

# UserNotFoundError
source: No user was found, cannot execute the operation
sr: 사용자를 찾을 수 없습니다. 작업을 실행할 수 없습니다.
