Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ResourceProvider.Core/Localization/transXliff/*.*.xlf
Languages: sr

# AzureServerNotFound
source: The server you specified {0} does not exist in any subscription in {1}. Either you have signed in with an incorrect account or your server was removed from subscription(s) in this account. Please check your account and try again.
sr: 您指定的伺服器 {0} 不存在於 {1} 的任何訂用帳戶中。可能是您使用不正確的帳戶登入，或您的伺服器已從此帳戶中的訂用帳戶移除。請檢查您的帳戶，然後再試一次。

# AzureSubscriptionFailedErrorMessage
source: An error occurred while getting Azure subscriptions: {0}
sr: 取得 Azure 訂用帳戶時發生錯誤: {0}

# DatabaseDiscoveryFailedErrorMessage
source: An error occurred while getting databases from servers of type {0} from {1}
sr: 從 {1} 的類型 {0} 伺服器取得資料庫時發生錯誤

# FirewallRuleAccessForbidden
source: {0} does not have permission to change the server firewall rule. Try again with a different account that is an Owner or Contributor of the Azure subscription or the server.
sr: {0} 沒有權限可變更伺服器防火牆規則。請使用其他是 Azure 訂用帳戶或伺服器的「擁有者」或「參與者」之帳戶，再試一次。

source: Invalid IP address
sr: IP 位址無效

# InvalidServerTypeErrorMessage
source: Server Type is invalid.
sr: 伺服器類型無效。

# LoadingExportableFailedGeneralErrorMessage
source: A required dll cannot be loaded. Please repair your application.
sr: 無法載入必要的 dll。請修復您的應用程式。

# FirewallRuleCreationFailed
source: An error occurred while creating a new firewall rule.
sr: 建立新的防火牆規則時發生錯誤。

# FirewallRuleUnsupportedConnectionType
source: Cannot open a firewall rule for the specified connection type
sr: 無法為指定的連線類型開啟防火牆規則

# FirewallRuleCreationFailedWithError
source: An error occurred while creating a new firewall rule: '{0}'
sr: 建立新防火牆規則時發生錯誤: '{0}'

# NoSubscriptionsFound
source: No subscriptions were found for the currently logged in user account.
sr: 在使用者帳戶中找不到目前登入的訂用帳戶。
