Repository: Microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ResourceProvider.Core/Localization/transXliff/*.*.xlf
Languages: sr

# AzureServerNotFound
source: The server you specified {0} does not exist in any subscription in {1}. Either you have signed in with an incorrect account or your server was removed from subscription(s) in this account. Please check your account and try again.
sr: El servidor que especificó {0} no existe en ninguna suscripción de {1}. Ha iniciado sesión con una cuenta incorrecta o el servidor se ha eliminado de las suscripciones de esta cuenta. Comprueba tu cuenta e inténtalo de nuevo.

# AzureSubscriptionFailedErrorMessage
source: An error occurred while getting Azure subscriptions: {0}
sr: Se ha producido un error al obtener suscripciones de Azure: {0}

# DatabaseDiscoveryFailedErrorMessage
source: An error occurred while getting databases from servers of type {0} from {1}
sr: Se ha producido un error al obtener bases de datos de servidores de tipo {0} de {1}

# FirewallRuleAccessForbidden
source: {0} does not have permission to change the server firewall rule. Try again with a different account that is an Owner or Contributor of the Azure subscription or the server.
sr: {0} no tiene permiso para cambiar la regla de firewall del servidor. Inténtelo de nuevo con una cuenta diferente que sea propietario o colaborador de la suscripción de Azure o del servidor.

source: Invalid IP address
sr: Dirección IP no válida

# InvalidServerTypeErrorMessage
source: Server Type is invalid.
sr: El tipo de servidor no es válido.

# LoadingExportableFailedGeneralErrorMessage
source: A required dll cannot be loaded. Please repair your application.
sr: No se puede cargar un archivo DLL necesario. Por favor, repare su aplicación.

# FirewallRuleCreationFailed
source: An error occurred while creating a new firewall rule.
sr: Se ha producido un error al crear una nueva regla de firewall.

# FirewallRuleUnsupportedConnectionType
source: Cannot open a firewall rule for the specified connection type
sr: No se puede abrir una regla de firewall para el tipo de conexión especificado

# FirewallRuleCreationFailedWithError
source: An error occurred while creating a new firewall rule: '{0}'
sr: Se ha producido un error al crear una nueva regla de firewall: '{0}'

# NoSubscriptionsFound
source: No subscriptions were found for the currently logged in user account.
sr: No se encontró ninguna suscripción para la cuenta de usuario que ha iniciado sesión actualmente.
