Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ManagedBatchParser/Localization/transXliff/*.*.xlf
Languages: sr

# EE_BatchSqlMessageNoProcedureInfo
source: Msg {0}, Level {1}, State {2}, Line {3}
sr: Сообщение {0}, уровень {1}, состояние {2}, строка {3}

# EE_BatchSqlMessageWithProcedureInfo
source: Msg {0}, Level {1}, State {2}, Procedure {3}, Line {4}
sr: Сообщение {0}, уровень {1}, состояние {2}, процедура {3}, строка {4}

# EE_BatchSqlMessageNoLineInfo
source: Msg {0}, Level {1}, State {2}
sr: Сообщение {0}, уровень {1}, состояние {2}

# EE_BatchError_Exception
source: An error occurred while the batch was being processed. The error message is: {0}
sr: При обработке пакета произошла ошибка. Сообщение об ошибке: {0}

# EE_BatchExecutionInfo_RowsAffected
source: ({0} row(s) affected)
sr: ({0} затронутых строк)

# EE_ExecutionNotYetCompleteError
source: The previous execution is not yet complete.
sr: Предыдущее выполнение еще не завершено.

# EE_ScriptError_Error
source: A scripting error occurred.
sr: Произошла ошибка скрипта.

# EE_ScriptError_ParsingSyntax
source: Incorrect syntax was encountered while {0} was being parsed.
sr: В ходе синтаксического анализа {0} обнаружен недопустимый синтаксис.

# EE_ScriptError_FatalError
source: A fatal error occurred.
sr: Произошла неустранимая ошибка.

# EE_ExecutionInfo_FinalizingLoop
source: Batch execution completed {0} times...
sr: Выполнение пакетного задания завершено {0} раз…

# EE_ExecutionInfo_QueryCancelledbyUser
source: You cancelled the query.
sr: Запрос отменен.

# EE_BatchExecutionError_Halting
source: An error occurred while the batch was being executed.
sr: При выполнении пакета произошла ошибка.

# EE_BatchExecutionError_Ignoring
source: An error occurred while the batch was being executed, but the error has been ignored.
sr: Произошла ошибка во время выполнения пакета, которая была проигнорирована.

# EE_ExecutionInfo_InitializingLoop
source: Beginning execution loop
sr: Начало цикла выполнения

# EE_ExecutionError_CommandNotSupported
source: Command {0} is not supported.
sr: Команда {0} не поддерживается.

# EE_ExecutionError_VariableNotFound
source: The variable {0} could not be found.
sr: Не удалось найти переменную {0}.

# BatchParserWrapperExecutionEngineError
source: SQL Execution error: {0}
sr: Ошибка выполнения SQL: {0}

# BatchParserWrapperExecutionError
source: Batch parser wrapper execution: {0} found... at line {1}: {2} Description: {3}
sr: Выполнение программы-оболочки пакетного синтаксического анализатора: {0} найдено... в строке {1}: {2} Описание: {3}

# BatchParserWrapperExecutionEngineBatchMessage
source: Batch parser wrapper execution engine batch message received: Message: {0} Detailed message: {1}
sr: Получено сообщение при выполнении программы-оболочки для пакетного синтаксического анализатора: Сообщение: {0} Подробное сообщение: {1}

# BatchParserWrapperExecutionEngineBatchResultSetProcessing
source: Batch parser wrapper execution engine batch ResultSet processing: DataReader.FieldCount: {0} DataReader.RecordsAffected: {1}
sr: Программа-оболочка для пакетного синтаксического анализатора - подсистема выполнения - пакетная обработка ResultSet: DataReader.FieldCount: {0} DataReader.RecordsAffected: {1}

source: Batch parser wrapper execution engine batch ResultSet finished.
sr: Завершен пакет ResultSet при выполнении программы-оболочки для пакетного синтаксического анализатора.

# BatchParserWrapperExecutionEngineBatchCancelling
source: Canceling batch parser wrapper batch execution.
sr: Происходит отмена выполнения программы-оболочки для пакетного синтаксического анализатора.

# EE_ScriptError_Warning
source: Scripting warning.
sr: Предупреждение выполнения скрипта.

# TroubleshootingAssistanceMessage
source: For more information about this error, see the troubleshooting topics in the product documentation.
sr: Дополнительные сведения об этой ошибке см. в разделах документации продукта, посвященных устранению неполадок.

# BatchParser_CircularReference
source: File '{0}' recursively included.
sr: Файл "{0}" включен рекурсивно.

# BatchParser_CommentNotTerminated
source: Missing end comment mark '*/'.
sr: Отсутствует знак окончания комментария "*/".

# BatchParser_StringNotTerminated
source: Unclosed quotation mark after the character string.
sr: Незакрытые кавычки в конце символьной строки.

# BatchParser_IncorrectSyntax
source: Incorrect syntax was encountered while parsing '{0}'.
sr: В ходе анализа "{0}" обнаружен неверный синтаксис.

# BatchParser_VariableNotDefined
source: Variable {0} is not defined.
sr: Переменная {0} не определена.

# SqlCmd_PathInvalid
source: Path contains invalid characters.
sr: Путь содержит недопустимые символы.

# SqlCmd_PathLong
source: Path too long.
sr: Слишком длинный путь.

# SqlCmd_FailedInclude
source: Could not find included file {0}.
sr: Не удалось найти включенные файлы {0}.

# NullEmptyOrWhitespaceString
source: Parameter contains a null, empty, or whitespace string.
sr: Параметр содержит строку, имеющую значение NULL, пустую строку или строку с пробелом.
