Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# AddNewEdgeConstraintLabel
source: New Edge Constraint
sr: 새 Edge 제약 조건

# AddNewClauseLabel
source: New Clause
sr: 새 절

# WarningOverlayTooltip
source: Warnings
sr: 경고

# ParallelismOverlayTooltip
source: Parallel Execution
sr: 병렬 실행

# TableColumnComputedGroupTitle
source: Computed Column Specifications
sr: 계산 열 사양

# TableColumnIsComputedTitle
source: Is Computed
sr: 계산 여부

# TableColumnIsComputedDescription
source: Specifies whether the column is a computed column
sr: 열이 계산 열인지 여부를 지정합니다.

# TableColumnIsComputedPersistedTitle
source: Is Persisted
sr: 지속형 여부

# TableColumnIsComputedPersistedDescription
source: Whether the computed column is saved with the data source
sr: 계산 열이 데이터 원본과 함께 저장되는지 여부

# TableColumnIsComputedPersistedNullableTitle
source: Is Persisted Nullable
sr: 지속형 Null 허용 여부

# TableColumnIsComputedPersistedNullableDescription
source: Whether the computed column can have a NULL value (NOT NULL can only be specified if the column is persisted)
sr: 계산 열에 NULL 값을 사용할 수 있는지 여부를 지정합니다(지속형 열인 경우에만 NOT NULL을 지정할 수 있습니다).

# TableColumnComputedFormulaDescription
source: Formula that the column uses if it is a computed column
sr: 열이 계산 열인 경우 열에서 사용하는 수식입니다.

# TableColumnComputedFormulaTitle
source: Formula
sr: 수식

# IndexMustHaveColumnsRuleDescription
source: Index '{0}' does not have any columns associated with it.
sr: 인덱스 '{0}'에는 연결된 열이 없습니다.

# ForeignKeyMustHaveColumnsRuleDescription
source: Foreign key '{0}' does not have any columns specified.
sr: 외래 키 '{0}'에 지정된 열이 없습니다.

# ColumnCanOnlyAppearOnceInIndexRuleDescription
source: Column with name '{0}' has already been added to the index '{1}'. Row number: {2}.
sr: 이름이 '{0}'인 열이 이미 인덱스 '{1}'에 추가되었습니다. 행 번호: {2}.

# ColumnCanOnlyAppearOnceInForeignKeyRuleDescription
source: Column with name '{0}' has already been added to the foreign key '{1}'. Row number: {2}.
sr: 이름이 '{0}'인 열이 이미 외래 키 '{1}'에 추가되었습니다. 행 번호: {2}.

# ColumnCanOnlyAppearOnceInForeignKeyRuleForeignColumnDescription
source: Foreign column with name '{0}' has already been added to the foreign key '{1}'. Row number: {2}.
sr: 이름이 '{0}'인 외부 열이 이미 외부 키 '{1}'에 추가되었습니다. 행 번호: {2}.

# NoDuplicateConstraintNameRuleDescription
source: The name '{0}' is already used by another constraint. Row number: {1}.
sr: 다른 제약 조건에서 이미 이름 '{0}'을(를) 사용하고 있습니다. 행 번호: {1}.

# NoDuplicateColumnNameRuleDescription
source: The name '{0}' is already used by another column. Row number: {1}.
sr: 다른 열에서 이미 이름 '{0}'을(를) 사용하고 있습니다. 행 번호: {1}.

# NoDuplicateIndexNameRuleDescription
source: The name '{0}' is already used by another index. Row number: {1}.
sr: 다른 인덱스에서 이미 이름 '{0}'을(를) 사용하고 있습니다. 행 번호: {1}.

# EdgeConstraintMustHaveClausesRuleDescription
source: Edge constraint '{0}' does not have any clauses specified.
sr: 에지 제약 조건 '{0}'에 지정된 절이 없습니다.

# EdgeConstraintNoRepeatingClausesRuleDescription
source: The pair '{0}' is already defined by another clause in the edge constraint. Row number: {1}.
sr: '{0}' 쌍은 edge 제약 조건의 다른 절에 의해 이미 정의되어 있습니다. 행 번호: {1}.

# MemoryOptimizedTableMustHaveNonClusteredPrimaryKeyRuleDescription
source: Memory-optimized table must have non-clustered primary key.
sr: 메모리 최적화 테이블에는 클러스터되지 않은 기본 키가 있어야 합니다.

# TemporalTableMustHavePrimaryKeyRuleDescription
source: System versioned table must have primary key.
sr: 시스템 버전이 지정된 테이블에는 기본 키가 있어야 합니다.

# TemporalTableMustHavePeriodColumnsRuleDescription
source: System versioned table must have the period columns defined.
sr: 시스템 버전 테이블에는 기간 열이 정의되어 있어야 합니다.

# PeriodColumnsRuleMoreThanOneIssueDescription
source: Period columns (Generated Always As Row Start/End) can only be defined once.
sr: 기간 열(항상 행 시작/끝으로 생성됨)은 한 번만 정의할 수 있습니다.

# PeriodColumnsRuleNotMatchIssueDescription
source: Period columns (Generated Always As Row Start/End) must be defined as pair. If one is defined, the other must also be defined.
sr: 기간 열(항상 행 시작/끝으로 생성됨)은 쌍으로 정의되어야 합니다. 하나가 정의되면 다른 것도 정의해야 합니다.

# ColumnsInPrimaryKeyCannotBeNullableRuleDescription
source: Columns in primary key cannot be nullable.
sr: 기본 키의 열은 Null을 허용할 수 없습니다.

# OnlyDurableMemoryOptimizedTableCanBeSystemVersionedRuleDescription
source: Only durable (DURABILITY = SCHEMA_AND_DATA) memory-optimized tables can be system-versioned.
sr: 내구성(DURABILITY = SCHEMA_AND_DATA) 메모리 최적화 테이블만 시스템 버전 관리가 가능합니다.

# TableMustHaveAtLeastOneColumnRuleDescription
source: A table must have at least one non-computed column defined.
sr: 테이블에는 계산되지 않은 열이 하나 이상 정의되어 있어야 합니다.

# MemoryOptimizedTableIdentityColumnRuleDescription
source: The use of seed and increment values other than 1 is not supported with memory optimized tables.
sr: 1 이외의 시드 및 증분 값 사용은 메모리 최적화 테이블에서 지원되지 않습니다.

# TableShouldAvoidHavingMultipleEdgeConstraintsRuleDescription
source: The table has more than one edge constraint on it. This is only useful as a temporary state when modifying existing edge constraints, and should not be used in other cases.
sr: 테이블에 둘 이상의 에지 제약 조건이 있습니다. 이는 기존 에지 제약 조건을 수정할 때 임시 상태로만 유용하며 다른 경우에는 사용하지 않아야 합니다.

# ColumnCannotBeListedMoreThanOnceInPrimaryKeyRuleDescription
source: Cannot use duplicate column names in primary key, column name: {0}
sr: 기본 키에 중복된 열 이름을 사용할 수 없습니다. 열 이름: {0}

# MemoryOptimizedCannotBeEnabledWhenNotSupportedRuleDescription
source: Memory-optimized table is not supported for this database.
sr: 이 데이터베이스에는 메모리 최적화 테이블이 지원되지 않습니다.

# MutipleCreateTableStatementsInScriptRuleDescription
source: There are multiple table definitions in the script, only the first table can be edited in the designer.
sr: 스크립트에는 여러 테이블 정의가 있으며 디자이너에서 첫 번째 테이블만 편집할 수 있습니다.

source: Operation
sr: 작업

source: Object
sr: 개체

source: Estimated Cost %
sr: 예상 비용(%)

# EstimatedSubtree
source: Estimated Subtree Cost %
sr: 예상 하위 트리 비용(%)

source: Actual Rows
sr: 실제 행 수

source: Estimated Rows
sr: 예상 행 수

source: Actual Executions
sr: 실제 실행 횟수

source: Estimated Executions
sr: 예상 실행 횟수

# EstimatedCpu
source: Estimated CPU Cost
sr: 예상 CPU 비용

# EstimatedIO
source: Estimated IO Cost
sr: 예상 IO 비용

source: Actual Data Size
sr: 실제 데이터 크기

source: Estimated Average Row Size
sr: 예상 평균 행 크기

# AzureSqlDwEdition
source: Azure SQL Data Warehouse
sr: Azure SQL 数据仓库

source: Distinct
sr: 非重复

source: Keyset
sr: 密钥集

# EditDataComputedColumnPlaceholder
source: <TBD>
sr: <Por determinar>

source: Bitmap
sr: Mapa de bits

# ActualOfEstimated
source: {0} of {1} ({2}%)
sr: {0} de {1} ({2} %)

# AzureSqlDbEdition
source: Azure SQL DB
sr: Azure SQL-Datenbank

source: If
sr: Wenn

# LogicalOpLeftAntiSemiJoin
source: Left Anti Semi Join
sr: 左方反半聯結

# LogicalOpRightAntiSemiJoin
source: Right Anti Semi Join
sr: 右方反半聯結

# ForeignKeyIsNotForReplicationDescription
source: Enables or disables an IDENTITY constraint for data inserted by a replication process.
sr: 啟用或停用複寫處理所插入之資料的 IDENTITY 條件約束。

# UnKnownSqlForeignKeyAction
source: '{0}' is not a supported SqlForeignKeyAction.
sr: '{0}' 不是受支援的 SqlForeignKeyAction。

source: IsInterleavedExecuted
sr: Выполняется с чередованием

source: UDF
sr: Определяемая пользователем функция

# SizeInKiloBytesFormat
source: {0} KB
sr: {0} КБ

# SizeInMegaBytesFormat
source: {0} MB
sr: {0} МБ

# SizeInGigaBytesFormat
source: {0} GB
sr: {0} ГБ

# SizeInTeraBytesFormat
source: {0} TB
sr: {0} ТБ

# SchemaHierarchy_NullColumn_Label
source: null
sr: nulo

# AzureSqlStretchEdition
source: Azure SQL Stretch Database
sr: Stretch Database do SQL do Azure

# QueryServiceExecutionPlanNotFound
source: Could not retrieve an execution plan from the result set
sr: 結果セットから実行プランを取得できませんでした

# UnknownSizeUnit
source: Unknown size unit {0}
sr: 不明なサイズの単位 {0}

# Error_InvalidDirectoryName
source: Path {0} is not a valid directory
sr: パス {0} は有効なディレクトリではありません

# ConnectionServiceConnStringInvalidEncryptOption
source: Invalid value '{0}' for Encrypt. Valid values are 'Optional', 'Mandatory', 'Strict', 'True', 'False', 'Yes' and 'No'.
sr: Encrypt の値 '{0}' が無効です。有効な値は、'Optional'、'Mandatory'、'Strict'、'True'、'False'、'Yes'、および 'No' です。

# ConnectionServiceConnStringInvalidEnclaveAttestationProtocol
source: Invalid value '{0}' for Attestation protocol. Valid values are 'AAS', 'HGS' and 'None'.
sr: 構成証明プロトコルの値 '{0}' が無効です。有効な値は、'AAS'、'HGS'、および 'None' です。

# ConnectionServiceConnStringInvalidAlwaysEncryptedOptionCombination
source: The Attestation protocol and Attestation URL requires Always Encrypted with Secure enclaves to be set to Enabled.
sr: 構成証明プロトコルと構成証明 URL では、セキュリティで保護されたエンクレーブを持つAlways Encryptedを有効に設定する必要があります。

# ErrorMessage
source: Unable to convert {0} to a Microsoft.Data.SqlClient.SqlParameter object. The specified literal cannot be converted to {1}(Microsoft.Data.SqlDbType). Literal value: {2}
sr: {0} を Microsoft.Data.SqlClient.SqlParameter オブジェクトに変換できません。指定されたリテラルを {1}(Microsoft.Data.SqlDbType) に変換できません。リテラル値: {2}

# BinaryLiteralPrefixMissingError
source: Unable to convert {0} to a Microsoft.Data.SqlClient.SqlParameter object. The specified literal cannot be converted to {1}(Microsoft.Data.SqlDbType), as prefix 0x is expected for a binary literals. Literal value: {2}
sr: {0} を Microsoft.Data.SqlClient.SqlParameter オブジェクトに変換できません。プレフィックス 0x をバイナリ リテラルにする必要があるため、指定されたリテラルを {1}(Microsoft.Data.SqlDbType) に変換できません。 リテラル値: {2}

# TFPDescription
source: Applies a trained machine learning model to input data
sr: トレーニング済みの機械学習モデルを入力データに適用します

# EstimatedSubtree
source: Estimated Subtree Cost
sr: サブツリーの推定コスト

source: Average Row Size
sr: 平均行サイズ

# SqlProjectModelNotFound
source: Could not find SQL model from project: {0}.
sr: プロジェクトから SQL モデルが見つかりませんでした: {0}。

# UnsupportedModelType
source: Unsupported model type: {0}.
sr: サポートされていないモデルの種類: {0}。

# GetUserDefinedObjectsFromModelFailed
source: Failed to get user defined objects from model.
sr: モデルからユーザー定義オブジェクトを取得できませんでした。

# ErrorConnectionNotFound
source: The connection could not be found
sr: 接続が見つかりませんでした

# ActualCpu
source: Actual CPU Cost
sr: 実際の CPU コスト

# PasswordChangeEmptyPassword
source: New password cannot be empty
sr: 新しいパスワードを空にすることはできません

# PasswordChangeEmptyPasswordRetry
source: Press OK to input a new password that is not empty.
sr: [OK] を押して、空ではない新しいパスワードを入力します。

# PasswordChangeDNMReqsRetry
source: Press OK to input a new password that meets operating system policy requirements.
sr: オペレーティング システム ポリシーの要件を満たす新しいパスワードを入力するには、[OK] をクリックします。

# PasswordChangePWCannotBeUsedRetry
source: Press OK to input a different password.
sr: [OK] を押して別のパスワードを入力します。

# ConnectionServiceConnStringMissingAttestationUrlWithAttestationProtocol
source: Attestation URL cannot be empty with the selected value of Attestation protocol.
sr: 構成証明の URL を、構成証明プロトコルの選択された値と共に空にすることはできません。

# ConnectionServiceConnStringInvalidSecureEnclaves
source: Invalid value '{0}' for Secure enclaves. Valid values are 'Enabled' and 'Disabled'.
sr: セキュリティで保護されたエンクレーブの値 '{0}' が無効です。有効な値は 'Enabled' と 'Disabled' です。

# ConnectionServiceConnStringInvalidAttestationProtocolNoneWithUrl
source: The Attestation URL must not be specified with Attestation protocol 'None'. Either set appropriate Attestation protocol or remove Attestation URL from connection properties.
sr: 構成証明 URL を構成証明プロトコル 'None' で指定することはできません。適切な構成証明プロトコルを設定するか、接続プロパティから構成証明 URL を削除します。

# DefaultLanguagePlaceholder
source: <default>
sr: <既定>

# ResetPasswordWhileUnlocking
source: Reset password for the login while unlocking.
sr: ロックの解除中にログインのパスワードをリセットします。

# ObjectNotRenamable
source: The object could not be renamed. URN: '{0}'.
sr: オブジェクトの名前を変更できませんでした。URN: '{0}'。

# ConnectionServiceConnStringMissingAttestationProtocolWithSecureEnclaves
source: Attestation protocol cannot be empty with Secure enclaves enabled.
sr: セキュア エンクレーブを有効にした状態で構成証明プロトコルを空にすることはできません。

# Permission_Alter
source: Alter
sr: 変更

# Permission_Connect
source: Connect
sr: 接続

# Permission_Control
source: Control
sr: 制御

# Permission_Delete
source: Delete
sr: 削除

# Permission_Execute
source: Execute
sr: 実行

# Permission_Impersonate
source: Impersonate
sr: 偽装する

# Permission_Insert
source: Insert
sr: 挿入

# Permission_Receive
source: Receive
sr: 受信

# Permission_References
source: References
sr: リファレンス

# Permission_Select
source: Select
sr: 選択

# Permission_Send
source: Send
sr: 送信

# Permission_TakeOwnership
source: Take ownership
sr: 所有権の取得

# Permission_Update
source: Update
sr: 更新

# Permission_ViewDefinition
source: View definition
sr: 定義の表示

# Permission_ViewChangeTracking
source: View change tracking
sr: 変更の追跡の表示

# Permission_AlterAnyApplicationRole
source: Alter any application role
sr: アプリケーション ロールの変更

# Permission_AlterAnyAssembly
source: Alter any assembly
sr: 任意のアセンブリの変更

# Permission_AlterAnyAsymmetricKey
source: Alter any asymmetric key
sr: 非対称キーの変更

# Permission_AlterAnyCertificate
source: Alter any certificate
sr: 証明書の変更

# Permission_AlterAnyDatabaseAudit
source: Alter any database audit
sr: データベース監査の変更

# Permission_AlterAnyContract
source: Alter any contract
sr: 任意のコントラクトの変更

# Permission_AlterAnyDatabaseDdlTrigger
source: Alter any database DDL trigger
sr: データベース DDL トリガーの変更

# Permission_AlterAnyDatabaseEventNotification
source: Alter any database event notification
sr: データベース イベント通知の変更

# Permission_AlterAnyDataspace
source: Alter any dataspace
sr: 任意のデータ領域の変更

# Permission_AlterAnyExternalDataSource
source: Alter any external data source
sr: 外部データ ソースの変更

# Permission_AlterAnyExternalFileFormat
source: Alter any external file format
sr: 外部ファイル形式の変更

# Permission_AlterAnyFulltextCatalog
source: Alter any fulltext catalog
sr: フルテキスト カタログの変更

# Permission_AlterAnyMask
source: Alter any mask
sr: 任意のマスクの変更

# Permission_AlterAnyMessageType
source: Alter any message type
sr: メッセージ型の変更

# Permission_AlterAnyRemoteServiceBinding
source: Alter any remote service binding
sr: リモート サービス バインドの変更

# Permission_AlterAnyRole
source: Alter any role
sr: 任意のロールの変更

# Permission_AlterAnyRoute
source: Alter any route
sr: 任意のルートの変更

# Permission_AlterAnySchema
source: Alter any schema
sr: 任意のスキーマの変更

# Permission_AlterAnySecurityPolicy
source: Alter any security policy
sr: セキュリティ ポリシーの変更

# Permission_AlterAnySensitivityClassification
source: Alter any sensitivity classification
sr: 任意の秘密度の分類を変更

# Permission_AlterAnyService
source: Alter any service
sr: サービスの変更

# Permission_AlterAnyUser
source: Alter any user
sr: 任意のユーザーの変更

# Permission_AlterAnySymmetricKey
source: Alter any symmetric key
sr: 対称キーの変更

# Permission_Authenticate
source: Authenticate
sr: 認証

# Permission_BackupDatabase
source: Backup database
sr: データベースのバックアップ

# Permission_BackupLog
source: Backup log
sr: ログのバックアップ

# Permission_Checkpoint
source: Checkpoint
sr: チェックポイント

# Permission_ConnectReplication
source: Connect replication
sr: レプリケーションの接続

# Permission_CreateAggregate
source: Create aggregate
sr: 集計の作成

# Permission_CreateAssembly
source: Create assembly
sr: アセンブリの作成

# Permission_CreateAsymmetricKey
source: Create asymmetric key
sr: 非対称キーの作成

# Permission_CreateCertificate
source: Create certificate
sr: 証明書の作成

# Permission_CreateContract
source: Create contract
sr: コントラクトの作成

# Permission_CreateDatabase
source: Create database
sr: データベースの作成

# Permission_CreateDatabaseDdlEventNotification
source: Create database DDL event notification
sr: データベース DDL イベント通知の作成

# Permission_CreateDefault
source: Create default
sr: 既定値の作成

# Permission_CreateFulltextCatalog
source: Create fulltext catalog
sr: フルテキスト カタログの作成

# Permission_CreateFunction
source: Create function
sr: 関数の作成

# Permission_CreateMessageType
source: Create message type
sr: メッセージ型の作成

# Permission_CreateProcedure
source: Create procedure
sr: プロシージャの作成

# Permission_CreateQueue
source: Create queue
sr: キューの作成

# Permission_CreateRemoteServiceBinding
source: Create remote service binding
sr: リモート サービス バインドの作成

# Permission_CreateRole
source: Create role
sr: ロールの作成

# Permission_CreateRoute
source: Create route
sr: ルートの作成

# Permission_CreateRule
source: Create rule
sr: ルールの作成

# Permission_CreateSchema
source: Create schema
sr: スキーマの作成

# Permission_CreateService
source: Create service
sr: サービスの作成

# Permission_CreateSymmetricKey
source: Create symmetric key
sr: 対称キーの作成

# Permission_CreateSynonym
source: Create synonym
sr: 同意語の作成

# Permission_CreateSequence
source: Create sequence
sr: シーケンスの作成

# Permission_CreateTable
source: Create table
sr: テーブルの作成

# Permission_CreateType
source: Create type
sr: 型の作成

# Permission_CreateView
source: Create view
sr: ビューの作成

# Permission_CreateXmlSchemaCollection
source: Create XML schema collection
sr: XML スキーマ コレクションの作成

# Permission_Showplan
source: Show plan
sr: プラン表示

# Permission_SubscribeQueryNotifications
source: Subscribe query notifications
sr: クエリ通知のサブスクライブ

# Permission_Unmask
source: Unmask
sr: マスク解除

# Permission_ViewAnyColumnEncryptionKeyDefinition
source: View any column encryption key definition
sr: 列暗号化キー定義を表示する

# Permission_ViewAnyColumnMasterKeyDefinition
source: View any column master key definition
sr: 列マスター キー定義を表示する

# Permission_ViewAnySensitivityClassification
source: View any sensitivity classification
sr: 任意の秘密度の分類を表示する

# Permission_ViewDatabaseState
source: View database state
sr: データベースの状態の表示

# Permission_AdministerBulkOperations
source: Administer bulk operations
sr: 一括操作の管理

# Permission_AlterAnyServerAudit
source: Alter any server audit
sr: サーバー監査の変更

# Permission_AlterAnyConnection
source: Alter any connection
sr: 任意の接続の変更

# Permission_AlterAnyCredential
source: Alter any credential
sr: 任意の資格情報の変更

# Permission_AlterAnyDatabase
source: Alter any database
sr: 任意のデータベースの変更

# Permission_AlterAnyEndpoint
source: Alter any endpoint
sr: 任意のエンドポイントの変更

# Permission_AlterAnyEventNotification
source: Alter any event notification
sr: イベント通知の変更

# Permission_AlterAnyEventSession
source: Alter any event session
sr: イベント セッションの変更

# Permission_AlterAnyLinkedServer
source: Alter any linked server
sr: リンク サーバーの変更

# Permission_AlterAnyLogin
source: Alter any login
sr: 任意のログインの変更

# Permission_AlterAnyServerRole
source: Alter any server role
sr: サーバー ロールの変更

# Permission_AlterResources
source: Alter resources
sr: リソースの変更

# Permission_AlterServerState
source: Alter server state
sr: サーバー状態の変更

# Permission_AlterSettings
source: Alter settings
sr: 設定の変更

# Permission_AlterTrace
source: Alter trace
sr: トレースの変更

# Permission_AuthenticateServer
source: Authenticate server
sr: サーバーの認証

# Permission_ConnectSql
source: Connect SQL
sr: SQL の接続

# Permission_ControlServer
source: Control server
sr: サーバーの制御

# Permission_CreateAnyDatabase
source: Create any database
sr: 任意のデータベースの作成

# Permission_CreateDdlEventNotification
source: Create DDL event notification
sr: DDL イベント通知の作成

# Permission_CreateEndpoint
source: Create endpoint
sr: エンドポイントの作成

# Permission_CreateTraceEventNotification
source: Create trace event notification
sr: トレース イベント通知の作成

# Permission_CreateServerRole
source: Create server role
sr: サーバー ロールの作成

# Permission_ExternalAccessAssembly
source: External access assembly
sr: 外部アクセス アセンブリ

# Permission_Shutdown
source: Shutdown
sr: シャットダウン

# Permission_UnsafeAssembly
source: Unsafe assembly
sr: 安全ではないアセンブリ

# Permission_ViewAnyDatabase
source: View any database
sr: 任意のデータベースの表示

# Permission_ViewAnyDefinition
source: View any definition
sr: 任意の定義の表示

# Permission_ViewServerState
source: View server state
sr: サーバー状態の表示

# Permission_AlterAnyAvailabilityGroup
source: Alter any availability group
sr: 可用性グループの変更

# Permission_CreateAvailabilityGroup
source: Create availability group
sr: 可用性グループの作成

# Permission_SelectAllUserSecurables
source: Select All User Securables
sr: すべてのユーザーのセキュリティ保護可能なリソースを選択

# Permission_ConnectAnyDatabase
source: Connect Any Database
sr: 任意のデータベースの接続

# Permission_ImpersonateAnyLogin
source: Impersonate Any Login
sr: 任意のログインの偽装

# ServiceProviderNotSet
source: SetServiceProvider() was not called to establish the required service provider
sr: 必要なサービス プロバイダーを確立するために SetServiceProvider() が呼び出されませんでした

# ServiceNotFound
source: Service {0} was not found in the service provider
sr: サービス {0} がサービス プロバイダーに見つかりませんでした

# objectType_functionTable_plural
source: Table-valued functions
sr: テーブル値関数

# objectType_externalDataSource_singular
source: External Data Source
sr: 外部データ ソース

# objectType_serverRole_singular
source: Server role
sr: サーバー ロール

# objectType_xmlSchemaCollection_singular
source: XML schema collection
sr: XML スキーマ コレクション

# objectType_storedProcedure_plural
source: Stored procedures
sr: ストアド プロシージャ

# objectType_endpoint_plural
source: Endpoints
sr: エンドポイント

# objectType_sequence_singular
source: Sequence
sr: シーケンス

# objectType_userDefinedDataType_singular
source: User-defined data type
sr: ユーザー定義データ型

# objectType_fullTextCatalog_plural
source: Full-text catalogs
sr: フルテキスト カタログ

# objectType_credential_singular
source: Credential
sr: 資格情報

# objectType_databaseRole_plural
source: Database roles
sr: データベース ロール

# objectType_endpoint_singular
source: Endpoint
sr: エンドポイント

# objectType_view_plural
source: Views
sr: ビュー

# objectType_assembly_singular
source: Assembly
sr: アセンブリ

# objectType_functionScalar_singular
source: Scalar function
sr: スカラー関数

# objectType_server_plural
source: Servers
sr: サーバー

# objectType_table_singular
source: Table
sr: テーブル

# objectType_serviceQueue_singular
source: Queue
sr: キュー

# objectType_login_plural
source: Logins
sr: ログイン

# objectType_storedProcedure_singular
source: Stored procedure
sr: ストアド プロシージャ

# objectType_default_plural
source: Defaults
sr: 既定値

# objectType_symmetricKey_singular
source: Symmetric key
sr: 対称キー

# objectType_userDefinedTableType_singular
source: User-defined table type
sr: ユーザー定義テーブル型

# objectType_functionInline_singular
source: Inline function
sr: インライン関数

# objectType_serverRole_plural
source: Server roles
sr: サーバー ロール

# objectType_agentjob_singular
source: Agent job
sr: エージェント ジョブ

# objectType_databaseRole_singular
source: Database role
sr: データベース ロール

# objectType_synonym_singular
source: Synonym
sr: 同意語

# objectType_AvailabilityGroup_singular
source: Availability Group
sr: 可用性グループ

# objectType_externalFileFormat_plural
source: External File Formats
sr: 外部ファイル形式

# objectType_database_singular
source: Database
sr: データベース

# objectType_symmetricKey_plural
source: Symmetric keys
sr: 対称キー

# objectType_securityPolicy_singular
source: Security Policy
sr: セキュリティ ポリシー

# objectType_externalFileFormat_singular
source: External File Format
sr: 外部ファイル形式

# objectType_applicationRole_singular
source: Application role
sr: アプリケーション ロール

# objectType_assembly_plural
source: Assemblies
sr: アセンブリ

# objectType_sequence_plural
source: Sequences
sr: シーケンス

# objectType_userDefinedDataType_plural
source: User-defined data types
sr: ユーザー定義データ型

# objectType_server_singular
source: Server
sr: サーバー

# objectType_aggregateFunction_singular
source: Aggregate function
sr: 集計関数

# objectType_fullTextCatalog_singular
source: Full-text catalog
sr: フルテキスト カタログ

# objectType_certificate_plural
source: Certificates
sr: 証明書

# objectType_AvailabilityGroup_plural
source: Availability Groups
sr: 可用性グループ

# objectType_database_plural
source: Databases
sr: データベース

# objectType_view_singular
source: View
sr: 表示

# objectType_schema_plural
source: Schemas
sr: スキーマ

# objectType_rule_plural
source: Rules
sr: ルール

# objectType_certificate_singular
source: Certificate
sr: 証明書

# objectType_user_singular
source: User
sr: ユーザー

# objectType_agentjob_plural
source: Agent jobs
sr: エージェント ジョブ

# objectType_synonym_plural
source: Synonyms
sr: シノニム

# objectType_aggregateFunction_plural
source: Aggregate functions
sr: 集計関数

# objectType_functionTable_singular
source: Table-valued function
sr: テーブル値関数

# objectType_rule_singular
source: Rule
sr: ルール

# objectType_serviceQueue_plural
source: Queues
sr: キュー

# objectType_asymmetricKey_plural
source: Asymmetric keys
sr: 非対称キー

# objectType_applicationRole_plural
source: Application roles
sr: アプリケーション ロール

# objectType_extendedStoredProcedure_singular
source: Extended stored procedure
sr: 拡張ストアド プロシージャ
