Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# ConnectionServiceConnectErrorNullParams
source: Connection parameters cannot be null
sr: 연결 매개 변수는 null일 수 없습니다.

# ConnectionServiceListDbErrorNullOwnerUri
source: OwnerUri cannot be null or empty
sr: 소유자 URI는 null이나 비워 둘 수 없습니다.

# ConnectionServiceListDbErrorNotConnected
source: SpecifiedUri '{0}' does not have existing connection
sr: 지정된 URI '{0}'에 기존 연결이 없습니다.

# ConnectionServiceConnStringInvalidAuthType
source: Invalid value '{0}' for AuthenticationType. Valid values are 'Integrated' and 'SqlLogin'.
sr: AuthenticationType의 값 '{0}'은(는) 유효하지 않습니다. 유효한 값은 'Integrated' 및 'SqlLogin'입니다.

# ConnectionServiceConnStringInvalidIntent
source: Invalid value '{0}' for ApplicationIntent. Valid values are 'ReadWrite' and 'ReadOnly'.
sr: ApplicationIntent의 값 '{0}'은(는) 유효하지 않습니다. 유효한 값은 'ReadWrite' 및 'ReadOnly'입니다.

# ConnectionServiceConnectionCanceled
source: Connection canceled
sr: 연결이 취소되었습니다.

# ConnectionParamsValidateNullOwnerUri
source: OwnerUri cannot be null or empty
sr: 소유자 URI는 null이나 비워 둘 수 없습니다.

# ConnectionParamsValidateNullConnection
source: Connection details object cannot be null
sr: 연결 세부 정보 개체는 null일 수 없습니다.

# ConnectionParamsValidateNullServerName
source: ServerName cannot be null or empty
sr: 서버 이름은 null이거나 비워 둘 수 없습니다.

# ConnectionParamsValidateNullSqlAuth
source: {0} cannot be null or empty when using SqlLogin authentication
sr: SqlLogin 인증 사용 시 {0}은(는) null이거나 비워 둘 수 없습니다.

# QueryServiceCancelAlreadyCompleted
source: The query has already completed, it cannot be cancelled
sr: 쿼리가 이미 완료되어 취소할 수 없습니다.

# QueryServiceCancelDisposeFailed
source: Query successfully cancelled, failed to dispose query. Owner URI not found.
sr: 쿼리 취소가 완료되었으나 쿼리를 삭제하는 데 실패했습니다. 소유자 URI를 찾을 수 없습니다.

# QueryServiceQueryCancelled
source: Query was canceled by user
sr: 사용자가 쿼리를 취소했습니다.

# QueryServiceSubsetBatchNotCompleted
source: The batch has not completed, yet
sr: 일괄 처리가 아직 완료되지 않았습니다.

# QueryServiceSubsetBatchOutOfRange
source: Batch index cannot be less than 0 or greater than the number of batches
sr: 일괄 처리 인덱스는 0 미만이거나 일괄 처리 수보다 클 수 없습니다.

# QueryServiceSubsetResultSetOutOfRange
source: Result set index cannot be less than 0 or greater than the number of result sets
sr: 결과 집합 처리 인덱스는 0 미만이거나 결과 집합 수보다 클 수 없습니다.

# QueryServiceDataReaderByteCountInvalid
source: Maximum number of bytes to return must be greater than zero
sr: 반환할 최대 바이트 수는 0보다 커야 합니다.

# QueryServiceDataReaderCharCountInvalid
source: Maximum number of chars to return must be greater than zero
sr: 반환할 최대 문자 수는 0보다 커야 합니다.

# QueryServiceDataReaderXmlCountInvalid
source: Maximum number of XML bytes to return must be greater than zero
sr: 반환할 최대 XML 바이트 수는 0보다 커야 합니다.

# QueryServiceFileWrapperWriteOnly
source: Access method cannot be write-only
sr: 액세스 방법은 쓰기 전용일 수 없습니다.

# QueryServiceFileWrapperNotInitialized
source: FileStreamWrapper must be initialized before performing operations
sr: FileStreamWrapper는 작업을 수행하기 전에 초기화해야 합니다.

# QueryServiceFileWrapperReadOnly
source: This FileStreamWrapper cannot be used for writing
sr: FileStreamWrapper는 쓰기용으로 사용할 수 없습니다.

# QueryServiceAffectedOneRow
source: (1 row affected)
sr: (1개 행이 영향을 받음)

# QueryServiceAffectedRows
source: ({0} rows affected)
sr: ({0}개 행이 영향을 받음)

# QueryServiceCompletedSuccessfully
source: Commands completed successfully.
sr: 명령이 완료되었습니다.

# QueryServiceErrorFormat
source: Msg {0}, Level {1}, State {2}, Line {3}{4}{5}
sr: 메시지 {0}, 수준 {1}, 상태 {2}, 줄 {3}{4}{5}

# QueryServiceQueryFailed
source: Query failed: {0}
sr: 쿼리 실패: {0}

# QueryServiceColumnNull
source: (No column name)
sr: (열 이름 없음)

# QueryServiceRequestsNoQuery
source: The requested query does not exist
sr: 요청한 쿼리가 존재하지 않습니다.

# QueryServiceQueryInvalidOwnerUri
source: Cannot connect to the database due to invalid OwnerUri
sr: 잘못된 OwnerUri로 인해 데이터베이스에 연결할 수 없음

# QueryServiceQueryInProgress
source: A query is already in progress for this editor session. Please cancel this query or wait for its completion.
sr: 쿼리가 현재 편집기 세션에서 이미 진행 중입니다. 이 쿼리를 취소하거나 완료될 때까지 대기하세요.

# QueryServiceMessageSenderNotSql
source: Sender for OnInfoMessage event must be a SqlConnection
sr: OnInfoMessage 이벤트 발신자는 SqlConnection이어야 합니다.

# QueryServiceSaveAsResultSetNotComplete
source: Result cannot be saved until query execution has completed
sr: 결과는 쿼리 실행이 완료될 때까지 저장할 수 없습니다.

# QueryServiceSaveAsMiscStartingError
source: Internal error occurred while starting save task
sr: 저장 작업을 시작하는 동안 내부 오류가 발생했습니다.

# QueryServiceSaveAsInProgress
source: A save request to the same path is in progress
sr: 동일한 경로로의 저장 요청이 진행 중입니다.

# QueryServiceSaveAsFail
source: Failed to save {0}: {1}
sr: {0} 저장 실패: {1}

# QueryServiceResultSetNotRead
source: Cannot read subset unless the results have been read from the server
sr: 서버에서 결과를 읽지 않으면 하위 세트를 읽을 수 없습니다.

# QueryServiceResultSetStartRowOutOfRange
source: Start row cannot be less than 0 or greater than the number of rows in the result set
sr: 시작 행은 0 미만이거나 결과 집합의 행 수보다 클 수 없습니다.

# QueryServiceResultSetRowCountOutOfRange
source: Row count must be a positive integer
sr: 행 수는 양의 정수여야 합니다.

# QueryServiceResultSetNoColumnSchema
source: Could not retrieve column schema for result set
sr: 결과 집합의 열 스키마를 검색할 수 없습니다.

# QueryServiceExecutionPlanNotFound
source: Could not retrieve an execution plan from the result set
sr: 결과 집합에서 실행 계획을 검색할 수 없습니다.

# PeekDefinitionAzureError
source: This feature is currently not supported on Azure SQL DB and Data Warehouse: {0}
sr: 현재 이 기능은 Azure SQL DB 및 Data Warehouse에서 지원되지 않습니다. {0}

# PeekDefinitionError
source: An unexpected error occurred during Peek Definition execution: {0}
sr: 정의 피킹을 실행하는 동안 예기치 않은 오류가 발생했습니다. {0}

# PeekDefinitionNoResultsError
source: No results were found.
sr: 결과가 없습니다.

# PeekDefinitionDatabaseError
source: No database object was retrieved.
sr: 검색된 데이터베이스 개체가 없습니다.

# PeekDefinitionNotConnectedError
source: Please connect to a server.
sr: 서버에 연결하세요.

# PeekDefinitionTimedoutError
source: Operation timed out.
sr: 작업 시간이 초과되었습니다.

# PeekDefinitionTypeNotSupportedError
source: This object type is currently not supported by this feature.
sr: 현재 이 개체 형식은 이 기능에서 지원되지 않습니다.

# WorkspaceServicePositionLineOutOfRange
source: Position is outside of file line range
sr: 위치가 파일 줄 범위를 벗어났습니다.

# WorkspaceServicePositionColumnOutOfRange
source: Position is outside of column range for line {0}
sr: 위치가 줄 {0}의 열 범위를 벗어났습니다.

# WorkspaceServiceBufferPositionOutOfOrder
source: Start position ({0}, {1}) must come before or be equal to the end position ({2}, {3})
sr: 시작 위치({0}, {1})는 끝 위치({2}, {3})와 같거나 더 앞에 있어야 합니다.

# TestLocalizationConstant
source: test
sr: 테스트

# ErrorEmptyStringReplacement
source: Replacement of an empty string by an empty string.
sr: 빈 문자열을 빈 문자열로 바꾸기

# EditDataSessionNotFound
source: Edit session does not exist.
sr: 편집 세션이 존재하지 않습니다.

# EditDataQueryNotCompleted
source: Query has not completed execution
sr: 쿼리 실행이 완료되지 않았습니다.

# EditDataQueryImproperResultSets
source: Query did not generate exactly one result set
sr: 쿼리가 정확히 하나의 결과 집합을 생성하지 않았습니다.

# EditDataFailedAddRow
source: Failed to add new row to update cache
sr: 업데이트 캐시에 새 행을 추가하지 못했습니다.

# EditDataRowOutOfRange
source: Given row ID is outside the range of rows in the edit cache
sr: 지정된 행 ID가 편집 캐시의 행 범위를 벗어났습니다.

# EditDataUpdatePending
source: An update is already pending for this row and must be reverted first
sr: 이 행에 대한 업데이트가 이미 보류 중이므로 먼저 되돌려야 합니다.

# EditDataUpdateNotPending
source: Given row ID does not have pending update
sr: 지정된 행 ID에 보류 중인 업데이트가 없습니다.

# EditDataObjectMetadataNotFound
source: Table or view metadata could not be found
sr: 테이블 또는 뷰 메타데이터를 찾을 수 없습니다.

# EditDataInvalidFormatBinary
source: Invalid format for binary column
sr: 이진 열의 형식이 잘못되었습니다.

# EditDataInvalidFormatBoolean
source: Allowed values for boolean columns are 0, 1, "true", or "false"
sr: 부울 열에 허용되는 값은 1, 0. "true" 또는 "false"입니다.

# EditDataCreateScriptMissingValue
source: The column '{0}' is defined as NOT NULL but was not given a value
sr: 열 '{0}'이(가) NOT NULL로 정의되었으나 값이 지정되지 않았습니다.

# EditDataDeleteSetCell
source: A delete is pending for this row, a cell update cannot be applied.
sr: 이 행의 삭제가 보류 중이므로 셀을 업데이트할 수 없습니다.

# EditDataColumnIdOutOfRange
source: Column ID must be in the range of columns for the query
sr: 열 ID는 쿼리의 열 범위 내에 있어야 합니다.

# EditDataColumnCannotBeEdited
source: Column cannot be edited
sr: 열을 편집할 수 없습니다.

# EditDataColumnNoKeyColumns
source: No key columns were found
sr: 키 열이 없습니다.

# EditDataScriptFilePathNull
source: An output filename must be provided
sr: 출력 파일명을 지정해야 합니다.

# EditDataUnsupportedObjectType
source: Database object {0} cannot be used for editing.
sr: 데이터베이스 개체 {0}은(는) 편집할 수 없습니다.

# ConnectionServiceDbErrorDefaultNotConnected
source: Specified URI '{0}' does not have a default connection
sr: 지정된 URI '{0}'에 기본 연결이 없습니다.

# EditDataCommitInProgress
source: A commit task is in progress. Please wait for completion.
sr: 커밋 작업이 진행 중입니다. 완료될 때까지 기다리세요.

# SqlScriptFormatterDecimalMissingPrecision
source: Exact numeric column is missing numeric precision or numeric scale
sr: 정확한 숫자 열에 전체 자릿수 또는 소수 자릿수가 없습니다.

# QueryServiceResultSetAddNoRows
source: Cannot add row to result buffer, data reader does not contain rows
sr: 결과 버퍼에 행을 추가할 수 없거나 데이터 판독기에 행이 없습니다.

# EditDataTimeOver24Hrs
source: TIME column values must be between 00:00:00.0000000 and 23:59:59.9999999
sr: TIME 열의 값은 00:00:00.0000000과 23:59:59.9999999 사이여야 합니다.

# EditDataNullNotAllowed
source: NULL is not allowed for this column
sr: 이 열에는 NULL이 허용되지 않습니다.

# EditDataSessionAlreadyExists
source: Edit session already exists.
sr: 편집 세션이 이미 존재합니다.

# EditDataSessionNotInitialized
source: Edit session has not been initialized
sr: 편집 세션이 초기화되지 않았습니다.

# EditDataSessionAlreadyInitialized
source: Edit session has already been initialized
sr: 편집 세션이 이미 초기화되었습니다.

# EditDataSessionAlreadyInitializing
source: Edit session has already been initialized or is in the process of initializing
sr: 편집 세션이 이미 초기화되었거나 초기화 중입니다.

# EditDataQueryFailed
source: Query execution failed, see messages for details
sr: 쿼리 실행에 실패했습니다. 자세한 내용은 메시지를 참조하세요.

# EditDataFilteringNegativeLimit
source: Result limit cannot be negative
sr: 결과 제한은 음수일 수 없습니다.

# EditDataMetadataObjectNameRequired
source: A object name must be provided
sr: 개체 이름을 지정해야 합니다.

# EditDataMetadataTooManyIdentifiers
source: Explicitly specifying server or database is not supported
sr: 서버 또는 데이터베이스를 명시적으로 지정할 수 없습니다.

# EditDataMetadataNotExtended
source: Table metadata does not have extended properties
sr: 테이블 메타데이터에 확장 속성이 없습니다.

# EditDataObjectNotFound
source: Table or view requested for edit could not be found
sr: 편집이 요청된 테이블 또는 뷰를 찾을 수 없습니다.

# TreeNodeError
source: Error expanding: {0}
sr: 확장 오류: {0}

# ServerNodeConnectionError
source: Error connecting to {0}
sr: {0}에 연결하는 동안 오류가 발생했습니다.

# SchemaHierarchy_Aggregates
source: Aggregates
sr: 집계

# SchemaHierarchy_ServerRoles
source: Server Roles
sr: 서버 역할

# SchemaHierarchy_ApplicationRoles
source: Application Roles
sr: 애플리케이션 역할

# SchemaHierarchy_Assemblies
source: Assemblies
sr: 어셈블리

# SchemaHierarchy_AssemblyFiles
source: Assembly Files
sr: 어셈블리 파일

# SchemaHierarchy_AsymmetricKeys
source: Asymmetric Keys
sr: 비대칭 키

# SchemaHierarchy_DatabaseAsymmetricKeys
source: Asymmetric Keys
sr: 비대칭 키

# SchemaHierarchy_DataCompressionOptions
source: Data Compression Options
sr: 데이터 압축 옵션

# SchemaHierarchy_Certificates
source: Certificates
sr: 인증서

# SchemaHierarchy_FileTables
source: FileTables
sr: FileTable

# SchemaHierarchy_DatabaseCertificates
source: Certificates
sr: 인증서

# SchemaHierarchy_CheckConstraints
source: Check Constraints
sr: CHECK 제약 조건

# SchemaHierarchy_Columns
source: Columns
sr: 열

# SchemaHierarchy_Constraints
source: Constraints
sr: 제약 조건

# SchemaHierarchy_Contracts
source: Contracts
sr: 계약

# SchemaHierarchy_Credentials
source: Credentials
sr: 자격 증명

# SchemaHierarchy_ErrorMessages
source: Error Messages
sr: 오류 메시지

# SchemaHierarchy_ServerRoleMembership
source: Server Role Membership
sr: 서버 역할 멤버 자격

# SchemaHierarchy_DatabaseOptions
source: Database Options
sr: 데이터베이스 옵션

# SchemaHierarchy_DatabaseRoles
source: Database Roles
sr: 데이터베이스 역할

# SchemaHierarchy_RoleMemberships
source: Role Memberships
sr: 역할 멤버 자격

# SchemaHierarchy_DatabaseTriggers
source: Database Triggers
sr: 데이터베이스 트리거

# SchemaHierarchy_DefaultConstraints
source: Default Constraints
sr: DEFAULT 제약 조건

# SchemaHierarchy_Defaults
source: Defaults
sr: 기본값

# SchemaHierarchy_Sequences
source: Sequences
sr: 시퀀스

# SchemaHierarchy_Endpoints
source: Endpoints
sr: 엔드포인트

# SchemaHierarchy_EventNotifications
source: Event Notifications
sr: 이벤트 알림

# SchemaHierarchy_ServerEventNotifications
source: Server Event Notifications
sr: 서버 이벤트 알림

# SchemaHierarchy_ExtendedProperties
source: Extended Properties
sr: 확장 속성

# SchemaHierarchy_FileGroups
source: Filegroups
sr: 파일 그룹

# SchemaHierarchy_ForeignKeys
source: Foreign Keys
sr: 외래 키

# SchemaHierarchy_FullTextCatalogs
source: Full-Text Catalogs
sr: 전체 텍스트 카탈로그

# SchemaHierarchy_FullTextIndexes
source: Full-Text Indexes
sr: 전체 텍스트 인덱스

# SchemaHierarchy_Functions
source: Functions
sr: 함수

# SchemaHierarchy_Indexes
source: Indexes
sr: 인덱스

# SchemaHierarchy_InlineFunctions
source: Inline Functions
sr: 인라인 함수

# SchemaHierarchy_Keys
source: Keys
sr: 키

# SchemaHierarchy_LinkedServers
source: Linked Servers
sr: 연결된 서버

# SchemaHierarchy_LinkedServerLogins
source: Linked Server Logins
sr: 연결된 서버 로그인

# SchemaHierarchy_Logins
source: Logins
sr: 로그인

# SchemaHierarchy_MasterKey
source: Master Key
sr: 마스터 키

# SchemaHierarchy_MasterKeys
source: Master Keys
sr: 마스터 키

# SchemaHierarchy_MessageTypes
source: Message Types
sr: 메시지 유형

# SchemaHierarchy_MultiSelectFunctions
source: Table-Valued Functions
sr: 테이블 반환 함수

# SchemaHierarchy_Parameters
source: Parameters
sr: 매개 변수

# SchemaHierarchy_PartitionFunctions
source: Partition Functions
sr: 파티션 함수

# SchemaHierarchy_PartitionSchemes
source: Partition Schemes
sr: 파티션 구성표

# SchemaHierarchy_Permissions
source: Permissions
sr: 권한

# SchemaHierarchy_PrimaryKeys
source: Primary Keys
sr: 기본 키

# SchemaHierarchy_Programmability
source: Programmability
sr: 프로그래밍 기능

# SchemaHierarchy_Queues
source: Queues
sr: 큐

# SchemaHierarchy_RemoteServiceBindings
source: Remote Service Bindings
sr: 원격 서비스 바인딩

# SchemaHierarchy_ReturnedColumns
source: Returned Columns
sr: 반환 열

# SchemaHierarchy_Roles
source: Roles
sr: 역할

# SchemaHierarchy_Routes
source: Routes
sr: 경로

# SchemaHierarchy_Rules
source: Rules
sr: 규칙

# SchemaHierarchy_Schemas
source: Schemas
sr: 스키마

# SchemaHierarchy_Security
source: Security
sr: 보안

# SchemaHierarchy_ServerObjects
source: Server Objects
sr: 서버 개체

# SchemaHierarchy_Management
source: Management
sr: 관리

# SchemaHierarchy_ServerTriggers
source: Triggers
sr: 트리거

# SchemaHierarchy_Services
source: Services
sr: 서비스

# SchemaHierarchy_Signatures
source: Signatures
sr: 시그니처

# SchemaHierarchy_LogFiles
source: Log Files
sr: 로그 파일

# SchemaHierarchy_Statistics
source: Statistics
sr: 통계

# SchemaHierarchy_Storage
source: Storage
sr: 스토리지

# SchemaHierarchy_StoredProcedures
source: Stored Procedures
sr: 저장 프로시저

# SchemaHierarchy_SymmetricKeys
source: Symmetric Keys
sr: 대칭 키

# SchemaHierarchy_Synonyms
source: Synonyms
sr: 동의어

# SchemaHierarchy_Tables
source: Tables
sr: 테이블

# SchemaHierarchy_Triggers
source: Triggers
sr: 트리거

# SchemaHierarchy_Types
source: Types
sr: 형식

# SchemaHierarchy_UniqueKeys
source: Unique Keys
sr: 고유 키

# SchemaHierarchy_UserDefinedDataTypes
source: User-Defined Data Types
sr: 사용자 정의 데이터 형식

# SchemaHierarchy_UserDefinedTypes
source: User-Defined Types (CLR)
sr: 사용자 정의 유형(CLR)

# SchemaHierarchy_Users
source: Users
sr: 사용자

# SchemaHierarchy_Views
source: Views
sr: 뷰

# SchemaHierarchy_XmlIndexes
source: XML Indexes
sr: XML 인덱스

# SchemaHierarchy_XMLSchemaCollections
source: XML Schema Collections
sr: XML 스키마 컬렉션

# SchemaHierarchy_UserDefinedTableTypes
source: User-Defined Table Types
sr: 사용자 정의 테이블 형식

# SchemaHierarchy_FilegroupFiles
source: Files
sr: 파일

source: Missing Caption
sr: 캡션 누락

# SchemaHierarchy_BrokerPriorities
source: Broker Priorities
sr: Broker 우선 순위

# SchemaHierarchy_CryptographicProviders
source: Cryptographic Providers
sr: 암호화 공급자

# SchemaHierarchy_DatabaseAuditSpecifications
source: Database Audit Specifications
sr: 데이터베이스 감사 사양

# SchemaHierarchy_DatabaseEncryptionKeys
source: Database Encryption Keys
sr: 데이터베이스 암호화 키

# SchemaHierarchy_EventSessions
source: Event Sessions
sr: 이벤트 세션

# SchemaHierarchy_FullTextStopLists
source: Full Text Stoplists
sr: 전체 텍스트 중지 목록

# SchemaHierarchy_ResourcePools
source: Resource Pools
sr: 리소스 풀

# SchemaHierarchy_ServerAudits
source: Audits
sr: 감사

# SchemaHierarchy_ServerAuditSpecifications
source: Server Audit Specifications
sr: 서버 감사 사양

# SchemaHierarchy_SpatialIndexes
source: Spatial Indexes
sr: 공간 인덱스

# SchemaHierarchy_WorkloadGroups
source: Workload Groups
sr: 작업 그룹

# SchemaHierarchy_SqlFiles
source: SQL Files
sr: SQL 파일

# SchemaHierarchy_ServerFunctions
source: Server Functions
sr: 서버 함수

# SchemaHierarchy_SqlType
source: SQL Type
sr: SQL 유형

# SchemaHierarchy_ServerOptions
source: Server Options
sr: 서버 옵션

# SchemaHierarchy_DatabaseDiagrams
source: Database Diagrams
sr: 데이터베이스 다이어그램

# SchemaHierarchy_SystemTables
source: System Tables
sr: 시스템 테이블

# SchemaHierarchy_Databases
source: Databases
sr: 데이터베이스

# SchemaHierarchy_SystemContracts
source: System Contracts
sr: 시스템 계약

# SchemaHierarchy_SystemDatabases
source: System Databases
sr: 시스템 데이터베이스

# SchemaHierarchy_SystemMessageTypes
source: System Message Types
sr: 시스템 메시지 유형

# SchemaHierarchy_SystemQueues
source: System Queues
sr: 시스템 큐

# SchemaHierarchy_SystemServices
source: System Services
sr: 시스템 서비스

# SchemaHierarchy_SystemStoredProcedures
source: System Stored Procedures
sr: 시스템 저장 프로시저

# SchemaHierarchy_SystemViews
source: System Views
sr: 시스템 뷰

# SchemaHierarchy_DataTierApplications
source: Data-tier Applications
sr: 데이터 계층 애플리케이션

# SchemaHierarchy_ExtendedStoredProcedures
source: Extended Stored Procedures
sr: 확장 저장 프로시저

# SchemaHierarchy_SystemAggregateFunctions
source: Aggregate Functions
sr: 집계 함수

# SchemaHierarchy_SystemApproximateNumerics
source: Approximate Numerics
sr: 근사치

# SchemaHierarchy_SystemBinaryStrings
source: Binary Strings
sr: 이진 문자열

# SchemaHierarchy_SystemCharacterStrings
source: Character Strings
sr: 문자열

# SchemaHierarchy_SystemCLRDataTypes
source: CLR Data Types
sr: CLR 데이터 형식

# SchemaHierarchy_SystemConfigurationFunctions
source: Configuration Functions
sr: 구성 함수

# SchemaHierarchy_SystemCursorFunctions
source: Cursor Functions
sr: 커서 함수

# SchemaHierarchy_SystemDataTypes
source: System Data Types
sr: 시스템 데이터 형식

# SchemaHierarchy_SystemDateAndTime
source: Date and Time
sr: 날짜 및 시간

# SchemaHierarchy_SystemDateAndTimeFunctions
source: Date and Time Functions
sr: 날짜 및 시간 함수

# SchemaHierarchy_SystemExactNumerics
source: Exact Numerics
sr: 정확한 수치

# SchemaHierarchy_SystemFunctions
source: System Functions
sr: 시스템 함수

# SchemaHierarchy_SystemHierarchyIdFunctions
source: Hierarchy Id Functions
sr: 계층 ID 함수

# SchemaHierarchy_SystemMathematicalFunctions
source: Mathematical Functions
sr: 수치 연산 함수

# SchemaHierarchy_SystemMetadataFunctions
source: Metadata Functions
sr: 메타데이터 함수

# SchemaHierarchy_SystemOtherDataTypes
source: Other Data Types
sr: 기타 데이터 형식

# SchemaHierarchy_SystemOtherFunctions
source: Other Functions
sr: 기타 함수

# SchemaHierarchy_SystemRowsetFunctions
source: Rowset Functions
sr: 행 집합 함수

# SchemaHierarchy_SystemSecurityFunctions
source: Security Functions
sr: 보안 함수

# SchemaHierarchy_SystemSpatialDataTypes
source: Spatial Data Types
sr: 공간 데이터 형식

# SchemaHierarchy_SystemStringFunctions
source: String Functions
sr: 문자열 함수

# SchemaHierarchy_SystemSystemStatisticalFunctions
source: System Statistical Functions
sr: 시스템 통계 함수

# SchemaHierarchy_SystemTextAndImageFunctions
source: Text and Image Functions
sr: 텍스트 및 이미지 함수

# SchemaHierarchy_SystemUnicodeCharacterStrings
source: Unicode Character Strings
sr: 유니코드 문자열

# SchemaHierarchy_AggregateFunctions
source: Aggregate Functions
sr: 집계 함수

# SchemaHierarchy_ScalarValuedFunctions
source: Scalar-valued Functions
sr: 스칼라 반환 함수

# SchemaHierarchy_TableValuedFunctions
source: Table-valued Functions
sr: 테이블 반환 함수

# SchemaHierarchy_SystemExtendedStoredProcedures
source: System Extended Stored Procedures
sr: 시스템 확장 저장 프로시저

# SchemaHierarchy_BuiltInType
source: Built-in Types
sr: 기본 제공 유형

# SchemaHierarchy_BuiltInServerRole
source: Built-in Server Roles
sr: 기본 제공 서버 역할

# SchemaHierarchy_UserWithPassword
source: User with Password
sr: 암호가 있는 사용자

# SchemaHierarchy_SearchPropertyList
source: Search Property List
sr: 검색 속성 목록

# SchemaHierarchy_SecurityPolicies
source: Security Policies
sr: 보안 정책

# SchemaHierarchy_SecurityPredicates
source: Security Predicates
sr: 보안 조건자

# SchemaHierarchy_ServerRole
source: Server Role
sr: 서버 역할

# SchemaHierarchy_SearchPropertyLists
source: Search Property Lists
sr: 검색 속성 목록

# SchemaHierarchy_ColumnStoreIndexes
source: Column Store Indexes
sr: 열 저장 인덱스

# SchemaHierarchy_TableTypeIndexes
source: Table Type Indexes
sr: 테이블 유형 인덱스

# SchemaHierarchy_SelectiveXmlIndexes
source: Selective XML Indexes
sr: 선택적 XML 인덱스

# SchemaHierarchy_XmlNamespaces
source: XML Namespaces
sr: XML 네임스페이스

# SchemaHierarchy_XmlTypedPromotedPaths
source: XML Typed Promoted Paths
sr: XML 유형의 공유된 경로

# SchemaHierarchy_SqlTypedPromotedPaths
source: T-SQL Typed Promoted Paths
sr: T-SQL 유형의 공유된 경로

# SchemaHierarchy_DatabaseScopedCredentials
source: Database Scoped Credentials
sr: 데이터베이스 범위 자격 증명

# SchemaHierarchy_ExternalDataSources
source: External Data Sources
sr: 외부 데이터 원본

# SchemaHierarchy_ExternalFileFormats
source: External File Formats
sr: 외부 파일 형식

# SchemaHierarchy_ExternalResources
source: External Resources
sr: 외부 리소스

# SchemaHierarchy_ExternalTables
source: External Tables
sr: 외부 테이블

# SchemaHierarchy_AlwaysEncryptedKeys
source: Always Encrypted Keys
sr: Always Encrypted 키

# SchemaHierarchy_ColumnMasterKeys
source: Column Master Keys
sr: 열 마스터 키

# SchemaHierarchy_ColumnEncryptionKeys
source: Column Encryption Keys
sr: 열 암호화 키

# SchemaHierarchy_Server
source: Server
sr: 서버

# ScriptingParams_ConnectionString_Property_Invalid
source: Error parsing ScriptingParams.ConnectionString property.
sr: ScriptingParams.ConnectionString 속성을 분석하는 동안 오류가 발생했습니다.

# ScriptingParams_FilePath_Property_Invalid
source: Invalid directory specified by the ScriptingParams.FilePath property.
sr: ScriptingParams.FilePath 속성에 잘못된 디렉터리를 지정했습니다.

# ScriptingListObjectsCompleteParams_ConnectionString_Property_Invalid
source: Error parsing ScriptingListObjectsCompleteParams.ConnectionString property.
sr: ScriptingListObjectsCompleteParams.ConnectionString 속성을 분석하는 동안 오류가 발생했습니다.

# SchemaHierarchy_SubroutineParameterNoDefaultLabel
source: No default
sr: 기본값 없음

# SchemaHierarchy_SubroutineParameterInputLabel
source: Input
sr: 입력

# SchemaHierarchy_SubroutineParameterInputOutputLabel
source: Input/Output
sr: 입/출력

# SchemaHierarchy_SubroutineParameterInputReadOnlyLabel
source: Input/ReadOnly
sr: 입력/읽기 전용

# SchemaHierarchy_SubroutineParameterInputOutputReadOnlyLabel
source: Input/Output/ReadOnly
sr: 입/출력/읽기 전용

# SchemaHierarchy_SubroutineParameterDefaultLabel
source: Default
sr: 기본값

# SchemaHierarchy_NotNullColumn_Label
source: not null
sr: Null이 아님

# SchemaHierarchy_ComputedColumnLabelWithType
source: {0} ({1}Computed, {2}, {3})
sr: {0}({1}컴퓨팅됨, {2}, {3})

# SchemaHierarchy_ComputedColumnLabelWithoutType
source: {0} ({1}Computed)
sr: {0}({1}컴퓨팅됨)

# SchemaHierarchy_ColumnSetLabelWithoutType
source: {0} (Column Set, {1})
sr: {0}(열 집합, {1})

# SchemaHierarchy_ColumnSetLabelWithType
source: {0} (Column Set, {1}{2}, {3})
sr: {0}(열 집합, {1}{2}, {3})
