Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# EffectiveDegreeOfParallelismDescription
source: Max degree of parallelism during columnstore index build.
sr: Columnstore 인덱스 작성 중 최대 병렬 처리 수준입니다.

source: Memory Grant
sr: 메모리 부여

# MemoryGrantDescription
source: Memory grant.
sr: 메모리를 부여합니다.

source: Remote Destination
sr: 대상 제거

# RemoteDestinationDescription
source: Remote object.
sr: 원격 개체입니다.

source: Remote Object
sr: 원격 개체

# RemoteObjectDescription
source: Remote object.
sr: 원격 개체입니다.

source: Remote Source
sr: 원격 원본

# RemoteSourceDescription
source: Remote source.
sr: 원격 원본입니다.

source: Used UDX Columns
sr: 사용된 UDX 열

# UsedUdxColumnsDescription
source: Used UDX columns.
sr: 사용된 UDX 열입니다.

source: Inner Side Join columns
sr: 내부 측면 조인 열

# InnerSideJoinColumnsDescription
source: Inner side join columns.
sr: 내부 측면 조인 열입니다.

source: Outer Side Join columns
sr: 외부 측면 조인 열

# OuterSideJoinColumnsDescription
source: Outer side join columns.
sr: 외부 측면 조인 열입니다.

source: Where (join columns)
sr: Where(조인 열)

source: Residual
sr: 나머지

# ResidualDescription
source: Residual.
sr: 나머지입니다.

# PassThru
source: Pass Through
sr: 통과

# PassThruDescription
source: Pass throuh.
sr: 통과입니다.

source: Many to Many
sr: 다 대 다

# ManyToManyDescription
source: Many to many.
sr: 다 대 다 관계입니다.

source: Partition Columns
sr: 파티션 열

# PartitionColumnsDescription
source: Partition columns.
sr: 파티션 열입니다.

source: Ascending
sr: 오름차순

source: Descending
sr: 내림차순

source: Hash Keys
sr: 해시 키

# HashKeysDescription
source: Hash keys.
sr: 해시 키입니다.

source: Probe Column
sr: 열 검색

# ProbeColumnDescription
source: Probe column.
sr: 열을 검색합니다.

source: Partitioning Type
sr: 분할 유형

# PartitioningTypeDescription
source: Partitioning type.
sr: 분할 유형입니다.

source: Group By
sr: 그룹화 기준

# GroupByDescription
source: Group by.
sr: 그룹화 방법입니다.

source: Grouping Sets
sr: 그룹화 세트

# GroupingSetsDescription
source: The group sets list. Each Value is a reverse bit map for the grouping columns in Group By property.
sr: 그룹 세트 목록입니다. 각각의 값은 Group By 속성의 그룹화 열에 대한 역방향 비트맵입니다.

source: Segment Column
sr: 세그먼트 열

# SegmentColumnDescription
source: Segment column.
sr: 세그먼트 열입니다.

source: Rank Columns
sr: 순위 열

# RankColumnsDescription
source: Rank columns.
sr: 순위 열입니다.

source: Predicate
sr: 조건자

# PredicateDescription
source: Predicate.
sr: 조건자입니다.

source: Outer References
sr: 외부 참조

# OuterReferencesDescription
source: Outer references.
sr: 외부 참조입니다.

source: Scalar Operator
sr: 스칼라 연산자

source: Action Column
sr: 동작 열

# ActionColumnDescription
source: Action column.
sr: 동작 열입니다.

source: Original Action Column
sr: 원래 동작 열

# OriginalActionColumnDescription
source: Original Action column.
sr: 원래 동작 열입니다.

# Rows
source: Top Rows
sr: 상위 행

# RowsDescription
source: Top Rows.
sr: 상위 행입니다.

source: Seek Predicate
sr: Seek 조건자

# SeekPredicateDescription
source: Seek predicate.
sr: Seek 조건자입니다.

source: Partitioned
sr: 분할됨

# PartitionedDescription
source: Whether the operation is on a partitioned table or index.
sr: 작업이 분할된 테이블 또는 인덱스에 있는지 여부를 나타냅니다.

source: Seek Keys
sr: 검색 키

# SeekKeysDescription
source: Keys used by a seek operation.
sr: 검색 작업에 사용되는 키입니다.

# PartitionsAccessed
source: Actual Partitions Accessed
sr: 실제 액세스한 파티션 범위

# PartitionCount
source: Actual Partition Count
sr: 실제 파티션 수

source: Tie Columns
sr: 열 연결

# TieColumnsDescription
source: Tie columns.
sr: 동률 열입니다.

source: Is Percent
sr: 비율 여부

# IsPercentDescription
source: Is percent.
sr: 비율인지 여부를 나타냅니다.

source: With Ties
sr: 동률

# WithTiesDescription
source: With ties.
sr: 동률입니다.

source: Partition ID
sr: 파티션 ID

# PartitionIdDescription
source: Partition ID.
sr: 파티션 ID입니다.

source: Ordered
sr: 주문됨

# OrderedDescription
source: Ordered.
sr: 정렬된 상태입니다.

source: Scan Direction
sr: 검색 방향

# ScanDirectionDescription
source: Direction of the scan operation as either forward or backward.
sr: 전진 또는 후진 등 검색 작업의 방향입니다.

source: Forced Index
sr: 강제 인덱스

# ForcedIndexDescription
source: Forced index.
sr: 강제 인덱스입니다.

# SetPredicate
source: Predicate
sr: 조건자

# SetPredicateDescription
source: Predicate
sr: 조건자

source: Top Expression
sr: 상위 식

# TopExpressionDescription
source: Top expression.
sr: 상위 식입니다.

source: Hash Keys Build
sr: 해시 키 작성

# HashKeysBuildDescription
source: Hash keys build.
sr: 해시 키를 작성합니다.

source: Hash Keys Probe
sr: 해시 키 프로브

# HashKeysProbeDescription
source: Hash keys probe.
sr: 해시 키 프로브입니다.

source: Build Residual
sr: 작성 후 남은 항목

# BuildResidualDescription
source: Build residual.
sr: 작성 후 남은 항목입니다.

source: Probe Residual
sr: 나머지 검색

# ProbeResidualDescription
source: Probe residual.
sr: 나머지를 검색합니다.

source: Seek Predicates
sr: Seek 조건자

# SeekPredicatesDescription
source: Seek predicates.
sr: Seek 조건자입니다.

source: Set Options
sr: 집합 옵션

# SetOptionsDescription
source: Set options.
sr: 집합 옵션입니다.

source: Optimization Level
sr: 최적화 수준

# OptimizationLevelDescription
source: Optimization level.
sr: 최적화 수준입니다.

# StatementOptmEarlyAbortReason
source: Reason For Early Termination Of Statement Optimization
sr: 문 최적화의 조기 종료 이유

source: Time Out
sr: 제한 시간

source: Memory Limit Exceeded
sr: 메모리 제한 초과

source: Good Enough Plan Found
sr: 적합한 계획 발견

source: Estimated Rebinds
sr: 예상 다시 바인딩 횟수

# EstimatedRebindsDescription
source: Estimated rebinds.
sr: 예상 다시 바인딩 횟수입니다.

source: Estimated Rewinds
sr: 예상 되감기 횟수

# EstimatedRewindsDescription
source: Estimated rewinds.
sr: 예상 되감기 횟수입니다.

# ActualLocallyAggregatedRows
source: Actual Number of Locally Aggregated Rows
sr: 로컬에서 실제로 집계된 행 수

# ActualLocallyAggregatedRowsDescription
source: Actual number of locally aggregated rows
sr: 로컬에서 실제로 집계된 행 수

source: Actual Rebinds
sr: 실제 다시 바인딩 횟수

# ActualRebindsDescription
source: Actual Rebinds.
sr: 실제 다시 바인딩 횟수입니다.

source: Actual Rewinds
sr: 실제 되감기 횟수

# ActualRewindsDescription
source: Actual Rewinds.
sr: 실제 되감기 횟수입니다.

source: Actual I/O Statistics
sr: 실제 I/O 통계

# ActualIOStatisticsDescription
source: Actual I/O Statistics
sr: 실제 I/O 통계

source: Actual Time Statistics
sr: 실제 시간 통계

# ActualTimeStatisticsDescription
source: Actual Time Statistics
sr: 실제 시간 통계

# ActualElapsedms
source: Actual Elapsed Time (ms)
sr: 실제 경과된 시간(ms)

# ActualElapsedmsDescription
source: Actual elapsed time in milliseconds
sr: 실제 경과된 시간(밀리초)

# ActualCPUms
source: Actual Elapsed CPU Time (ms)
sr: 실제 경과된 CPU 시간(ms)

# ActualCPUmsDescription
source: Actual elapsed CPU time in milliseconds
sr: 실제 경과된 CPU 시간(밀리초)

source: Actual Scans
sr: 실제 스캔

# ActualScansDescription
source: Actual Scans
sr: 실제 스캔

source: Actual Logical Reads
sr: 실제 논리적 읽기

# ActualLogicalReadsDescription
source: Actual Logical Reads
sr: 실제 논리적 읽기

source: Actual Physical Reads
sr: 실제 물리적 읽기

# ActualPhysicalReadsDescription
source: Actual Physical Reads
sr: 실제 물리적 읽기

source: Actual Page Server Reads
sr: 실제 페이지 서버 읽기

# ActualPageServerReadsDescription
source: Actual Page Server Reads
sr: 실제 페이지 서버 읽기

source: Actual Read Aheads
sr: 실제 미리 읽기

# ActualReadAheadsDescription
source: Actual Read Aheads
sr: 실제 미리 읽기

source: Actual Page Server Read Aheads
sr: 실제 페이지 서버 읽기 미리 읽기

# ActualPageServerReadAheadsDescription
source: Actual Page Server Read Aheads
sr: 실제 페이지 서버 읽기 미리 읽기

source: Actual Lob Logical Reads
sr: 실제 LOB 논리적 읽기

# ActualLobLogicalReadsDescription
source: Actual Lob Logical Reads
sr: 실제 LOB 논리적 읽기

source: Actual Lob Physical Reads
sr: 실제 LOB 물리적 읽기

# ActualLobPhysicalReadsDescription
source: Actual Lob Physical Reads
sr: 실제 LOB 물리적 읽기

source: Actual Lob Page Server Reads
sr: 실제 Lob 페이지 서버 읽기

# ActualLobPageServerReadsDescription
source: Actual Lob Page Server Reads
sr: 실제 Lob 페이지 서버 읽기

source: Actual Lob Read Aheads
sr: 실제 LOB 미리 읽기

# ActualLobReadAheadsDescription
source: Actual Lob Read Aheads
sr: 실제 LOB 미리 읽기

source: Actual Lob Page Server Read Aheads
sr: 실제 Lob 페이지 서버 읽기 미리 읽기

# ActualLobPageServerReadAheadsDescription
source: Actual Lob Page Server Read Aheads
sr: 실제 Lob 페이지 서버 읽기 미리 읽기

# ActualMemoryGrantStats
source: Memory Usage
sr: 메모리 사용량

source: Hpc Row Count
sr: HPC 행 개수

# HpcRowCountDescription
source: Number of rows processed by Hpc devices.
sr: HPC 디바이스에서 처리된 행의 수입니다.

# HpcKernelElapsedUs
source: Hpc Kernel Elapsed Time in Us
sr: HPC 커널의 경과된 시간(단위: us)

# HpcKernelElapsedUsDescription
source: Elapsed time (in micro seconds) of Hpc device kernel execution.
sr: HPC 디바이스 커널 실행의 경과된 시간입니다(단위: 마이크로초).

source: Hpc Host To Device Bytes
sr: HPC 호스트에서 디바이스로 전송되는 바이트

# HpcHostToDeviceBytesDescription
source: Data transferred from host to Hpc device in bytes.
sr: 호스트에서 HPC 디바이스로 전송된 데이터입니다(단위: 바이트).

source: Hpc Device To Host Bytes
sr: HPC 디바이스에서 호스트로 전송되는 바이트

# HpcDeviceToHostBytesDescription
source: Data transferred from Hpc device to host in bytes.
sr: HPC 디바이스에서 호스트로 전송된 데이터입니다(단위: 바이트).

# InputMemoryGrant
source: Input Memory
sr: 입력 메모리

# OutputMemoryGrant
source: Output Memory
sr: 출력 메모리

# UsedMemoryGrant
source: Used Memory
sr: 사용된 메모리

# DistinctDescription
source: Distinct.
sr: 고유 값입니다.

source: Order By
sr: 정렬 기준

# OrderByDescription
source: Order by.
sr: 정렬 기준입니다.

# SpillOccurredDisplayString
source: Operator used tempdb to spill data during execution
sr: 실행하는 동안 데이터를 스필하기 위해 연산자에서 tempdb 사용

source: Columns With No Statistics
sr: 열에 통계가 없음

# ColumnsWithNoStatisticsDescription
source: Columns with no statistics warning.
sr: 열에 통계가 없습니다.

source: No Join Predicate
sr: 조인 조건자 없음

# NoJoinPredicateDescription
source: No Join predicate warning.
sr: 조인 조건자가 없습니다.

# SpillToTempDbOld
source: Operator used tempdb to spill data during execution with spill level {0}
sr: 스필 수준 {0}(으)로 실행하는 동안 데이터를 스필하기 위해 연산자에서 tempdb 사용

# SpillToTempDb
source: Operator used tempdb to spill data during execution with spill level {0} and {1} spilled thread(s)
sr: 스필 수준 {0} 또는 {1}개의 스필된 스레드로 실행하는 동안 데이터를 스필하기 위해 연산자에서 tempdb 사용

# SpillToTempDbDescription
source: Spill to tempdb warning.
sr: tempdb에 대한 스필 경고입니다.

# SortSpillDetails
source: Sort wrote {0} pages to and read {1} pages from tempdb with granted memory {2}KB and used memory {3}KB
sr: 정렬이 tempdb에서 {0}개 페이지를 쓰고 {1}개 페이지를 읽음(부여된 메모리: {2}KB, 사용한 메모리: {3}KB)

# SortSpillDetailsDescription
source: Details of sort spill
sr: 정렬 스필 세부 정보

# HashSpillDetails
source: Hash wrote {0} pages to and read {1} pages from tempdb with granted memory {2}KB and used memory {3}KB
sr: 해시가 tempdb에서 {0}개 페이지를 쓰고 {1}개 페이지를 읽음(부여된 메모리: {2}KB, 사용한 메모리: {3}KB)

# HashSpillDetailsDescription
source: Details of hash spill
sr: 해시 스필 세부 정보

# FullUpdateForOnlineIndexBuild
source: A partial update was converted to a full update because of an online index build
sr: 온라인 인덱스 빌드 때문에 부분 업데이트가 전체 업데이트로 변환되었습니다.

# FullUpdateForOnlineIndexBuildDescription
source: Full update for online index build warning
sr: 온라인 인덱스 빌드를 위한 전체 업데이트 경고

# Wait
source: The query had to wait {0} seconds for {1} during execution
sr: 쿼리가 {1}을(를) 실행하는 동안 {0}초 정도 기다려야 했습니다.

# WaitDescription
source: Query wait warning.
sr: 쿼리 대기 경고입니다.

# PlanAffectingConvert
source: Type conversion in expression ({0}) may affect "{1}" in query plan choice
sr: 식의 형식을 변환({0})하면 쿼리 계획 선택 시에 {1}에 영향을 줄 수 있습니다.

# PlanAffectingConvertDescription
source: Plan-affecting type conversion warning.
sr: 계획에 영향을 미치는 형식 변환 경고입니다.

# MemoryGrantWarning
source: The query memory grant detected "{0}", which may impact the reliability. Grant size: Initial {1} KB, Final {2} KB, Used {3} KB.
sr: 쿼리 메모리 부여에서 안정성에 영향을 줄 수 있는 "{0}"이(가) 검색되었습니다. 부여 크기: 최초 {1}KB, 최종 {2}KB, 사용 중 {3}KB.

# MemoryGrantWarningDescription
source: Details on memory grant warning
sr: 메모리 부여 경고에 대한 세부 정보

source: Startup Expression
sr: 시작 식

# StartupExpressionDescription
source: Whether a filter startup expression is used.
sr: 필터 시작 식의 사용 여부를 나타냅니다.

source: Startup Expression Predicate
sr: 시작 식 조건자

source: Query
sr: 쿼리

# Stack
source: With Stack
sr: 스택 포함

# RowCount
source: Is Row Count
sr: 행 개수

source: Optimized
sr: 최적화

source: With Prefetch
sr: 사전 인출 사용

source: Prefix
sr: 접두사

# StartRange
source: Start
sr: 시작

# StartRangeDescription
source: Start of the range.
sr: 시작 범위입니다.

# EndRange
source: End
sr: 종료

# EndRangeDescription
source: End of the range.
sr: 끝 범위입니다.

source: Range Columns
sr: 범위 열

source: Range Expressions
sr: 범위 식

source: Scan Type
sr: 검사 유형

source: Column Reference
sr: 열 참조

# ObjectServer
source: Server
sr: 서버

# ObjectServerDescription
source: Server name for the referenced object.
sr: 참조된 개체에 대한 서버 이름입니다.

# ObjectDatabase
source: Database
sr: 데이터베이스

# ObjectDatabaseDescription
source: Database name for the referenced object.
sr: 참조된 개체에 대한 데이터베이스 이름입니다.

# ObjectIndex
source: Index
sr: 인덱스

# ObjectIndexDescription
source: Index name for the referenced object.
sr: 참조된 개체에 대한 인덱스 이름입니다.

# ObjectSchema
source: Schema
sr: 스키마

# ObjectSchemaDescription
source: Schema name for the referenced object.
sr: 참조된 개체에 대한 스키마 이름입니다.

# ObjectTable
source: Table
sr: 테이블

# ObjectTableDescription
source: Table name for the referenced object.
sr: 참조된 개체에 대한 테이블 이름입니다.

# ObjectAlias
source: Alias
sr: 별칭

# ObjectAliasDescription
source: Alias used for the referenced object.
sr: 참조된 개체에 사용된 별칭입니다.

# ObjectColumn
source: Column
sr: 열

# ObjectColumnDescription
source: Column name for the referenced object.
sr: 참조된 개체에 대한 열 이름입니다.

# ObjectComputedColumn
source: Computed Column
sr: 계산 열

# ObjectComputedColumnDescription
source: Whether this is a computed column.
sr: 계산 열인지 여부를 나타냅니다.

source: Parameter Data Type
sr: 매개 변수 데이터 형식

source: Parameter Compiled Value
sr: 매개 변수 컴파일 값

source: Parameter Runtime Value
sr: 매개 변수 런타임 값

source: Cursor Plan
sr: 커서 계획

source: Cursor Operation
sr: 커서 작업

source: Cursor Name
sr: 커서 이름

source: Cursor Actual Type
sr: 커서 실제 유형

source: Cursor Requested Type
sr: 커서 요청 유형

source: Cursor Concurrency
sr: 커서 동시성

source: Forward Only
sr: 정방향만

source: Query Plan
sr: 쿼리 계획

source: Operation Type
sr: 작업 유형

source: Node ID
sr: 노드 ID

source: Primary Node ID
sr: 주 노드 ID

# InternalInfo
source: Internal Debugging Information
sr: 내부 디버깅 정보

source: Foreign Key References Count
sr: 외래 키 참조 개수

# NoMatchingIndexCount
source: No Matching Indexes Count
sr: 일치하는 인덱스 개수 없음

# PartialMatchingIndexCount
source: Partial Matching Indexes Count
sr: 부분적으로 일치하는 인덱스 개수

# LogicalOpCollapse
source: Collapse
sr: 축소

# LogicalOpConcatenation
source: Concatenation
sr: 연결

# LogicalOpConstantScan
source: Constant Scan
sr: 상수 검사

# LogicalOpGatherStreams
source: Gather Streams
sr: 스트림 수집

# LogicalOpRepartitionStreams
source: Repartition Streams
sr: 스트림 다시 분할

# LogicalOpDistributeStreams
source: Distribute Streams
sr: 스트림 분산

# LogicalOpFilter
source: Filter
sr: 필터

# LogicalOpAssert
source: Assert
sr: 어설션

# LogicalOpLogRowScan
source: Log Row Scan
sr: 로그 행 검사

# LogicalOpPrint
source: Print
sr: 인쇄

# LogicalOpComputeScalar
source: Compute Scalar
sr: 스칼라 컴퓨팅

# LogicalOpMergeInterval
source: Merge Interval
sr: 병합 간격

# LogicalOpRank
source: Rank
sr: 순위

# LogicalOpSegment
source: Segment
sr: 세그먼트

# LogicalOpSequence
source: Sequence
sr: 시퀀스

# LogicalOpSplit
source: Split
sr: 분할됨

# LogicalOpAggregate
source: Aggregate
sr: 집계

# LogicalOpTableScan
source: Table Scan
sr: 테이블 검색

# LogicalOpClusteredIndexScan
source: Clustered Index Scan
sr: 클러스터형 인덱스 검사

# LogicalOpClusteredIndexSeek
source: Clustered Index Seek
sr: 클러스터형 인덱스 검색

# LogicalOpDeletedScan
source: Deleted Scan
sr: 삭제된 검사

# LogicalOpInsertedScan
source: Inserted Scan
sr: 삽입된 검사

# LogicalOpParameterTableScan
source: Parameter Table Scan
sr: 매개 변수 테이블 검사

# LogicalOpPut
source: Put
sr: 넣기

# LogicalOpIndexScan
source: Index Scan
sr: 인덱스 검사

# LogicalOpIndexSeek
source: Index Seek
sr: 인덱스 검색

# LogicalOpRemoteScan
source: Remote Scan
sr: 원격 검사

# LogicalOpRemoteIndexScan
source: Remote Index Scan
sr: 원격 인덱스 검사

# LogicalOpRemoteIndexSeek
source: Remote Index Seek
sr: 원격 인덱스 검색

# LogicalOpRemoteQuery
source: Remote Query
sr: 원격 쿼리

# LogicalOpRemoteInsert
source: Remote Insert
sr: 원격 삽입

# LogicalOpRemoteUpdate
source: Remote Update
sr: 원격 업데이트

# LogicalOpRemoteDelete
source: Remote Delete
sr: 원격 삭제

# LogicalOpClusteredUpdate
source: Clustered Update
sr: 클러스터형 업데이트

# LogicalOpDistinctSort
source: Distinct Sort
sr: 고유 정렬

# LogicalOpSort
source: Sort
sr: 정렬

# LogicalOpTopNSort
source: Top N Sort
sr: 상위 N 정렬

# LogicalOpEagerSpool
source: Eager Spool
sr: 즉시 스풀

# LogicalOpLazySpool
source: Lazy Spool
sr: 지연 스풀

# LogicalOpUpdate
source: Update
sr: 업데이트

# LogicalOpInsert
source: Insert
sr: 삽입

# LogicalOpDelete
source: Delete
sr: 삭제

# LogicalOpMerge
source: Merge
sr: 병합

# LogicalOpTop
source: Top
sr: 위쪽

# LogicalOpDistinct
source: Distinct
sr: 고유

# LogicalOpFlowDistinct
source: Flow Distinct
sr: 흐름 고유

# LogicalOpPartialAggregate
source: Partial Aggregate
sr: 부분 집계

# LogicalOpInnerApply
source: Inner Apply
sr: 내부 적용

# LogicalOpInnerJoin
source: Inner Join
sr: 내부 조인

# LogicalOpLeftAntiSemiApply
source: Left Anti Semi Apply
sr: 왼쪽 우선 안티 세미 적용

# LogicalOpLeftSemiApply
source: Left Semi Apply
sr: 왼쪽 세미 적용

# LogicalOpLeftOuterApply
source: Left Outer Apply
sr: 왼쪽 우선 외부 적용

# LogicalOpLeftOuterJoin
source: Left Outer Join
sr: 왼쪽 우선 외부 조인

# LogicalOpRightOuterJoin
source: Right Outer Join
sr: 오른쪽 우선 외부 조인

# LogicalOpFullOuterJoin
source: Full Outer Join
sr: 완전 외부 조인

# LogicalOpLeftSemiJoin
source: Left Semi Join
sr: 왼쪽 세미 조인

# LogicalOpRightSemiJoin
source: Right Semi Join
sr: 오른쪽 세미 조인

# LogicalOpIntersect
source: Intersect
sr: 교차

# LogicalOpIntersectAll
source: Intersect All
sr: 모두 교차

# LogicalOpUnion
source: Union
sr: 공용 구조체

# LogicalOpLeftDiff
source: Left Diff
sr: 왼쪽 차이

# LogicalOpLeftDiffAll
source: Left Diff All
sr: 모두 왼쪽 차이

# LogicalOpRightDiff
source: Right Diff
sr: 오른쪽 차이

# LogicalOpRightDiffAll
source: Right Diff All
sr: 모두 오른쪽 차이

# LogicalOpAntiDiff
source: Anti Diff
sr: 차이 방지

# LogicalOpCrossJoin
source: Cross Join
sr: 크로스 조인

# LogicalOpBitmapCreate
source: Bitmap Create
sr: 비트맵 만들기

# LogicalOpWindow
source: Window Spool
sr: 창 스풀

# LogicalOpSwitch
source: Switch
sr: 전환

# LogicalOpMergeStats
source: Merge Stats
sr: 통계 병합

# LogicalOpLocalStats
source: Local Stats
sr: 로컬 통계

# LogicalOpTableValuedFunction
source: Table Valued Function
sr: 테이블 반환 함수

# LogicalOpBatchHashTableBuild
source: Batch Hash Table Build
sr: 일괄 처리 해시 테이블 작성

# LogicalOpForeignKeyReferencesCheck
source: Foreign Key References Check
sr: 외래 키 참조 확인

# LogicalOpRIDLookup
source: RID Lookup
sr: RID 조회

# StoredProc
source: Stored Procedure
sr: 저장 프로시저

# ProcName
source: Procedure Name
sr: 프로시저 이름

source: Storage
sr: 저장소

# StorageDesc
source: Storage
sr: 저장소

# ActualExecMode
source: Actual Execution Mode
sr: 실제 실행 모드

# ActualExecModeDesc
source: Actual Execution Mode
sr: 실제 실행 모드

# EstimatedExecMode
source: Estimated Execution Mode
sr: 예상 실행 모드

# EstimatedExecModeDesc
source: Estimated Execution Mode
sr: 예상 실행 모드

# CostFormat
source: Cost: {0} %
sr: 비용: {0}%

source: Remote Data Access
sr: 원격 데이터 액세스

# RemoteDataAccessDescription
source: Whether the operator uses remote procedure call (RPC) to access remote data.
sr: 운영자가 RPC(원격 프로시저 호출)를 사용하여 원격 데이터에 액세스하는지 여부를 나타냅니다.

source: Clone Access Scope
sr: 복제본 액세스 범위

# CloneAccessScopeDescription
source: Clones that the operator may access.
sr: 운영자가 액세스할 수 있는 복제본입니다.

source: Primary Clones
sr: 주 복제본

source: Secondary Clones
sr: 보조 복제본

# BothClones
source: All Clones
sr: 모든 복제본

# EitherClones
source: Primary Or Secondary Clones
sr: 주 복제본 또는 보조 복제본

# ExactMatchClones
source: Single Clone Match
sr: 단일 복제본 일치

source: Remoting
sr: 원격

# RemotingDescription
source: Whether the operator can run remotely.
sr: 운영자가 원격으로 실행 가능한지 여부를 나타냅니다.

source: Activation
sr: 활성화

source: Brick Routing
sr: 브릭 라우팅

source: Fragment Id Column
sr: 조각 Id 열

# EditQueryText
source: Edit Query Text from Showplan XML (possibly truncated)
sr: 실행 계획 XML(잘릴 수 있음)에서 쿼리 텍스트 편집

# UnknownShowPlanSource
source: Execution plan source type can not be recognized.
sr: 실행 계획 원본 유형을 인식할 수 없습니다.

# SavePlanFilter
source: Sql Plan files (*.SqlPlan)|*.SqlPlan|All files (*.*)|*.*
sr: SQL 계획 파일 (*.SqlPlan)|*.SqlPlan|모든 파일 (*.*)|*.*

# NoXmlPlanData
source: Plan data is not available in XML format. Only plans from SQL Server Yukon can be saved.
sr: XML 형식에서는 계획 데이터를 사용할 수 없습니다. SQL Server 2005의 계획만 저장할 수 있습니다.

# PerThreadCounterDescription
source: Per-thread counter information.
sr: 스레드 단위 카운터 정보입니다.

# RuntimeCounterThread
source: Thread {0}
sr: 스레드 {0}

# RuntimeCounterThreadOnInstance
source: Thread {0} on Instance {1}
sr: 인스턴스 {1}의 스레드 {0}

# RuntimeCounterThreadAll
source: All threads
sr: 모든 스레드

# ConnectionPropertiesLabel
source: View connection properties
sr: 연결 속성 보기

source: Unknown assign type.
sr: 알 수 없는 할당 유형입니다.

# ZoomLevelShouldBeBetween
source: Zoom level must be an integer value between {0} and {1}.
sr: 확대/축소 수준은 {0}에서 {1} 사이의 정수여야 합니다.

source: Unknown node type.
sr: 알 수 없는 노드 유형입니다.

# UnknownCursorPlanOperation
source: Unknown cursor plan operation '{0}'.
sr: 알 수 없는 커서 계획 작업 '{0}'입니다.

# UnknownStatementType
source: Statement type is not recognized.
sr: 문 유형을 인식할 수 없습니다.

# RollupInfo
source: Rollup Information
sr: 롤업 정보

# RollupInfoDescription
source: Rollup information.
sr: 롤업 정보입니다.

source: Highest Level
sr: 가장 높은 수준

# HighestLevelDescription
source: The highest level of grouping attributes computed in this rollup.
sr: 이 롤업에서 계산되는 그룹화 특성의 가장 높은 수준입니다.

# RollupLevel
source: Rollup Levels
sr: 롤업 수준

# RollupLevelDescription
source: All levels of grouping attributes computed in this rollup.
sr: 이 롤업에서 계산되는 그룹화 특성의 모든 수준입니다.

source: Level
sr: 수준

# LevelDescription
source: A level of grouping attributes computed in this rollup.
sr: 이 롤업에서 계산되는 그룹화 특성의 수준입니다.

source: Remote Query
sr: 원격 쿼리

# RemoteQueryDescription
source: Send a SQL query to another than the current SQL Server.
sr: 현재 SQL Server가 아닌 다른 서버로 SQL 쿼리를 보냅니다.

source: Compute Scalar
sr: 스칼라 컴퓨팅

source: Merge Interval
sr: 병합 간격

source: Print
sr: 인쇄

source: Segment
sr: 세그먼트

source: Split
sr: 분할됨

source: Batch Hash Table Build
sr: 일괄 처리 해시 테이블 작성

source: Collapse
sr: 축소

source: Table Spool
sr: 테이블 스풀

source: Repartition Streams
sr: 스트림 다시 분할

source: Assert
sr: 어설션

source: Sort
sr: 정렬

source: Top
sr: 위쪽

source: Sequence Project
sr: 시퀀스 프로젝트

source: Spool
sr: 스풀

# Window
source: Window Spool
sr: 창 스풀

source: Parallelism
sr: 병렬 처리

source: Row Count Spool
sr: 행 개수 스풀

source: Unknown
sr: 알 수 없음

# UnknownDescription
source: Unknown operator.
sr: 알 수 없는 연산자입니다.

source: Result
sr: 결과

# ResultDescription
source: Result.
sr: 결과입니다.

# CollapseDescription
source: Groups an insert and delete on the same value into an update within wide update plans.
sr: 같은 값의 삽입 및 삭제를 광범위한 업데이트 계획 내의 업데이트로 그룹화합니다.

source: Concatenation
sr: 연결

# ConcatenationDescription
source: Append multiple input tables to form the output table.
sr: 여러 입력 테이블을 추가하여 출력 테이블을 구성합니다.

source: Constant Scan
sr: 상수 검사

# ConstantScanDescription
source: Scan an internal table of constants.
sr: 내부 상수 테이블을 검색합니다.

# ParallelismDescription
source: An operation involving parallelism.
sr: 병렬 처리와 관련된 연산입니다.

source: Put
sr: 넣기

# PutDescription
source: Export the rows from a local or external table to an external table.
sr: 로컬 테이블 또는 외부 테이블의 행을 외부 테이블로 내보냅니다.

source: Distribute Streams
sr: 스트림 분산

# DistributeStreamsDescription
source: Distribute streams.
sr: 스트림을 배포합니다.

source: Gather Streams
sr: 스트림 수집

# GatherStreamsDescription
source: Gather streams.
sr: 스트림을 수집합니다.

# RepartitionStreamsDescription
source: Repartition streams.
sr: 스트림을 다시 분할합니다.

source: Eager Spool
sr: 즉시 스풀

# EagerSpoolDescription
source: Eager Spool.
sr: 즉시 스풀입니다.

source: Lazy Spool
sr: 지연 스풀

# LazySpoolDescription
source: Lazy Spool.
sr: 지연 스풀입니다.

source: Filter
sr: 필터

# FilterDescription
source: Restricting the set of rows based on a predicate.
sr: 조건자를 기준으로 행 집합을 제한합니다.

# AssertDescription
source: Used to verify that a specified condition exists.
sr: 지정한 조건이 있는지 확인하는 데 사용됩니다.

source: Hash Match
sr: 해시 일치
