Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# objectType_login_singular
source: Login
sr: ログイン

# objectType_functionInline_plural
source: Inline functions
sr: インライン関数

# objectType_user_plural
source: Users
sr: ユーザー

# objectType_externalDataSource_plural
source: External Data Sources
sr: 外部データ ソース

# objectType_functionScalar_plural
source: Scalar functions
sr: スカラー関数

# objectType_table_plural
source: Tables
sr: テーブル

# objectType_credential_plural
source: Credentials
sr: 資格情報

# objectType_schema_singular
source: Schema
sr: スキーマ

# objectType_userDefinedTableType_plural
source: User-defined table types
sr: ユーザー定義テーブル型

# objectType_securityPolicy_plural
source: Security Policies
sr: セキュリティ ポリシー

# objectType_xmlSchemaCollection_plural
source: XML schema collections
sr: XML スキーマ コレクション

# objectType_extendedStoredProcedure_plural
source: Extended stored procedures
sr: 拡張ストアド プロシージャ

# objectType_asymmetricKey_singular
source: Asymmetric key
sr: 非対称キー

# objectType_default_singular
source: Default
sr: 既定

# autogrowth_dialog_title
source: Change Autogrowth for {0}
sr: {0} の自動拡張を変更

# autogrowth_dialog_filestreamtitle
source: Change Maxsize for {0}
sr: {0} の最大サイズの変更

# autogrowth_dialog_defaulttitle
source: Change Autogrowth
sr: 自動拡張の変更

# autogrowth_dialog_defaultfilestreamtitle
source: Change Maxsize
sr: 最大サイズの変更

# createDatabase_title
source: New Database
sr: 新しいデータベース

# error_60compatibility
source: Database properties cannot be set or viewed for databases in 6.0 or 6.5 compatibility mode.
sr: 6.0 または 6.5 互換性モードのデータベースの場合、データベースのプロパティを設定または表示できません。

# error_cantModifyExistingFilePath
source: You cannot modify the path for existing database files.
sr: 既存のデータベース ファイルのパスは変更できません。

# error_databaseAlreadyExists
source: There is already a database named "{0}" on the server.
sr: "{0}" という名前のデータベースは既にサーバーに存在します。

# error_databaseProperties_title
source: Database Properties
sr: データベースのプロパティ

# error_emptyFileName
source: File name was empty. Provide a file name for the file.
sr: ファイル名が空です。ファイルの名前を指定してください。

# error_fileNameContainsIllegalCharacter
source: Cannot create a file with name '{0}' because it contains the invalid character '{1}'.
sr: '{0}' には無効な文字 '{1}' が含まれているので、この名前のファイルを作成できません。

# error_fileNameStartsWithSpace
source: Cannot create a file with name '{0}' because it begins with a space character.
sr: '{0}' は先頭が空白文字なので、この名前のファイルを作成できません。

# error_whitespaceDatabaseName
source: A database name cannot consist of all whitespace characters.
sr: データベース名をすべて空白文字で構成することはできません。

# filegroup_dialog_defaultFilegroup
source: Current default filegroup: {0}
sr: 現在の既定のファイル グループ: {0}

# filegroup_dialog_title
source: New Filegroup for {0}
sr: {0} の新しいファイル グループ

# filegroups_default
source: Default
sr: 既定

# filegroups_files
source: Files
sr: ファイル

# filegroups_name
source: Name
sr: 名前

# filegroups_readonly
source: Read-Only
sr: 読み取り専用

# filegroups_autogrowAllFiles
source: Autogrow All Files
sr: すべてのファイルを自動拡張

# general_autogrowth
source: Autogrowth / Maxsize
sr: 自動拡張 / 最大サイズ

# general_fileGroup
source: Filegroup
sr: ファイル グループ

# general_fileName
source: Logical Name
sr: 論理名

# general_fileType
source: File Type
sr: ファイルの種類

# general_initialSize
source: Initial Size (MB)
sr: 初期サイズ (MB)

# general_currentSize
source: Size (MB)
sr: サイズ (MB)

# general_path
source: Path
sr: パス

# general_physicalFileName
source: File Name
sr: ファイル名

# general_recoveryModel_bulkLogged
source: Bulk-logged
sr: 一括ログ

# general_recoveryModel_full
source: Full
sr: 完全

# general_titleSearchOwner
source: Select Database Owner
sr: データベース所有者の選択

# leftPane_extendedPropertiesNode_name
source: Extended Properties
sr: 拡張プロパティ

# leftPane_filegroupsNode_name
source: Filegroups
sr: ファイル グループ

# leftPane_generalNode_name
source: General
sr: 全般

# leftPane_optionsNode_name
source: Options
sr: オプション

# leftPane_capabilitiesNode_name
source: Configure SLO
sr: SLO の構成

# leftPane_topNode_name
source: New Database
sr: 新しいデータベース

# prototype_autogrowth_disabled
source: None
sr: なし

# prototype_autogrowth_restrictedGrowthByMB
source: By {0} MB, Limited to {1} MB
sr: {0} MB 単位で {1} MB に制限

# prototype_autogrowth_restrictedGrowthByPercent
source: By {0} percent, Limited to {1} MB
sr: {0} % 単位で {1} MB に制限

# prototype_autogrowth_unrestrictedGrowthByMB
source: By {0} MB, Unlimited
sr: {0} MB 単位で無制限

# prototype_autogrowth_unrestrictedGrowthByPercent
source: By {0} percent, Unlimited
sr: {0} % 単位で無制限

# prototype_autogrowth_unlimitedfilestream
source: Unlimited
sr: 無制限

# prototype_autogrowth_limitedfilestream
source: Limited to {0} MB
sr: {0} MB に制限

# prototype_db_category_automatic
source: Automatic
sr: 自動

# prototype_db_category_collation
source: Collation
sr: 照合順序

# prototype_db_category_cursor
source: Cursor
sr: カーソル

# prototype_db_category_misc
source: Miscellaneous
sr: その他

# prototype_db_category_recovery
source: Recovery
sr: 復元

# prototype_db_category_state
source: State
sr: 状態

# prototype_db_prop_ansiNullDefault
source: ANSI NULL Default
sr: ANSI NULL 既定値

# prototype_db_prop_ansiNulls
source: ANSI NULLS Enabled
sr: ANSI NULL 有効

# prototype_db_prop_ansiPadding
source: ANSI Padding Enabled
sr: ANSI PADDING 有効

# prototype_db_prop_ansiWarnings
source: ANSI Warnings Enabled
sr: ANSI 警告有効

# prototype_db_prop_arithabort
source: Arithmetic Abort Enabled
sr: 算術アボート有効

# prototype_db_prop_autoClose
source: Auto Close
sr: 自動終了

# prototype_db_prop_autoCreateStatistics
source: Auto Create Statistics
sr: 統計の自動作成

# prototype_db_prop_autoShrink
source: Auto Shrink
sr: 自動圧縮

# prototype_db_prop_autoUpdateStatistics
source: Auto Update Statistics
sr: 統計の自動更新

# prototype_db_prop_autoUpdateStatisticsAsync
source: Auto Update Statistics Asynchronously
sr: 統計の非同期的自動更新

# prototype_db_prop_caseSensitive
source: Case Sensitive
sr: 大文字と小文字を区別

# prototype_db_prop_closeCursorOnCommit
source: Close Cursor on Commit Enabled
sr: コミットでカーソルを閉じる

# prototype_db_prop_collation
source: Collation
sr: 照合順序

# prototype_db_prop_concatNullYieldsNull
source: Concatenate Null Yields Null
sr: NULL との連結で NULL を使用

# prototype_db_prop_databaseCompatibilityLevel
source: Database Compatibility Level
sr: データベース互換レベル

# prototype_db_prop_databaseState
source: Database State
sr: データベース状態

# prototype_db_prop_defaultCursor
source: Default Cursor
sr: 既定のカーソル

# prototype_db_prop_fullTextIndexing
source: Full-Text Indexing Enabled
sr: フルテキスト インデックス有効

# prototype_db_prop_numericRoundAbort
source: Numeric Round-Abort
sr: 数値丸め処理アボート

# prototype_db_prop_quotedIdentifier
source: Quoted Identifiers Enabled
sr: 引用符で囲まれた識別子有効

# prototype_db_prop_readOnly
source: Database Read-Only
sr: 読み取り専用データベース

# prototype_db_prop_recursiveTriggers
source: Recursive Triggers Enabled
sr: 再帰トリガー有効

# prototype_db_prop_restrictAccess
source: Restrict Access
sr: アクセスの制限

# prototype_db_prop_selectIntoBulkCopy
source: Select Into/Bulk Copy
sr: Select Into/一括コピー

# prototype_db_prop_honorBrokerPriority
source: Honor Broker Priority
sr: Broker の優先度の許可

# prototype_db_prop_serviceBrokerGuid
source: Service Broker Identifier
sr: Service Broker 識別子

# prototype_db_prop_brokerEnabled
source: Broker Enabled
sr: Broker が有効

# prototype_db_prop_truncateLogOnCheckpoint
source: Truncate Log on Checkpoint
sr: チェックポイント時のログ切り捨て

# prototype_db_prop_dbChaining
source: Cross-database Ownership Chaining Enabled
sr: 複数データベースのチェーン所有権有効

# prototype_db_prop_trustworthy
source: Trustworthy
sr: 信頼可能

# prototype_db_prop_dateCorrelationOptimization
source: Date Correlation Optimization Enabled
sr: 日付の相関関係の最適化有効

# prototype_db_prop_parameterization
source: Parameterization
sr: パラメーター化

# prototype_db_prop_parameterization_value_forced
source: Forced
sr: 強制

# prototype_file_dataFile
source: ROWS Data
sr: 行データ

# prototype_file_logFile
source: LOG
sr: ログ

# prototype_file_filestreamFile
source: FILESTREAM Data
sr: FILESTREAM データ

# prototype_file_noFileGroup
source: Not Applicable
sr: 適用なし

# title_openConnectionsMustBeClosed
source: Open Connections
sr: 接続を開く

# warning_openConnectionsMustBeClosed
source: To change the database properties, SQL Server must close all other connections to the database. Are you sure you want to change the properties and close all other connections?
sr: データベースのプロパティを変更するには、SQL Server では他の接続をすべて閉じる必要があります。他のすべての接続を閉じて、プロパティを変更しますか?

# prototype_db_prop_databaseState_value_inaccessible
source: INACCESSIBLE
sr: アクセス不可

# prototype_db_prop_varDecimalEnabled
source: VarDecimal Storage Format Enabled
sr: VarDecimal ストレージ形式有効

# prototype_db_prop_encryptionEnabled
source: Encryption Enabled
sr: 暗号化が有効

# prototype_db_prop_databasescopedconfig_value_off
source: OFF
sr: オフ

# prototype_db_prop_databasescopedconfig_value_on
source: ON
sr: オン

# error_db_prop_invalidleadingColumns
source: For the distribution policy HASH, the number of leading hash columns is optional but should be from 1 to 16 columns
sr: ディストリビューション ポリシーが HASH の場合、先頭のハッシュ列の数は任意ですが、1 ～ 16 の範囲で指定する必要があります

# general_containmentType_None
source: None
sr: なし

# general_containmentType_Partial
source: Partial
sr: 部分的

# filegroups_filestreamFiles
source: FILESTREAM Files
sr: FILESTREAM ファイル

# prototype_file_noApplicableFileGroup
source: No Applicable Filegroup
sr: 適用できるファイル グループなし

# ErrorInvalidEdition
source: Edition value is not valid
sr: エディション値が無効です

# databaseBackupDate_None
source: None
sr: なし

# PropertyNotInitialized
source: Property '{0}' was set before initialization.
sr: プロパティ '{0}' が初期化前に設定されました。

# WritingServerContextualizationToCacheError
source: An error was encountered while writing server contextualization scripts to the cache. Error: {0}
sr: サーバー コンテキスト化スクリプトをキャッシュに書き込み中にエラーが発生しました。エラー： {0}

source: Failed to generate server contextualization scripts
sr: サーバー コンテキスト化スクリプトを生成できませんでした

source: Failed to find connection info about the server
sr: サーバーに関する接続情報が見つかりませんでした

# querystorecapturemode_all
source: All
sr: すべて

# querystorecapturemode_auto
source: Auto
sr: 自動

# querystorecapturemode_none
source: None
sr: なし

# querystorecapturemode_custom
source: Custom
sr: カスタム

# queryStoreSizeBasedCleanupMode_Off
source: Off
sr: オフ

# queryStoreSizeBasedCleanupMode_Auto
source: Auto
sr: 自動

# statisticsCollectionInterval_OneMinute
source: 1 Minute
sr: 1 分

# statisticsCollectionInterval_FiveMinutes
source: 5 Minutes
sr: 5 分

# statisticsCollectionInterval_TenMinutes
source: 10 Minutes
sr: 10 分

# statisticsCollectionInterval_FifteenMinutes
source: 15 Minutes
sr: 15 分

# statisticsCollectionInterval_ThirtyMinutes
source: 30 Minutes
sr: 30 分

# statisticsCollectionInterval_OneHour
source: 1 Hour
sr: 1 時間

# statisticsCollectionInterval_OneDay
source: 1 Day
sr: 1 日

# queryStore_stale_threshold_OneHour
source: 1 Hour
sr: 1 時間

# queryStore_stale_threshold_FourHours
source: 4 Hours
sr: 4 時間

# queryStore_stale_threshold_EightHours
source: 8 Hours
sr: 8 時間

# queryStore_stale_threshold_TwelveHours
source: 12 Hours
sr: 12 時間

# queryStore_stale_threshold_OneDay
source: 1 Day
sr: 1 日

# queryStore_stale_threshold_ThreeDays
source: 3 Days
sr: 3 日

# queryStore_stale_threshold_SevenDays
source: 7 Days
sr: 7 日

# InvalidDspFormatError
source: Invalid value for Database Schema Provider: '{0}'; expected to be in the form 'Microsoft.Data.Tools.Schema.Sql.SqlAzureV12DatabaseSchemaProvider'.
sr: データベース スキーマ プロバイダー '{0}' の値が無効です。'Microsoft.Data.Tools.Schema.Sql.SqlAzureV12DatabaseSchemaProvider' の形式である必要があります。
