Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# SchemaHierarchy_ColumnSetLabelWithTypeAndKeyString
source: {0} (Column Set, {1}, {2}, {3})
sr: {0}(열 집합, {1}, {2}, {3})

# UniqueIndex_LabelPart
source: Unique
sr: 고유

# NonUniqueIndex_LabelPart
source: Non-Unique
sr: 고유하지 않음

# ClusteredIndex_LabelPart
source: Clustered
sr: 클러스터형

# NonClusteredIndex_LabelPart
source: Non-Clustered
sr: 비 클러스터형

# History_LabelPart
source: History
sr: 기록

# SystemVersioned_LabelPart
source: System-Versioned
sr: 시스템 버전 관리

# DatabaseNotAccessible
source: The database {0} is not accessible.
sr: 데이터베이스 {0}에 액세스할 수 없습니다.

# QueryServiceResultSetHasNoResults
source: Query has no results to return
sr: 쿼리 반환 결과가 없습니다.

# QueryServiceResultSetTooLarge
source: Result set has too many rows to be safely loaded
sr: 결과 집합의 행 수가 너무 많아서 안전하게 로드할 수 없습니다.

# ConflictWithNoRecovery
source: Specifying this option when restoring a backup with the NORECOVERY option is not permitted.
sr: NORECOVERY 옵션을 사용하여 백업을 복원하는 동안 이 옵션을 지정할 수 없습니다.

# InvalidPathForDatabaseFile
source: Invalid path for database file: '{0}'
sr: 데이터베이스 파일의 경로가 잘못되었습니다. '{0}'

source: Log
sr: 로그

# RestorePlanFailed
source: Failed to create restore plan
sr: 복원 계획을 만들지 못했습니다.

# RestoreNotSupported
source: Restore database is not supported
sr: 데이터베이스 복원은 지원되지 않습니다.

# RestoreTaskName
source: Restore Database
sr: 데이터베이스 복원

# RestoreCopyOnly
source: (Copy Only)
sr: (복사 전용)

# RestoreBackupSetComponent
source: Component
sr: 구성 요소

# RestoreBackupSetType
source: Type
sr: 형식

# RestoreBackupSetServer
source: Server
sr: 서버

# RestoreBackupSetDatabase
source: Database
sr: 데이터베이스

# RestoreBackupSetPosition
source: Position
sr: 위치

# RestoreBackupSetFirstLsn
source: First LSN
sr: 첫 번째 LSN

# RestoreBackupSetLastLsn
source: Last LSN
sr: 마지막 LSN

# RestoreBackupSetCheckpointLsn
source: Checkpoint LSN
sr: 검사점 LSN

# RestoreBackupSetFullLsn
source: Full LSN
sr: 전체 LSN

# RestoreBackupSetStartDate
source: Start Date
sr: 시작 날짜

# RestoreBackupSetFinishDate
source: Finish Date
sr: 완료 날짜

# RestoreBackupSetSize
source: Size
sr: 크기

# RestoreBackupSetUserName
source: User Name
sr: 사용자 이름

# RestoreBackupSetExpiration
source: Expiration
sr: 만료

# RestoreBackupSetName
source: Name
sr: 이름

# TheLastBackupTaken
source: The last backup taken ({0})
sr: 마지막으로 수행한 백업({0})

# BackupTaskName
source: Backup Database
sr: 데이터베이스 백업

# TaskInProgress
source: In progress
sr: 진행 중

# TaskCompleted
source: Completed
sr: 완료됨

# ScriptTaskName
source: scripting
sr: 스크립팅

# ProfilerConnectionNotFound
source: Connection not found
sr: 연결을 찾을 수 없음

# AzureSystemDbProfilingError
source: Cannot profile Azure system databases
sr: Azure 시스템 데이터베이스를 프로파일링할 수 없습니다.

# BackupPathIsFolderError
source: Please provide a file path instead of directory path
sr: 디렉터리 경로 대신 파일 경로를 지정하세요.

# InvalidBackupPathError
source: The provided path is invalid
sr: 제공된 경로는 유효하지 않습니다.

# InvalidPathError
source: Cannot access the specified path on the server: {0}
sr: 서버의 지정된 경로에 액세스할 수 없습니다. {0}

# NoBackupsetsToRestore
source: No backupset selected to be restored
sr: 복원할 백업 세트를 선택하지 않음

# AzureSqlAnalyticsOnDemandEdition
source: Azure SQL Analytics on-demand
sr: 주문형 Azure SQL 분석

# EditDataValueTooLarge
source: Value {0} is too large to fit in column of type {1}
sr: 값 {0}이(가) 너무 커서 {1} 유형의 열에 맞지 않습니다.

# EditDataInvalidFormat
source: Invalid format for column '{0}', column is defined as {1}
sr: 열 '{0}'에 서식이 잘못되었습니다. 열은 {1}(으)로 정의됩니다.

# SqlScriptFormatterLengthTypeMissingSize
source: Column with length is missing size
sr: 길이가 있는 열의 크기가 누락되었습니다.

# SqlScriptFormatterScalarTypeMissingScale
source: Scalar column missing scale
sr: 스칼라 열에 배율 누락

# StoredProcedureScriptParameterComment
source: -- TODO: Set parameter values here.
sr: -- TODO: 여기에서 매개 변수 값을 설정합니다.

# ScriptingGeneralError
source: An error occurred while scripting the objects.
sr: 개체를 스크립팅하는 동안 오류가 발생했습니다.

# ScriptingExecuteNotSupportedError
source: Scripting as Execute is only supported for Stored Procedures
sr: 저장 프로시저에만 실행으로 스크립팅할 수 있습니다.

# External_LabelPart
source: External
sr: 외부

# FileTable_LabelPart
source: File Table
sr: 파일 테이블

# EditDataMultiTableNotSupported
source: EditData queries targeting multiple tables are not supported
sr: 여러 테이블을 대상으로 하는 EditData 쿼리는 지원되지 않습니다.

# EditDataAliasesNotSupported
source: EditData queries with aliased columns are not supported
sr: 별칭이 지정된 열이 있는 EditData 쿼리는 지원되지 않습니다.

# EditDataExpressionsNotSupported
source: EditData queries with aggregate or expression columns are not supported
sr: 집계 또는 식 열이 있는 EditData 쿼리는 지원되지 않습니다.

# EditDataDuplicateColumnsNotSupported
source: EditData queries with duplicate columns are not supported
sr: 중복된 열이 있는 EditData 쿼리는 지원되지 않습니다.

# EditDataIncorrectTable
source: EditData queries must query the originally targeted table '{0}'
sr: EditData 쿼리는 처음에 대상으로 지정된 테이블 '{0}'을(를) 쿼리해야 합니다.

# CategoryLocal
source: [Uncategorized (Local)]
sr: [범주화되지 않음(로컬)]

# CategoryFromMsx
source: Jobs from MSX
sr: MSX의 작업

# CategoryMultiServer
source: [Uncategorized (Multi-Server)]
sr: [범주화되지 않음(다중 서버)]

# CategoryDBMaint
source: Database Maintenance
sr: 데이터베이스 유지 관리

# CategoryWebAssistant
source: Web Assistant
sr: 웹 길잡이

# CategoryFullText
source: Full-Text
sr: 전체 텍스트

# CategoryReplDistribution
source: REPL-Distribution
sr: REPL-배포

# CategoryReplDistributionCleanup
source: REPL-Distribution Cleanup
sr: REPL-배포 정리

# CategoryReplHistoryCleanup
source: REPL-History Cleanup
sr: REPL-기록 정리

# CategoryReplLogReader
source: REPL-LogReader
sr: REPL-로그 판독기

# CategoryReplMerge
source: REPL-Merge
sr: REPL-병합

# CategoryReplSnapShot
source: REPL-Snapshot
sr: REPL-스냅샷

# CategoryReplCheckup
source: REPL-Checkup
sr: REPL-점검

# CategoryReplCleanup
source: REPL-Subscription Cleanup
sr: REPL-구독 정리

# CategoryReplAlert
source: REPL-Alert Response
sr: REPL-경고 응답

# CategoryReplQReader
source: REPL-QueueReader
sr: REPL-큐 판독기

# CategoryReplication
source: Replication
sr: 복제

# CategoryUncategorized
source: [Uncategorized]
sr: [범주화되지 않음]

# CategoryLogShipping
source: Log Shipping
sr: 로그 전달

# CategoryDBEngineTuningAdvisor
source: Database Engine Tuning Advisor
sr: 데이터베이스 엔진 튜닝 관리자

# CategoryDataCollector
source: Data Collector
sr: 데이터 수집기

# JobAlreadyExists
source: A job named '{0}' already exists. Enter a unique name for the job.
sr: 이름이 '{0}'인 작업이 이미 있습니다. 작업의 고유한 이름을 입력하세요.

# JobStepNameCannotBeBlank
source: The name of the job step cannot be blank.
sr: 작업 단계 이름을 비워 둘 수 없습니다.

# JobStepNameAlreadyExists
source: There is already a step named '{0}' for this job. You must specify a different name.
sr: 이 작업에 대해 이름이 '{0}'인 단계가 이미 있습니다. 다른 이름을 지정해야 합니다.

# AlertNameCannotBeBlank
source: The name of the alert cannot be blank.
sr: 경고 이름을 비워 둘 수 없습니다.

source: Cannot create new alert.
sr: 새 경고를 만들 수 없습니다.

source: Cannot alter alert.
sr: 경고를 변경할 수 없습니다.

# SysadminAccount
source: SQL Server Agent Service Account
sr: SQL Server 에이전트 서비스 계정

# ProxyAccountNotFound
source: Proxy account '{0}' does not exist on the server.
sr: 프록시 계정 '{0}'이(가) 서버에 없습니다.

# CredentialNoLongerExists
source: The object does no longer exist on server.
sr: 해당 개체가 서버에 더 이상 없습니다.

# UnknownServerType
source: Unknown server type '{0}'.
sr: 알 수 없는 서버 유형 '{0}'입니다.

# SetOwnerFailed
source: The current login does not have permissions to set the database owner to '{0}' The database was created successfully however.
sr: 현재 로그인에는 데이터베이스 소유자를 '{0}'(으)로 설정할 권한이 없지만 데이터베이스는 생성되었습니다.

# TargetServerNotSelected
source: You must specify the Target Servers on which this multi server job will execute.
sr: 이 다중 서버 작업을 실행할 대상 서버를 지정해야 합니다.

source: Unexpected run type.
sr: 예기치 않은 실행 유형입니다.

# UnknownSizeUnit
source: Unknown size unit {0}
sr: 알 수 없는 크기 단위 {0}

# SessionNotFound
source: Cannot find requested XEvent session
sr: 요청된 XEvent 세션을 찾을 수 없습니다.

# StopSessionFailed
source: Failed to stop session: {0}
sr: 세션을 중지하지 못함 {0}

# StartSessionFailed
source: Failed to start session: {0}
sr: 세션을 시작하지 못함 {0}

# CreateSessionFailed
source: Failed to create session: {0}
sr: 세션을 생성하지 못함 {0}

# PauseSessionFailed
source: Failed to pause session: {0}
sr: 세션을 일시 중지하지 못함 {0}

# SessionAlreadyExists
source: An XEvent session named {0} already exists
sr: 이름이 {0}인 XEvent 세션이 이미 있습니다.

# InvalidScheduleTitle
source: Invalid Schedule
sr: 잘못된 일정

# InvalidWeeklySchedule
source: Select at least one day to be part of this weekly schedule.
sr: 이 주별 일정에 포함할 요일을 하나 이상 선택하세요.

# StartDateGreaterThanEndDate
source: The job schedule starting date cannot be greater than the ending date.
sr: 작업 일정 시작 날짜는 종료 날짜 이후일 수 없습니다.

# StartTimeGreaterThanEndTime
source: The job schedule starting time cannot be after the ending time.
sr: 작업 일정 시작 시간은 종료 시간 이후일 수 없습니다.

# EndTimeEqualToStartTime
source: The job schedule ending time must be after the starting time.
sr: 작업 일정 종료 시간은 시작 시간 이후여야 합니다.

# InvalidStartDate
source: Start date must be on or after January 1, 1990.
sr: 시작 날짜는 1990년 1월 1일 이후여야 합니다.

# ScheduleNameAlreadyExists
source: There is already a schedule named '{0}' for this job. You must specify a different name.
sr: 이 작업에 대해 이름이 '{0}'인 일정이 이미 있습니다. 다른 이름을 지정해야 합니다.

source: Job server is not available
sr: 작업 서버를 사용할 수 없습니다.

# NeverBackedUp
source: Never
sr: 안 함

# Error_InvalidDirectoryName
source: Path {0} is not a valid directory
sr: 경로 {0}은(는) 유효한 디렉터리가 아닙니다.

# Error_ExistingDirectoryName
source: For directory {0} a file with name {1} already exist
sr: 디렉터리 {0}에 이름이 {1}인 파일이 이미 있습니다.

# EE_ExecutionInfo_InitializingLoop
source: Beginning execution loop
sr: 실행 루프 시작

# EE_BatchExecutionError_Ignoring
source: An error occurred while the batch was being executed, but the error has been ignored.
sr: 일괄 처리를 실행하는 동안 오류가 발생했지만 무시되었습니다.

# EE_ExecutionInfo_FinalizingLoop
source: Batch execution completed {0} times...
sr: 일괄 처리 실행이 {0}번 완료되었습니다.

# BatchParserWrapperExecutionError
source: Batch parser wrapper execution: {0} found... at line {1}: {2} Description: {3}
sr: 일괄 처리 파서 래퍼 실행: {0} 찾음... 줄 {1}: {2} 설명: {3}

# ExtractInvalidVersion
source: Invalid version '{0}' passed. Version must be in the format x.x.x.x where x is a number.
sr: 잘못된 버전 '{0}'이(가) 제공되었습니다. 버전은 x.x.x.x 형식이어야 하며 여기서 x는 숫자입니다.

# ExportBacpacTaskName
source: Export bacpac
sr: bacpac 내보내기

# ImportBacpacTaskName
source: Import bacpac
sr: bacpac 가져오기

# ExtractDacpacTaskName
source: Extract dacpac
sr: dacpac 추출

# DeployDacpacTaskName
source: Deploy dacpac
sr: dacpac 배포

# GenerateScriptTaskName
source: Generate script
sr: 스크립트 생성

# PublishChangesTaskName
source: Apply schema compare changes
sr: 스키마 비교 변경 적용

# SchemaCompareExcludeIncludeNodeNotFound
source: Failed to find the specified change in the model
sr: 모델에서 지정된 변경 내용을 찾지 못했습니다.

# OpenScmpConnectionBasedModelParsingError
source: Error encountered while trying to parse connection information for endpoint '{0}' with error message '{1}'
sr: 엔드포인트 '{0}'에 대한 연결 정보를 구문 분석하는 동안 오류가 발생했으며 오류 메시지 '{1}'이(가) 표시되었습니다.

# SchemaCompareSessionNotFound
source: Could not find the schema compare session to cancel
sr: 취소할 스키마 비교 세션을 찾을 수 없습니다.

# SerializationServiceUnsupportedFormat
source: Unsupported Save Format: {0}
sr: 지원되지 않는 저장 형식: {0}

# SerializationServiceRequestInProgress
source: A request for file {0} is already in progress
sr: 파일 {0}에 대한 요청이 이미 진행 중입니다.

# SerializationServiceRequestNotFound
source: Cannot serialize more data as no request for file {0} could be found
sr: 파일 {0}에 대한 요청을 찾을 수 없으므로 추가 데이터를 직렬화할 수 없습니다.

# ConnectionServiceConnStringInvalidColumnEncryptionSetting
source: Invalid value '{0}' for ComlumEncryption. Valid values are 'Enabled' and 'Disabled'.
sr: ComlumEncryption에 대한 '{0}' 값이 잘못되었습니다. 유효한 값은 'Enabled' 및 'Disabled'입니다.

# ConnectionServiceConnStringInvalidEnclaveAttestationProtocol
source: Invalid value '{0}' for EnclaveAttestationProtocol. Valid values are 'AAS' and 'HGS'.
sr: EnclaveAttestationProtocol에 대한 '{0}' 값이 잘못되었습니다. 유효한 값은 'AAS' 및 'HGS'입니다.

# ConnectionServiceConnStringInvalidAlwaysEncryptedOptionCombination
source: The Attestation Protocol and Enclave Attestation URL requires Always Encrypted to be set to Enabled.
sr: 증명 프로토콜 및 enclave 증명 URL을 사용하려면 Always Encrypted를 Enabled(사용)로 설정해야 합니다.

# SqlCmdExitOnError
source: An error was encountered during execution of batch. Exiting.
sr: 일괄 처리를 실행하는 동안 오류가 발생하여 종료합니다.

# SqlCmdUnsupportedToken
source: Encountered unsupported token {0}
sr: 지원되지 않는 {0} 토큰이 발생했습니다.

# SqlAssessmentGenerateScriptTaskName
source: Generate SQL Assessment script
sr: SQL 평가 스크립트 생성

# SqlAssessmentQueryInvalidOwnerUri
source: Not connected to a server
sr: 서버에 연결되지 않음

# SqlAssessmentConnectingError
source: Cannot connect to the server
sr: 서버에 연결할 수 없음

# SqlAssessmentUnsuppoertedEdition
source: Unsupported engine edition {0}
sr: 지원되지 않는 엔진 버전 {0}

# ParameterizationDetails
source: {0} will be converted to a Microsoft.Data.SqlClient.SqlParameter object with the following properties: SqlDbType = {1}, Size = {2}, Precision = {3}, Scale = {4}, SqlValue = {5}
sr: {0}이(가) 다음 속성의 Microsoft.Data.SqlClient.SqlParameter 개체로 변환됩니다. SqlDbType = {1}, 크기 = {2}, 정밀도 = {3}, 배율 = {4}, SqlValue = {5}

# ErrorMessageHeader
source: Line {0}
sr: 줄 {0}

# ErrorMessage
source: Unable to convert {0} to a Microsoft.Data.SqlClient.SqlParameter object. The specified literal cannot be converted to {1}(Microsoft.Data.SqlDbType). Literal value: {2}
sr: {0}을(를) Microsoft.Data.SqlClient.SqlParameter 개체로 변환할 수 없습니다. 지정한 리터럴은 {1}(Microsoft.Data.SqlDbType)(으)로 변환할 수 없습니다. 리터럴 값: {2}

# DateTimeErrorMessage
source: Unable to convert {0} to a Microsoft.Data.SqlClient.SqlParameter object. The specified literal cannot be converted to {1}(Microsoft.Data.SqlDbType), as it used an unsupported date/time format. Use one of the supported date/time formats. Literal value: {2}
sr: {0}을(를) Microsoft.Data.SqlClient.SqlParameter 개체로 변환할 수 없습니다. 지정한 리터럴은 지원되지 않는 날짜/시간 형식이 사용되었기 때문에 {1}(Microsoft.Data.SqlDbType)(으)로 변환할 수 없습니다. 지원되는 날짜/시간 형식 중 하나를 사용하세요. 리터럴 값: {2}

# BinaryLiteralPrefixMissingError
source: Unable to convert {0} to a Microsoft.Data.SqlClient.SqlParameter object. The specified literal cannot be converted to {1}(Microsoft.Data.SqlDbType), as prefix 0x is expected for a binary literals. Literal value: {2}
sr: {0}을(를) Microsoft.Data.SqlClient.SqlParameter 개체로 변환할 수 없습니다. 이진 리터럴에는 접두사 0x가 필요하므로 지정한 리터럴은 {1}(Microsoft.Data.SqlDbType)(으)로 변환할 수 없습니다. 리터럴 값: {2}

# ParsingErrorHeader
source: Line {0}, column {1}
sr: 줄 {0}, 열 {1}

# ScriptTooLarge
source: The current script is too large for Parameterization for Always Encrypted, please disable Parameterization for Always Encrypted in Query Options (Query > Query Options > Execution > Advanced). Maximum allowable length: {0} characters, Current script length: {1} characters
sr: 현재 스크립트는 Always Encrypted의 매개 변수화에 대해 너무 큽니다. 쿼리 옵션([쿼리] > [쿼리 옵션] > [실행] > [고급])에서 Always Encrypted의 매개 변수화를 사용하지 않도록 설정하세요. 최대 허용 길이: {0}자, 현재 스크립트 길이: {1}자

# ProjectExtractTaskName
source: Extract project files
sr: 프로젝트 파일 추출

# ValidateStreamingJobTaskName
source: Validate streaming job
sr: 스트리밍 작업 유효성 검사

# StreamNotFoundInModel
source: Streaming query statement contains a reference to missing {0} stream '{1}'. You must add it to the database model.
sr: 스트리밍 쿼리 문에 누락된 {0} 스트림 '{1}'에 대한 참조가 포함되어 있습니다. 데이터베이스 모델에 추가해야 합니다.

source: input
sr: 입력

source: output
sr: 출력

# StreamingJobValidationFailed
source: Validation for external streaming job '{0}' failed:
sr: 외부 스트리밍 작업 '{0}'에 대한 유효성을 검사하지 못함:

# FragmentShouldHaveOnlyOneBatch
source: TSQL fragment should contain exactly one batch.
sr: TSQL 조각에는 배치가 정확하게 하나 포함되어야 합니다.

# NoCreateStreamingJobStatementFound
source: No External Streaming Job creation TSQL found (EXEC sp_create_streaming_job statement).
sr: 외부 스트리밍 작업 만들기 TSQL을 찾을 수 없습니다(EXEC sp_create_streaming_job 문).

# CouldntFindAzureFunction
source: Couldn't find Azure function with FunctionName '{0}' in {1}
sr: {0}에서 FunctionName ‘{1}’인 Azure 함수를 찾을 수 없음

# MoreThanOneAzureFunctionWithName
source: More than one Azure function found with the FunctionName '{0}' in {1}
sr: {0}에서 FunctionName ‘{1}’인 Azure 함수를 두 개 이상 찾음

# SqlBindingsNet5NotSupported
source: Adding SQL bindings is not supported for .NET 5
sr: .NET 5에서는 SQL 바인딩 추가가 지원되지 않습니다.

source: Statement
sr: 문

# StatementDesc
source: In most cases, contains the text of the Transact-SQL statement. For rows of type PLAN_ROW, contains a description of the operation.
sr: 대부분의 경우 Transact-SQL 문의 텍스트를 포함합니다. PLAN_ROW 유형의 행인 경우에는 연산에 대한 설명을 포함합니다.

source: Physical Operation
sr: 물리적 연산

# PhysicalOperationDesc
source: Physical implementation algorithm for the node. For rows of type PLAN_ROWS only.
sr: 노드의 물리적 구현 알고리즘입니다. PLAN_ROWS 유형의 행에만 적용됩니다.

source: Logical Operation
sr: 논리적 연산

# LogicalOperationDesc
source: Relational algebraic operator this node represents. For rows of type PLAN_ROWS only.
sr: 이 노드가 나타내는 관계형 대수 연산자입니다. PLAN_ROWS 유형의 행에만 적용됩니다.

# OperationDescriptionShort
source: Description
sr: 설명

source: Operation description.
sr: 연산 설명입니다.

# OperationArgumentShort
source: Argument
sr: 인수

# OperationArgumentDescription
source: Provides supplemental information about the operation being performed. The contents of this column depend on the physical operator.
sr: 수행할 연산에 대한 보충 정보를 제공합니다. 이 열의 내용은 물리적 연산자에 따라 달라집니다.

# ObjectShort
source: Object
sr: 개체

# ObjectDescription
source: Object.
sr: 개체입니다.

source: Index Kind
sr: 인덱스 종류

# IndexKindDescription
source: Type of index for the referenced object.
sr: 참조된 개체에 대한 인덱스 유형입니다.

source: Defined Values
sr: 정의된 값

# DefinedValuesDescription
source: Contains a comma-separated list of values introduced by this operator, which may be computed expressions present in the current query, or internal values introduced by the query processor in order to process this query. For rows of type PLAN_ROWS only.
sr: 이 연산자에 의해 정의된 값(현재 쿼리에 있는 계산 식이 될 수 있음) 또는 이 쿼리를 처리하기 위해 쿼리 프로세서에서 정의된 내부 값 목록(쉼표로 구분)을 포함합니다. PLAN_ROWS 유형의 행에만 적용됩니다.

source: Output List
sr: 출력 목록

# OutputListDescription
source: Contains a comma-separated list of columns being projected by the current operation.
sr: 현재 연산에서 예상되는 열 목록(쉼표로 구분)을 포함합니다.

source: Warnings
sr: 경고

# WarningsDescription
source: Contains a comma-separated list of warning messages relating to the current operation. Warning messages may include the string 'NO STATS:()' with a list of columns.
sr: 현재 연산과 관련된 경고 메시지 목록(쉼표로 구분)을 포함합니다. 경고 메시지에는 열 목록과 함께 'NO STATS:()' 문자열이 포함될 수 있습니다.

source: Parallel
sr: 병렬

# ParallelDescription
source: Whether the operator is running in parallel.
sr: 연산자의 병렬 실행 여부를 나타냅니다.

source: Estimated Number of Rows Per Execution
sr: 실행당 예상 행 수

# EstimatedNumberOfRowsPerExecutionDescription
source: Estimated number of rows per execution output by this operator. This is for PLAN_ROWS only.
sr: 이 연산자의 실행 출력당 예상 행 수입니다(PLAN_ROWS만 해당).

source: Estimated Number of Rows for All Executions
sr: 모든 실행에 대한 예상 행 수

# EstimatedNumberOfRowsForAllExecutionsDescription
source: Estimated number of rows for all executions output by this operator. This is for PLAN_ROWS only.
sr: 이 연산자의 모든 실행 출력에 대한 예상 행 수입니다(PLAN_ROWS만 해당).

# EstimatedRowsRead
source: Estimated Number of Rows to be Read
sr: 읽을 것으로 예상되는 행 수

# EstimatedRowsReadDescription
source: Number of rows estimated to be read by this operator. This value may differ from "Estimated Number of Rows for All Executions" if the operator has a predicate.
sr: 이 연산자가 읽을 것으로 예상되는 행 수입니다. 연산자에 조건자가 있는 경우에는 이 값이 "모든 실행에 대한 예상 행 수"와 다를 수 있습니다.

source: Is GraphDB Transitive Closure
sr: GraphDB 전이적 종결임

# IsGraphDBTransitiveClosureDescription
source: Whether the sequence represents a GraphDB transitive closure.
sr: 시퀀스가 GraphDB 전이적 종결을 나타내는지 여부입니다.

# IsInterleavedExecutedDescription
source: Whether the operator is interleaved executed.
sr: 연산자가 인터리브된 실행에 사용되는지 여부입니다.

source: Is Adaptive
sr: 적응형임

# IsAdaptiveDescription
source: Whether the operator is adaptive.
sr: 연산자가 적응형인지 여부입니다.

source: Adaptive Threshold Rows
sr: 적응형 임계값 행 수

# AdaptiveThresholdRowsDescription
source: If this is an adaptive operator, the cardinality at which it adapts.
sr: 적응형 연산자인 경우 이를 통해 조정되는 카디널리티입니다.

source: Estimated Join Type
sr: 예상 조인 유형

# EstimatedJoinTypeDescription
source: The join type (nested loops or hash join) estimated by the query optimizer before adapting.
sr: 쿼리 최적화 프로그램에서 조정 전에 예상하는 조인 유형(중첩된 루프 또는 해시 조인)입니다.

source: Actual Join Type
sr: 실제 조인 유형

# ActualJoinTypeDescription
source: The actual join picked (nested loops or hash join) as part of adaptive join execution.
sr: 적응형 조인 실행의 일부로 선택한 실제 조인(중첩된 루프 또는 해시 조인)입니다.

source: Estimated Row Size
sr: 예상 행 크기

# EstimatedRowSizeDescription
source: Estimated average row size of the row being passed through this operator.
sr: 이 연산자를 통해 전달되는 행의 예상 평균 행 크기입니다.

source: Estimated I/O Cost
sr: 예상 I/O 비용

# EstimatedIoCostDescription
source: Estimated I/O cost for this operator. For rows of type PLAN_ROWS only.
sr: 이 연산자의 예상 I/O 비용입니다. PLAN_ROWS 유형의 행에만 적용됩니다.

source: Estimated CPU Cost
sr: 예상 CPU 비용

# EstimatedCpuCostDescription
source: Estimated CPU cost for this operator. For rows of type PLAN_ROWS only.
sr: 이 연산자의 예상 CPU 비용입니다. PLAN_ROWS 유형의 행에만 적용됩니다.

source: Estimated Number of Executions
sr: 예상 실행 횟수

# EstimatedNumberOfExecutionsDescription
source: Estimated number of times this operator will be executed while running the current query.
sr: 현재 쿼리를 실행하는 동안 이 연산자가 실행될 예상 횟수입니다.

source: Estimated Operator Cost
sr: 예상 연산자 비용

# EstimatedOperatorCostDescription
source: Estimated cost of this operator.
sr: 이 연산자의 예상 비용입니다.

source: Estimated Subtree Cost
sr: 예상 하위 트리 비용

# EstimatedSubtreeCostDescription
source: Estimated cumulative cost of this operation and all child operations.
sr: 이 연산과 모든 자식 연산의 예상 누적 비용입니다.

# NumberOfRows
source: Actual Number of Rows for All Executions
sr: 모든 실행에 대한 실제 행 수

# NumberOfRowsDescription
source: Actual number of rows for All Executions output by this operator. For rows of type PLAN_ROWS only.
sr: 이 연산자의 모든 실행 출력에 대한 실제 행 수입니다(PLAN_ROWS 형식의 행만 해당).

# ActualRowsRead
source: Number of Rows Read
sr: 읽은 행 수

# ActualRowsReadDescription
source: Number of rows read from a table or an index prior to applying a predicate filter. For rows of type PLAN_ROWS only.
sr: 조건자 필터를 적용하기 이전의 테이블 또는 인덱스에서 읽은 행 수입니다. PLAN_ROWS 유형의 행만 해당됩니다.

# NumberOfBatches
source: Actual Number of Batches
sr: 실제 일괄 처리 수

# NumberOfBatchesDescription
source: Actual number of Batches output by this operator.
sr: 이 연산자에서 출력하는 실제 일괄 처리 수입니다.

source: Number of Executions
sr: 실행 횟수

# NumberOfExecutionsDescription
source: Number of times this operator will be executed while running the current query.
sr: 현재 쿼리를 실행하는 동안 이 연산자가 실행될 횟수입니다.

source: Estimated Data Size
sr: 예상 데이터 크기

# EstimatedDataSizeDescription
source: Estimated data size of the data being passed through this operator.
sr: 이 연산자를 통해 전달되는 데이터의 예상 데이터 크기입니다.

source: Parameter List
sr: 매개 변수 목록

# ParameterListDescription
source: Parameter list.
sr: 매개 변수 목록입니다.

source: Memory Fractions
sr: 메모리 조각

# MemoryFractionsDescription
source: Memory fractions.
sr: 메모리 조각입니다.

source: Memory Fractions Input
sr: 메모리 조각 입력

# MemoryFractionsInputDescription
source: Memory fractions input.
sr: 메모리 조각 입력입니다.

source: Memory Fractions Output
sr: 메모리 조각 출력

# MemoryFractionsOutputDescription
source: Memory fractions output.
sr: 메모리 조각 출력입니다.

# UdxName
source: Name
sr: 이름

# UdxNameDescription
source: Name.
sr: 이름.

source: Values
sr: 값

# ValuesDescription
source: Values.
sr: 값입니다.

source: Cached plan size
sr: 캐시된 계획 크기

# CachedPlanSizeDescription
source: Cached plan size.
sr: 캐시된 계획 크기입니다.

source: Use plan
sr: 사용 계획

source: Contains Inline Scalar Tsql Udfs
sr: 인라인 스칼라 Tsql Udf 포함

source: Degree of Parallelism
sr: 병렬 처리 수준

# DegreeOfParallelismDescription
source: Degree of parallelism.
sr: 병렬 처리 수준입니다.

source: Effective Degree of Parallelism
sr: 효율적인 병렬 처리 수준
