Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.ServiceLayer/Localization/transXliff/*.*.xlf
Languages: sr

# HashMatchDescription
source: Use each row from the top input to build a hash table, and each row from the bottom input to probe into the hash table, outputting all matching rows.
sr: 최상위 입력의 각 행으로 해시 테이블을 작성하고 최하위 입력의 각 행으로 해시 테이블을 검색하여 일치하는 모든 행을 출력합니다.

source: Hash Match Team
sr: 해시 일치 팀

# HashMatchTeamDescription
source: A contributor among multiple cooperating hashing operations.
sr: 여러 협동 해시 연산의 기여자입니다.

source: Hash Match Root
sr: 해시 일치 루트

# HashMatchRootDescription
source: The root member of a team of connected hash operators sharing a common hash function and partitioning strategy.
sr: 연결된 해시 연산자 팀의 루트 멤버이며 공통 해시 함수와 분할 전략을 공유합니다.

source: Bookmark Lookup
sr: 책갈피 조회

# BookmarkLookupDescription
source: Use a Bookmark (RID or clustering key) to look up the corresponding row in the table or clustered index.
sr: 책갈피(RID 또는 클러스터링 키)를 사용하여 테이블 또는 클러스터형 인덱스의 해당 행을 조회합니다.

source: Log Row Scan
sr: 로그 행 검사

# LogRowScanDescription
source: Scan the rows in the log.
sr: 로그에 있는 행을 검색합니다.

source: Merge Join
sr: 조인 병합

# MergeJoinDescription
source: Match rows from two suitably sorted input tables exploiting their sort order.
sr: 적절하게 정렬된 두 입력 테이블에서 정렬 순서를 이용하여 행을 대응시킵니다.

source: Nested Loops
sr: 중첩 루프

# NestedLoopsDescription
source: For each row in the top (outer) input, scan the bottom (inner) input, and output matching rows.
sr: 최상위(외부) 입력의 각 행에 대해 최하위(내부) 입력을 검색하고 일치하는 행을 출력합니다.

# PrintDescription
source: Print.
sr: 항목을 인쇄합니다.

# ComputeScalarDescription
source: Compute new values from existing values in a row.
sr: 한 행의 기존 값에서 새 값을 컴퓨팅합니다.

# MergeIntervalDescription
source: Merge interval.
sr: 병합 간격입니다.

source: Rank
sr: 순위

# RankDescription
source: Creates a computed column with the rank of the values in an existing column in the table.
sr: 테이블에 있는 기존 열의 값 순위를 사용하여 계산 열을 만듭니다.

# RowCountSpoolDescription
source: Stores the data from the input into a temporary table in order to optimize rewinds.
sr: 되감기를 최적화하기 위해 입력의 데이터를 임시 테이블에 저장합니다.

# SegmentDescription
source: Segment.
sr: 세그먼트입니다.

source: Sequence
sr: 시퀀스

# SequenceDescription
source: Process each input, in sequence from top to bottom.
sr: 각 입력을 위에서 아래 방향으로 처리합니다.

# SequenceProjectDescription
source: Adds columns to perform computations over an ordered set.
sr: 정렬된 집합에 대해 계산을 수행하기 위해 열을 추가합니다.

# SplitDescription
source: Split.
sr: 분할합니다.

source: Stream Aggregate
sr: 스트림 집계

# StreamAggregateDescription
source: Compute summary values for groups of rows in a suitably sorted stream.
sr: 적절하게 정렬된 스트림에서 행 그룹에 대한 요약 값을 계산합니다.

source: Table Scan
sr: 테이블 검색

# TableScanDescription
source: Scan rows from a table.
sr: 테이블에서 행을 검색합니다.

source: Clustered Index Scan
sr: 클러스터형 인덱스 검사

# ClusteredIndexScanDescription
source: Scanning a clustered index, entirely or only a range.
sr: 클러스터형 인덱스에서 전체 또는 특정 범위를 검색합니다.

source: Clustered Index Seek
sr: 클러스터형 인덱스 검색

# ClusteredIndexSeekDescription
source: Scanning a particular range of rows from a clustered index.
sr: 클러스터형 인덱스에서 특정 범위의 행을 검색합니다.

source: Deleted Scan
sr: 삭제된 검사

# DeletedScanDescription
source: Scanning the pseudo-table 'deleted' within a trigger.
sr: 트리거 내에서 '삭제된 항목' 의사 테이블을 검색합니다.

source: Inserted Scan
sr: 삽입된 검사

# InsertedScanDescription
source: Scan the pseudo-table 'inserted' within a trigger.
sr: 트리거 내에서 '삽입된 항목' 의사 테이블을 검색합니다.

source: Parameter Table Scan
sr: 매개 변수 테이블 검사

# ParameterTableScanDescription
source: Scan an internal table of parameter values.
sr: 내부 매개 변수 값 테이블을 검색합니다.

source: Index Scan
sr: 인덱스 검사

# IndexScanDescription
source: Scan a nonclustered index, entirely or only a range.
sr: 비클러스터형 인덱스에서 전체 또는 한 범위만 검색합니다.

source: Index Seek
sr: 인덱스 검색

# IndexSeekDescription
source: Scan a particular range of rows from a nonclustered index.
sr: 비클러스터형 인덱스에서 특정 범위의 행을 검색합니다.

source: Columnstore Index Scan
sr: Columnstore 인덱스 검사

# ColumnstoreIndexScanDescription
source: Scan a columnstore index, entirely or only a range.
sr: columnstore 인덱스에서 전체 또는 특정 범위를 검색합니다.

source: Columnstore Index Update
sr: Columnstore 인덱스 업데이트

# ColumnstoreIndexUpdateDescription
source: Update rows in a columnstore index.
sr: columnstore 인덱스에서 행을 업데이트합니다.

source: Columnstore Index Insert
sr: Columnstore 인덱스 삽입

# ColumnstoreIndexInsertDescription
source: Insert rows in a columnstore index.
sr: columnstore 인덱스에서 행을 삽입합니다.

source: Columnstore Index Merge
sr: Columnstore 인덱스 병합

# ColumnstoreIndexMergeDescription
source: Merge rows in a columnstore index.
sr: columnstore 인덱스에서 행을 병합합니다.

source: Columnstore Index Delete
sr: columnstore 인덱스 삭제

# ColumnstoreIndexDeleteDescription
source: Delete rows from a columnstore index.
sr: columnstore 인덱스에서 행을 삭제합니다.

source: Remote Scan
sr: 원격 검사

# RemoteScanDescription
source: Scan rows in a table stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 테이블의 행을 검색합니다.

source: Remote Index Scan
sr: 원격 인덱스 검사

# RemoteIndexScanDescription
source: Scan an index stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 인덱스를 검색합니다.

source: Remote Index Seek
sr: 원격 인덱스 검색

# RemoteIndexSeekDescription
source: Scan a particular range of rows from a clustered index that is stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 클러스터형 인덱스에서 특정 행 범위를 검색합니다.

source: Remote Insert
sr: 원격 삽입

# RemoteInsertDescription
source: Insert rows into a table stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 테이블에 행을 삽입합니다.

source: Remote Update
sr: 원격 업데이트

# RemoteUpdateDescription
source: Update rows in a table stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 테이블의 행을 업데이트합니다.

source: Remote Delete
sr: 원격 삭제

# RemoteDeleteDescription
source: Delete rows in a table stored in a database or file other than the current database server.
sr: 현재 데이터베이스 서버가 아닌 다른 데이터베이스나 파일에 저장된 테이블의 행을 삭제합니다.

source: Clustered Update
sr: 클러스터형 업데이트

# ClusteredUpdateDescription
source: Clustered Update.
sr: 클러스터형 업데이트입니다.

# SortDescription
source: Sort the input.
sr: 입력을 정렬합니다.

# TableSpoolDescription
source: Stores the data from the input into a temporary table in order to optimize rewinds.
sr: 되감기를 최적화하기 위해 입력의 데이터를 임시 테이블에 저장합니다.

source: Index Spool
sr: 인덱스 스풀

# IndexSpoolDescription
source: Reformats the data from the input into a temporary index, which is then used for seeking with the supplied seek predicate.
sr: 입력의 데이터를 임시 인덱스로 다시 설정합니다. 이 임시 인덱스는 제공된 seek 조건자로 찾을 때 사용됩니다.

source: Table Update
sr: 테이블 업데이트

# TableUpdateDescription
source: Update input rows in the table specified in the Argument field.
sr: 인수 필드에서 지정한 테이블에 있는 입력 행을 업데이트합니다.

source: Table Insert
sr: 테이블 삽입

# TableInsertDescription
source: Insert input rows into the table specified in Argument field.
sr: 인수 필드에서 지정한 테이블에 입력 행을 삽입합니다.

source: Table Delete
sr: 테이블 삭제

# TableDeleteDescription
source: Delete input rows from the table specified in Argument field.
sr: 인수 필드에서 지정한 테이블에서 입력 행을 삭제합니다.

source: Table Merge
sr: 테이블 병합

# TableMergeDescription
source: Merge input rows in the table specified in Argument field.
sr: 인수 필드에서 지정한 테이블에서 입력 행을 병합합니다.

source: Index Update
sr: 인덱스 업데이트

# IndexUpdateDescription
source: Update rows in an index.
sr: 인덱스에서 행을 업데이트합니다.

source: Index Insert
sr: 인덱스 삽입

# IndexInsertDescription
source: Insert rows into an index.
sr: 인덱스로 행을 삽입합니다.

source: Index Delete
sr: 인덱스 삭제

# IndexDeleteDescription
source: Delete rows from index.
sr: 인덱스에서 행을 삭제합니다.

source: Clustered Index Update
sr: 클러스터형 인덱스 업데이트

# ClusteredIndexUpdateDescription
source: Update rows in a clustered index.
sr: 클러스터형 인덱스의 행을 업데이트합니다.

source: Clustered Index Insert
sr: 클러스터형 인덱스 삽입

# ClusteredIndexInsertDescription
source: Insert rows in a clustered index.
sr: 클러스터형 인덱스에 행을 삽입합니다.

source: Clustered Index Merge
sr: 클러스터형 인덱스 병합

# ClusteredIndexMergeDescription
source: Merge rows in a clustered index.
sr: 클러스터형 인덱스의 행을 병합합니다.

source: Clustered Index Delete
sr: 클러스터형 인덱스 삭제

# ClusteredIndexDeleteDescription
source: Delete rows from a clustered index.
sr: 클러스터형 인덱스에서 행을 삭제합니다.

# TopDescription
source: Select the first few rows based on a sort order.
sr: 정렬 순서를 기준으로 처음 몇 행을 선택합니다.

# BitmapDescription
source: Bitmap.
sr: 비트맵입니다.

# UDXDescription
source: UDX.
sr: UDX입니다.

# WindowDescription
source: Expands each row into the set of rows that represent the window associated with it.
sr: 연결된 창을 나타내는 행 집합으로 각 행을 확장합니다.

source: Window Aggregate
sr: 창 집계

# WindowAggregateDescription
source: Computes values of functions across the windows defined by the OVER clause. Input rowset is suitably sorted stream.
sr: OVER 절로 정의된 창 전체에서 함수 값을 계산합니다. 입력 행 집합은 적절하게 정렬된 스트림입니다.

# BatchHashTableBuildDescription
source: Batch Hash Table Build.
sr: 일괄 처리 해시 테이블 작성

source: Switch
sr: 전환

# SwitchDescription
source: Switch.
sr: 전환을 수행합니다.

# TFP
source: Predict
sr: 예측

# TFPDescription
source: Applies a trained machine learning model to input data
sr: 입력 데이터에 학습된 기계 학습 모델을 적용합니다.

# TableValueFunction
source: Table Valued Function
sr: 테이블 반환 함수

# TableValueFunctionDescription
source: Table valued function.
sr: 테이블 반환 함수입니다.

source: Aggregate
sr: 집계

# AggregateDescription
source: Calculates an expression containing SUM, COUNT, MIN, MAX, or AVG.
sr: SUM, COUNT, MIN, MAX 또는 AVG를 포함하는 식을 계산합니다.

source: Arithmetic Expression
sr: 산술 식

# ArithmeticExpressionDescription
source: Computes a new value from existing values in a row.
sr: 한 행의 기존 값에서 새 값을 계산합니다.

source: Delete
sr: 삭제

# DeleteDescription
source: Removes the specified rows from the specified table.
sr: 지정한 테이블에서 지정한 행을 제거합니다.

source: Insert
sr: 삽입

# InsertDescription
source: Adds a row to table.
sr: 테이블에 행을 추가합니다.

source: Locate
sr: 찾기

# LocateDescription
source: Fetching a full row from a heap or a clustered index.
sr: 힙 또는 클러스터형 인덱스에서 전체 행을 인출합니다.

# SpoolDescription
source: Saving temporarily an intermediate query result.
sr: 중간 쿼리 결과를 임시 저장합니다.

# SQLDescription
source: SQL.
sr: SQL입니다.

source: Update
sr: 업데이트

# UpdateDescription
source: Modify the values in the specified table.
sr: 지정한 테이블에서 값을 수정합니다.

source: Assign
sr: 할당

# AssignDescription
source: Validate referential integrity constraints.
sr: 참조 무결성 제약 조건의 유효성을 검사합니다.

source: Convert
sr: 변환

# ConvertDescription
source: Implicit or explicit conversion of one scalar datatype to another.
sr: 스칼라 데이터 형식을 다른 데이터 형식으로 암시적 또는 명시적으로 변환합니다.

source: Declare
sr: 선언

# DeclareDescription
source: Allocates a local variable.
sr: 지역 변수를 할당합니다.

# IfDescription
source: Conditional processing based on an expression.
sr: 식을 기준으로 조건에 따라 처리합니다.

source: Intrinsic
sr: 내장

# IntrinsicDescription
source: Invokes an internal Transact-SQL function.
sr: 내부 Transact-SQL 함수를 호출합니다.

source: Set Function
sr: 집계 함수

# SetFunctionDescription
source: Set Function.
sr: 집합 함수입니다.

source: Dynamic
sr: 동적

# DynamicDescription
source: Cursor that can see all changes made by others.
sr: 다른 사용자의 변경 내용을 모두 볼 수 있는 커서입니다.

source: Fetch Query
sr: 쿼리 가져오기

# FetchQueryDescription
source: The query used to retrieve rows when a fetch is issued against a cursor.
sr: 커서에 대해 인출이 실행될 때 행 검색에 사용되는 쿼리입니다.

source: Fast Forward
sr: 빨리 감기

# FastForwardDescription
source: Fast Forward.
sr: 빨리 감기를 수행합니다.

# KeysetDescription
source: Cursor that can see updates made by others, but not inserts.
sr: 다른 사용자의 업데이트 내용은 볼 수 있지만 삽입 내용은 볼 수 없는 커서입니다.

source: Population Query
sr: 모집단 쿼리

# PopulationQueryDescription
source: The query used to populate a cursor's work table when the cursor is opened.
sr: 커서가 열려 있을 때 커서의 작업 테이블을 채우는 데 사용되는 쿼리입니다.

source: Refresh Query
sr: 쿼리 새로 고침

# RefreshQueryDescription
source: Fetches current data for rows in fetch buffer.
sr: 인출 버퍼의 행에 대한 현재 데이터를 인출합니다.

source: Snapshot
sr: 스냅숏

# SnapshotDescription
source: A cursor that does not see changes made by others.
sr: 다른 사용자가 변경한 내용이 보이지 않는 커서입니다.

source: RID Lookup
sr: RID 조회

# RIDLookupDescription
source: RID Lookup
sr: RID 조회

source: Key Lookup
sr: 키 조회

# KeyLookupDescription
source: Uses a supplied clustering key to lookup on a table that has a clustered index.
sr: 제공된 클러스터링 키를 사용하여 클러스터형 인덱스가 있는 테이블을 조회합니다.

# LogicalKeyLookup
source: Key Lookup
sr: 키 조회

source: Adaptive Join
sr: 적응형 조인

# AdaptiveJoinDescription
source: Chooses dynamically between hash join and nested loops.
sr: 해시 조인과 중첩된 루프 간을 동적으로 선택합니다.

source: Foreign Key References Check
sr: 외래 키 참조 확인

# ForeignKeyReferencesCheckDescription
source: Checks referential integrity of the delete operation.
sr: 삭제 작업의 참조 무결성을 확인합니다.

source: Apply
sr: 적용

# ApplyDescription
source: Apply opration.
sr: 적용 작업입니다.

source: Broadcast
sr: 브로드캐스트

# BroadcastDescription
source: Broadcast data movement.
sr: 브로드캐스트 데이터 이동입니다.

source: Compute To Control Node
sr: 컴퓨팅-제어 노드

# ComputeToControlNodeDescription
source: Data flow from compute nodes to control node.
sr: 컴퓨팅 노드부터 제어 노드까지의 데이터 흐름입니다.

# ConstTableGet
source: Constant Table Get
sr: 상수 테이블 가져오기

# ConstTableGetDescription
source: Get tuples from contant table.
sr: 상수 테이블에서 튜플을 가져옵니다.

source: Control To Compute Nodes
sr: 제어-컴퓨팅 노드

# ControlToComputeNodesDescription
source: Data flow from control node to compute nodes.
sr: 제어 노드부터 컴퓨팅 노드까지의 데이터 흐름입니다.

source: External Broadcast
sr: 외부 브로드캐스트

# ExternalBroadcastDescription
source: Broadcast data movement for external table.
sr: 외부 테이블에 대한 브로드캐스트 데이터 이동입니다.

source: External Export
sr: 외부 내보내기

# ExternalExportDescription
source: Export data movement for external table.
sr: 외부 테이블에 대한 내보내기 데이터 이동입니다.

source: External Local Streaming
sr: 외부 로컬 스트리밍

# ExternalLocalStreamingDescription
source: Streaming data movement between external table and local table.
sr: 외부 테이블과 로컬 테이블 사이의 스트리밍 데이터 이동입니다.

source: External RoundRobin
sr: 외부 라운드 로빈

# ExternalRoundRobinDescription
source: RoundRobin data movement for external table.
sr: 외부 테이블에 대한 라운드 로빈 데이터 이동입니다.

source: External Shuffle
sr: 외부 무작위 재생

# ExternalShuffleDescription
source: Shuffle data movement for external table.
sr: 외부 테이블에 대한 무작위 재생 데이터 이동입니다.

source: Get
sr: 가져오기

# GetDescription
source: Get tuples from table.
sr: 테이블에서 튜플을 가져옵니다.

# GbApply
source: Group by and Apply
sr: 그룹화 및 적용

# GbApplyDescription
source: Group by and Apply.
sr: 그룹화하고 적용합니다.

# GbAgg
source: Group by Aggregates
sr: 집계별로 그룹화

# GbAggDescription
source: Group by aggregates.
sr: 집계별로 그룹화합니다.

source: Join
sr: 가입

# JoinDescription
source: Join tables.
sr: 테이블을 조인합니다.

# LocalCube
source: Rollup Aggregate
sr: 롤업 집계

# LocalCubeDescription
source: This represents a ROLLUP operator or a CUBE operator.
sr: ROLLUP 연산자 또는 CUBE 연산자를 나타냅니다.

source: Project
sr: 프로젝트

# ProjectDescription
source: Project columns.
sr: 프로젝트 열입니다.

source: Shuffle
sr: 무작위 재생

# ShuffleDescription
source: Shuffle data movement.
sr: 무작위 재생 데이터 이동입니다.

source: Single Source RoundRobin
sr: 단일 원본 라운드 로빈

# SingleSourceRoundRobinDescription
source: Single Source RoundRobin data movement.
sr: 단일 원본 라운드 로빈 데이터 이동입니다.

source: Single Source Shuffle
sr: 단일 원본 무작위 재생

# SingleSourceShuffleDescription
source: Single Source Shuffle data movement.
sr: 단일 원본 무작위 재생 데이터 이동입니다.

source: Trim
sr: 자르기

# TrimDescription
source: Trim data.
sr: 데이터를 자릅니다.

source: Union
sr: 합집합

# UnionDescription
source: Union tables.
sr: 합집합 테이블입니다.

source: Union All
sr: 모두 합집합

# UnionAllDescription
source: Union All tables.
sr: 모두 통합 테이블입니다.

# SizeInBytesFormat
source: {0} B
sr: {0}바이트

# TableNotInitializedException
source: Initialization is not properly done for table with id '{0}'
sr: ID가 '{0}'인 테이블에 대해 초기화가 제대로 수행되지 않았습니다.

# TableColumnIdentityGroupName
source: Identity Specification
sr: ID 사양

# TableColumnIsIdentityPropertyTitle
source: Is Identity
sr: ID

# TableColumnIsIdentityPropertyDescription
source: Specifies whether the column is the identity column for the table.
sr: 열이 테이블의 ID 열인지 여부를 지정합니다.

# TableColumnIdentityIncrementPropertyTitle
source: Identity Increment
sr: ID 증분

# TableColumnIdentityIncrementPropertyDescription
source: Displays the value added to the maximum existing row identity value when generating the next identity value.
sr: 다음 ID 값을 생성할 때 최대 기존 행 ID 값에 추가되는 값을 표시합니다.

# TableColumnIdentitySeedPropertyTitle
source: Identity Seed
sr: ID 시드

# TableColumnIdentitySeedPropertyDescription
source: Displays the initial row value for an identity column.
sr: ID 열의 초기 행 값을 표시합니다.

# TableEditPathNotProvidedException
source: The path in the table change information cannot be empty
sr: 테이블 변경 정보의 경로는 비워 둘 수 없습니다.

# InvalidTableEditPathException
source: The path '{0}' in the table change information is not valid for edit type: '{1}'
sr: 테이블 변경 정보의 '{0}' 경로가 편집 형식에 적합하지 않습니다. '{1}'

# TableDesignerIsEnabledPropertyTitle
source: Is Enabled
sr: 사용됨

# ForeignKeyIsEnabledDescription
source: Specifies whether the foreign key is Enabled
sr: 외래 키를 사용할지 여부를 지정합니다.

# ForeignKeyIsNotForReplicationTitle
source: Not For Replication
sr: 복제용 아님

# ForeignKeyIsNotForReplicationDescription
source: Enables or disables the constraint for data inserted by a replication process.
sr: 복제 프로세스에서 삽입한 데이터에 대한 제약 조건을 사용하거나 사용하지 않도록 설정합니다.

# SqlForeignKeyAction_NoAction
source: No Action
sr: 조치 없음

# SqlForeignKeyAction_Cascade
source: Cascade
sr: 계단식 배열

# SqlForeignKeyAction_SetNull
source: Set Null
sr: Null 설정

# SqlForeignKeyAction_SetDefault
source: Set Default
sr: 기본값 설정

# CheckConstraintIsEnabledDescription
source: Specifies whether the check constraint is Enabled
sr: CHECK 제약 조건을 사용할지 여부를 지정합니다.

# QueryServiceUnsupportedSqlVariantType
source: The underlying type "{0}" for sql variant column "{1}" could not be resolved.
sr: SQL 변형 열 "{1}"의 기본 유형 "{0}"을(를) 확인할 수 없습니다.

# IndexIsEnabledPropertyDescription
source: Specifies whether the index is enabled
sr: 인덱스를 사용할지 여부를 지정합니다.

# IndexIsClusteredPropertyDescription
source: Whether the index is clustered, only one clustered index is allowed in a table.
sr: 인덱스가 클러스터되는지 여부를 지정합니다. 테이블에서 클러스터된 인덱스는 하나만 허용됩니다.

# TableDesignerIndexIsClusteredPropertyTitle
source: Is Clustered
sr: 클러스터형 여부

# IndexIsUniquePropertyDescription
source: Whether the data entered into this index must be unique.
sr: 이 인덱스로 입력한 데이터가 고유해야 하는지 여부입니다.

# TableDesignerIsUniquePropertyTitle
source: Is Unique
sr: 고유함

# IndexColumnIsAscendingPropertyDescription
source: Specifies the sort order of the column.
sr: 열의 정렬 순서를 지정합니다.

# IndexColumnIsAscendingPropertyTitle
source: Is Ascending
sr: 오름차순

# TableDesignerColumnsDisplayValueTitle
source: Columns
sr: 열

# TableDesignerDeleteColumnConfirmationMessage
source: Removing a column will also remove it from the indexes and foreign keys. Are you sure you want to continue?
sr: 열을 제거하면 인덱스 및 외장 키에서도 제거됩니다. 계속하시겠습니까?

# MissingIndexFormat
source: Missing Index (Impact {0}): {1}
sr: 인덱스 없음(영향 {0}): {1}

# MissingIndexDetailsTitle
source: /* Missing Index Details from {0} The Query Processor estimates that implementing the following index could improve the query cost by {1}%. */
sr: /* {0}의 인덱스 세부 정보 없음 쿼리 프로세서에서는 다음 인덱스를 구현하는 경우 쿼리 비용이 {1}%만큼 향상될 수 있다고 평가합니다. */

# CreateSasForBlobContainerFailed
source: Cannot generate SAS URI for blob container.
sr: Blob 컨테이너에 대한 SAS URI를 생성할 수 없습니다.

# WriteSASCredentialToSqlServerFailed
source: Failed storing shared access signature token on the SQL Servers.
sr: SQL Server에 공유 액세스 서명 토큰을 저장하지 못했습니다.

# UnsupportedDeviceType
source: Unsupported device type {0} for engine edition {1}.
sr: 엔진 버전 {1}에 대해 지원되지 않는 디바이스 유형 {0}입니다.

# NotSupportedCloudCreateSas
source: Create shared access signature is not supported for cloud instances.
sr: 공유 액세스 서명 만들기는 클라우드 인스턴스에 대해 지원되지 않습니다.

# TableDesignerGraphTableTypeTitle
source: Type
sr: 형식

# TableDesignerGraphTableTypeNode
source: Node
sr: 노드

# TableDesignerGraphTableGroupTitle
source: Graph Table
sr: 그래프 테이블

# TableDesignerEdgeConstraintsTabTitle
source: Edge Constraints
sr: 에지 제약 조건

# TableDesignerEdgeConstraintObjectType
source: Edge Constraint
sr: 새 에지 제약 조건

# TableDesignerEdgeConstraintNamePropertyDescription
source: Name of the constraint.
sr: 제약 조건의 이름입니다.

# TableDesignerEdgeConstraintNamePropertyTitle
source: Name
sr: 이름

# TableDesignerEdgeConstraintIsEnabledPropertyDescription
source: Specifies whether the constraint is enabled.
sr: 인덱스를 사용할지 여부를 지정합니다.

# TableDesignerEdgeConstraintIsEnabledPropertyTitle
source: Is Enabled
sr: 사용됨

# TableDesignerEdgeConstraintOnDeleteActionPropertyDescription
source: The behavior when a user tries to delete a row with data that is involved in an edge constraint.
sr: 사용자가 외래 키 관계에 포함된 데이터가 있는 행을 삭제하려고 할 때 수행할 동작입니다.

# TableDesignerEdgeConstraintOnDeleteActionPropertyTitle
source: On Delete Action
sr: 삭제 시 작업

# TableDesignerEdgeConstraintClausesPropertyDescription
source: Edge constraint clauses.
sr: Edge 제약 조건 절입니다.

# TableDesignerEdgeConstraintClausesPropertyTitle
source: Clauses
sr: 절

# TableDesignerEdgeConstraintClauseObjectType
source: Clause
sr: 절

# TableDesignerEdgeConstraintClauseFromTablePropertyName
source: From Table
sr: 테이블에서

# TableDesignerEdgeConstraintClauseToTablePropertyName
source: To Table
sr: 대상 테이블

# TableDesignerGraphTableTypeNone
source: None
sr: 없음

# TableDesignerGraphTableTypeDescription
source: Specifies the table type.
sr: 테이블 형식을 지정합니다.

# UnknownEnumString
source: Unknown enum value: {0}.
sr: 알 수 없는 열거형 값: {0}.

# SqlTableDurability_SchemaAndData
source: Schema and Data
sr: 스키마 및 데이터

# SqlTableDurability_SchemaOnly
source: Schema Only
sr: 스키마만

# GeneratedAlwaysColumnType_None
source: None
sr: 없음

# GeneratedAlwaysColumnType_RowStart
source: Row Start
sr: 행 시작

# GeneratedAlwaysColumnType_RowEnd
source: Row End
sr: 행 끝

# TableDesignerIsSystemVersioningEnabledTitle
source: System Versioning Enabled
sr: 시스템 버전 관리 사용

# TableDesignerIsSystemVersioningEnabledDescription
source: Specifies whether the table is system versioning enabled.
sr: 테이블이 시스템 버전 관리를 사용할 수 있는지 여부를 지정합니다.

# TableDesignerSystemVersioningGroupTitle
source: System Versioning
sr: 시스템 버전 관리

# TableDesignerHistoryTableDescription
source: History table of the current table.
sr: 현재 테이블의 기록 테이블입니다.

# TableDesignerHistoryTableTitle
source: History Table
sr: 기록 테이블

# TableDesignerIsMemoryOptimizedDescription
source: Specifies whether the table is memory optimized.
sr: 테이블이 메모리 액세스에 최적화되어 있는지 여부를 나타냅니다.

# TableDesignerMemoryOptimizedGroupTitle
source: Memory Optimized
sr: 메모리에 최적화

# TableDesignerIsMemoryOptimizedTitle
source: Memory Optimized
sr: 메모리에 최적화

# TableDesignerDurabilityDescription
source: Specifies the durability setting of the table.
sr: 테이블의 내구성 설정을 지정합니다.

# TableDesignerDurabilityTitle
source: Durability
sr: 내구성

# TableDesignerColumnGeneratedAlwaysAsDescription
source: Specifies the start or end of the system versioning table's period setting.
sr: 시스템 버전 관리 테이블의 기간 설정의 시작 또는 끝을 지정합니다.

# TableDesignerColumnGeneratedAlwaysAsTitle
source: Generated Always As
sr: 항상 생성됨

# TableDesignerColumnIsHiddenTitle
source: Is Hidden
sr: 숨김

# TableDesignerColumnIsHiddenDescription
source: Specifies whether the column will be returned by select statement.
sr: select 문으로 열을 반환할지 여부를 지정합니다.

# TableDesignerAutoCreateHistoryTableDescription
source: Specifies whether the engine should automatically create the history table.
sr: 엔진에서 기록 테이블을 자동으로 만들지 여부를 지정합니다.

# TableDesignerAutoCreateHistoryTableTitle
source: Auto Create History Table
sr: 기록 테이블 자동 만들기

# TableDesignerNewHistoryTableDescription
source: Specifies the name of the new history table.
sr: 새 기록 테이블의 이름을 지정합니다.

# TableDesignerNewHistoryTableTitle
source: New History Table Name
sr: 기록 테이블 이름

# TableColumnDefaultConstraintNamePropertyDescription
source: Specifies the default constraint name.
sr: 기본 제약 조건 이름을 지정합니다.

# TableColumnDefaultConstraintNamePropertyTitle
source: Default Constraint Name
sr: 기본 제약 조건 이름
