Repository: Microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.Hosting/Localization/transXliff/*.*.xlf
Languages: sr

# CredentialsServiceInvalidCriticalHandle
source: Invalid CriticalHandle!
sr: CriticalHandle non valido!

# CredentialsServicePasswordLengthExceeded
source: The password has exceeded 512 bytes
sr: La password ha superato i 512 byte

# CredentialsServiceTargetForDelete
source: Target must be specified to delete a credential
sr: È necessario specificare la destinazione per eliminare una credenziale

# CredentialsServiceTargetForLookup
source: Target must be specified to check existance of a credential
sr: È necessario specificare la destinazione per verificare l'esistenza di una credenziale

# CredentialServiceWin32CredentialDisposed
source: Win32Credential object is already disposed
sr: L'oggetto Win32Credential è già stato eliminato

# HostingUnexpectedEndOfStream
source: MessageReader's input stream ended unexpectedly, terminating
sr: Il flusso di input di MessageReader è terminato in modo imprevisto, terminando

# HostingHeaderMissingColon
source: Message header must separate key and value using ':'
sr: L'intestazione del messaggio deve separare chiave e valore utilizzando ':'

# HostingHeaderMissingContentLengthHeader
source: Fatal error: Content-Length header must be provided
sr: Errore irreversibile: è necessario fornire l'intestazione Content-Length

# HostingHeaderMissingContentLengthValue
source: Fatal error: Content-Length value is not an integer
sr: Errore irreversibile: il valore Content-Length non è un numero intero

# ServiceAlreadyRegistered
source: Cannot register service for type {0}, one or more services already registered
sr: Impossibile registrare il servizio per {0} tipo, uno o più servizi già registrati

# MultipleServicesFound
source: Multiple services found for type {0}, expected only 1
sr: Più servizi trovati per il tipo {0}, previsti solo 1

# IncompatibleServiceForExtensionLoader
source: Service of type {0} cannot be created by ExtensionLoader<{1}>
sr: Impossibile creare un servizio {0} tipo da ExtensionLoader<{1}>

# ServiceProviderNotSet
source: SetServiceProvider() was not called to establish the required service provider
sr: SetServiceProvider() non è stato chiamato per stabilire il provider di servizi richiesto

# ServiceNotFound
source: Service {0} was not found in the service provider
sr: Il {0} di servizio non è stato trovato nel provider di servizi

# ServiceNotOfExpectedType
source: Service of Type {0} is not compatible with registered Type {1}
sr: Il servizio di tipo {0} non è compatibile con il tipo registrato {1}
