Repository: microsoft/sqltoolsservice
Catalog: src/Microsoft.SqlTools.Hosting/Localization/transXliff/*.*.xlf
Languages: sr

# CredentialsServiceInvalidCriticalHandle
source: Invalid CriticalHandle!
sr: 無効なクリティカル ハンドルです。

# CredentialsServicePasswordLengthExceeded
source: The password has exceeded 512 bytes
sr: パスワードが 512 バイトを超えました

# CredentialsServiceTargetForDelete
source: Target must be specified to delete a credential
sr: 資格情報を削除するには、ターゲットを指定する必要があります

# CredentialsServiceTargetForLookup
source: Target must be specified to check existance of a credential
sr: 資格情報の存在を確認するには、ターゲットを指定する必要があります。

# CredentialServiceWin32CredentialDisposed
source: Win32Credential object is already disposed
sr: Win32Credential オブジェクトは既に破棄されています。

# HostingUnexpectedEndOfStream
source: MessageReader's input stream ended unexpectedly, terminating
sr: メッセージ リーダーの入力ストリームが予期せず終了し、終了しました

# HostingHeaderMissingColon
source: Message header must separate key and value using ':'
sr: メッセージ ヘッダーは、':' を使用してキーと値を区切る必要があります。

# HostingHeaderMissingContentLengthHeader
source: Fatal error: Content-Length header must be provided
sr: 致命的なエラー: コンテンツ長ヘッダーを指定する必要があります

# HostingHeaderMissingContentLengthValue
source: Fatal error: Content-Length value is not an integer
sr: 致命的なエラー: コンテンツの長さの値は整数ではありません

# ServiceAlreadyRegistered
source: Cannot register service for type {0}, one or more services already registered
sr: 1 つ以上のサービスが既に登録されているため、タイプ {0} のサービスを登録できません

# MultipleServicesFound
source: Multiple services found for type {0}, expected only 1
sr: 複数のタイプ {0} のサービスが見つかりました。1 つのサービスのみが必要です

# IncompatibleServiceForExtensionLoader
source: Service of type {0} cannot be created by ExtensionLoader<{1}>
sr: {0} 型のサービス、拡張ローダー <{1}> で作成できない

# ServiceProviderNotSet
source: SetServiceProvider() was not called to establish the required service provider
sr: 必要なサービスプロバイダーを確立するために"SetServiceProvider()"が呼び出されませんでした

# ServiceNotFound
source: Service {0} was not found in the service provider
sr: サービス {0} がサービス プロバイダで見つかりませんでした

# ServiceNotOfExpectedType
source: Service of Type {0} is not compatible with registered Type {1}
sr: タイプ {0} のサービスは、登録されたタイプ {1} と互換性がありません
